#pragma once
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/Xml/zzzz__DtdProcessing_def.hpp"
#include "System/Xml/zzzz__EntityHandling_def.hpp"
#include "System/Xml/zzzz__LineInfo_def.hpp"
#include "System/Xml/zzzz__ReadState_def.hpp"
#include "System/Xml/zzzz__WhitespaceHandling_def.hpp"
#include "System/Xml/zzzz__XmlCharType_def.hpp"
#include "System/Xml/zzzz__XmlNamespaceManager_def.hpp"
#include "System/Xml/zzzz__XmlNodeType_def.hpp"
#include "System/Xml/zzzz__XmlReader_def.hpp"
#include "System/Xml/zzzz__XmlSpace_def.hpp"
#include "System/Xml/zzzz__XmlTextReaderImpl_def.hpp"
#include "System/zzzz__MulticastDelegate_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(XmlTextReaderImpl)
namespace System::Collections::Generic {
template <typename TKey, typename TValue> class Dictionary_2;
}
namespace System::Collections::Generic {
template <typename T> class IComparer_1;
}
namespace System::Collections {
class IEnumerator;
}
namespace System::IO {
class Stream;
}
namespace System::IO {
class TextReader;
}
namespace System::Text {
class Decoder;
}
namespace System::Text {
class Encoding;
}
namespace System::Text {
class StringBuilder;
}

class __XmlTextReaderImpl__OnDefaultAttributeUseDelegate;
}
namespace System::Xml {
struct __XmlTextReaderImpl__ParsingFunction;
}
namespace System::Xml {
struct __XmlTextReaderImpl__ParsingMode;
}
namespace System::Xml {
struct __XmlTextReaderImpl__ParsingState;
}
namespace System::Xml {
class __XmlTextReaderImpl__XmlContext;
}
namespace System {
class Exception;
}
namespace System {
class IComparable;
}
namespace System {
class Object;
}
namespace System {
template <typename T1, typename T2, typename T3, typename T4> class Tuple_4;
}
namespace System {
class Uri;
}
// Forward declare root types
namespace System::Xml {
struct __XmlTextReaderImpl__EntityExpandType;
}
namespace System::Xml {
struct __XmlTextReaderImpl__EntityType;
}
namespace System::Xml {
struct __XmlTextReaderImpl__IncrementalReadState;
}
namespace System::Xml {
struct __XmlTextReaderImpl__InitInputType;
}
namespace System::Xml {
struct __XmlTextReaderImpl__ParsingFunction;
}
namespace System::Xml {
struct __XmlTextReaderImpl__ParsingMode;
}
namespace System::Xml {
class XmlTextReaderImpl;
}
namespace System::Xml {
class __XmlTextReaderImpl__DtdDefaultAttributeInfoToNodeDataComparer;
}
namespace System::Xml {
class __XmlTextReaderImpl__DtdParserProxy;
}
namespace System::Xml {
class __XmlTextReaderImpl__LaterInitParam;
}
namespace System::Xml {
class __XmlTextReaderImpl__NoNamespaceManager;
}
namespace System::Xml {
class __XmlTextReaderImpl__NodeData;
}
namespace System::Xml {
class __XmlTextReaderImpl__OnDefaultAttributeUseDelegate;
}
namespace System::Xml {
class __XmlTextReaderImpl__XmlContext;
}
namespace System::Xml {
struct __XmlTextReaderImpl__ParsingState;
}
// Write type traits
MARK_VAL_T(::System::Xml::__XmlTextReaderImpl__EntityExpandType);
MARK_VAL_T(::System::Xml::__XmlTextReaderImpl__EntityType);
MARK_VAL_T(::System::Xml::__XmlTextReaderImpl__IncrementalReadState);
MARK_VAL_T(::System::Xml::__XmlTextReaderImpl__InitInputType);
MARK_VAL_T(::System::Xml::__XmlTextReaderImpl__ParsingFunction);
MARK_VAL_T(::System::Xml::__XmlTextReaderImpl__ParsingMode);
MARK_REF_PTR_T(::System::Xml::XmlTextReaderImpl);
MARK_REF_PTR_T(::System::Xml::__XmlTextReaderImpl__DtdDefaultAttributeInfoToNodeDataComparer);
MARK_REF_PTR_T(::System::Xml::__XmlTextReaderImpl__DtdParserProxy);
MARK_REF_PTR_T(::System::Xml::__XmlTextReaderImpl__LaterInitParam);
MARK_REF_PTR_T(::System::Xml::__XmlTextReaderImpl__NoNamespaceManager);
MARK_REF_PTR_T(::System::Xml::__XmlTextReaderImpl__NodeData);
MARK_REF_PTR_T(::System::Xml::__XmlTextReaderImpl__OnDefaultAttributeUseDelegate);
MARK_REF_PTR_T(::System::Xml::__XmlTextReaderImpl__XmlContext);
MARK_VAL_T(::System::Xml::__XmlTextReaderImpl__ParsingState);
// Type: ::ParsingFunction
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace System::Xml {
// Is value type: true
// CS Name: ::XmlTextReaderImpl::ParsingFunction
struct CORDL_TYPE __XmlTextReaderImpl__ParsingFunction {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____XmlTextReaderImpl__ParsingFunction_Unwrapped
  enum struct ____XmlTextReaderImpl__ParsingFunction_Unwrapped : int32_t {
    __E_ElementContent = static_cast<int32_t>(0x0),
    __E_NoData = static_cast<int32_t>(0x1),
    __E_OpenUrl = static_cast<int32_t>(0x2),
    __E_SwitchToInteractive = static_cast<int32_t>(0x3),
    __E_SwitchToInteractiveXmlDecl = static_cast<int32_t>(0x4),
    __E_DocumentContent = static_cast<int32_t>(0x5),
    __E_MoveToElementContent = static_cast<int32_t>(0x6),
    __E_PopElementContext = static_cast<int32_t>(0x7),
    __E_PopEmptyElementContext = static_cast<int32_t>(0x8),
    __E_ResetAttributesRootLevel = static_cast<int32_t>(0x9),
    __E_Error = static_cast<int32_t>(0xa),
    __E_Eof = static_cast<int32_t>(0xb),
    __E_ReaderClosed = static_cast<int32_t>(0xc),
    __E_EntityReference = static_cast<int32_t>(0xd),
    __E_InIncrementalRead = static_cast<int32_t>(0xe),
    __E_FragmentAttribute = static_cast<int32_t>(0xf),
    __E_ReportEndEntity = static_cast<int32_t>(0x10),
    __E_AfterResolveEntityInContent = static_cast<int32_t>(0x11),
    __E_AfterResolveEmptyEntityInContent = static_cast<int32_t>(0x12),
    __E_XmlDeclarationFragment = static_cast<int32_t>(0x13),
    __E_GoToEof = static_cast<int32_t>(0x14),
    __E_PartialTextValue = static_cast<int32_t>(0x15),
    __E_InReadAttributeValue = static_cast<int32_t>(0x16),
    __E_InReadValueChunk = static_cast<int32_t>(0x17),
    __E_InReadContentAsBinary = static_cast<int32_t>(0x18),
    __E_InReadElementContentAsBinary = static_cast<int32_t>(0x19),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____XmlTextReaderImpl__ParsingFunction_Unwrapped() const noexcept {
    return static_cast<____XmlTextReaderImpl__ParsingFunction_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __XmlTextReaderImpl__ParsingFunction();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __XmlTextReaderImpl__ParsingFunction(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field AfterResolveEmptyEntityInContent value: static_cast<int32_t>(0x12)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const AfterResolveEmptyEntityInContent;

  /// @brief Field AfterResolveEntityInContent value: static_cast<int32_t>(0x11)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const AfterResolveEntityInContent;

  /// @brief Field DocumentContent value: static_cast<int32_t>(0x5)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const DocumentContent;

  /// @brief Field ElementContent value: static_cast<int32_t>(0x0)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const ElementContent;

  /// @brief Field EntityReference value: static_cast<int32_t>(0xd)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const EntityReference;

  /// @brief Field Eof value: static_cast<int32_t>(0xb)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const Eof;

  /// @brief Field Error value: static_cast<int32_t>(0xa)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const Error;

  /// @brief Field FragmentAttribute value: static_cast<int32_t>(0xf)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const FragmentAttribute;

  /// @brief Field GoToEof value: static_cast<int32_t>(0x14)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const GoToEof;

  /// @brief Field InIncrementalRead value: static_cast<int32_t>(0xe)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const InIncrementalRead;

  /// @brief Field InReadAttributeValue value: static_cast<int32_t>(0x16)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const InReadAttributeValue;

  /// @brief Field InReadContentAsBinary value: static_cast<int32_t>(0x18)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const InReadContentAsBinary;

  /// @brief Field InReadElementContentAsBinary value: static_cast<int32_t>(0x19)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const InReadElementContentAsBinary;

  /// @brief Field InReadValueChunk value: static_cast<int32_t>(0x17)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const InReadValueChunk;

  /// @brief Field MoveToElementContent value: static_cast<int32_t>(0x6)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const MoveToElementContent;

  /// @brief Field NoData value: static_cast<int32_t>(0x1)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const NoData;

  /// @brief Field OpenUrl value: static_cast<int32_t>(0x2)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const OpenUrl;

  /// @brief Field PartialTextValue value: static_cast<int32_t>(0x15)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const PartialTextValue;

  /// @brief Field PopElementContext value: static_cast<int32_t>(0x7)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const PopElementContext;

  /// @brief Field PopEmptyElementContext value: static_cast<int32_t>(0x8)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const PopEmptyElementContext;

  /// @brief Field ReaderClosed value: static_cast<int32_t>(0xc)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const ReaderClosed;

  /// @brief Field ReportEndEntity value: static_cast<int32_t>(0x10)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const ReportEndEntity;

  /// @brief Field ResetAttributesRootLevel value: static_cast<int32_t>(0x9)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const ResetAttributesRootLevel;

  /// @brief Field SwitchToInteractive value: static_cast<int32_t>(0x3)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const SwitchToInteractive;

  /// @brief Field SwitchToInteractiveXmlDecl value: static_cast<int32_t>(0x4)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const SwitchToInteractiveXmlDecl;

  /// @brief Field XmlDeclarationFragment value: static_cast<int32_t>(0x13)
  static ::System::Xml::__XmlTextReaderImpl__ParsingFunction const XmlDeclarationFragment;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::System::Xml::__XmlTextReaderImpl__ParsingFunction, 0x4>, "Size mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingFunction, value__) == 0x0, "Offset mismatch!");

} // namespace System::Xml
// Type: ::ParsingMode
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace System::Xml {
// Is value type: true
// CS Name: ::XmlTextReaderImpl::ParsingMode
struct CORDL_TYPE __XmlTextReaderImpl__ParsingMode {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____XmlTextReaderImpl__ParsingMode_Unwrapped
  enum struct ____XmlTextReaderImpl__ParsingMode_Unwrapped : int32_t {
    __E_Full = static_cast<int32_t>(0x0),
    __E_SkipNode = static_cast<int32_t>(0x1),
    __E_SkipContent = static_cast<int32_t>(0x2),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____XmlTextReaderImpl__ParsingMode_Unwrapped() const noexcept {
    return static_cast<____XmlTextReaderImpl__ParsingMode_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __XmlTextReaderImpl__ParsingMode();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __XmlTextReaderImpl__ParsingMode(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field Full value: static_cast<int32_t>(0x0)
  static ::System::Xml::__XmlTextReaderImpl__ParsingMode const Full;

  /// @brief Field SkipContent value: static_cast<int32_t>(0x2)
  static ::System::Xml::__XmlTextReaderImpl__ParsingMode const SkipContent;

  /// @brief Field SkipNode value: static_cast<int32_t>(0x1)
  static ::System::Xml::__XmlTextReaderImpl__ParsingMode const SkipNode;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::System::Xml::__XmlTextReaderImpl__ParsingMode, 0x4>, "Size mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingMode, value__) == 0x0, "Offset mismatch!");

} // namespace System::Xml
// Type: ::EntityType
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace System::Xml {
// Is value type: true
// CS Name: ::XmlTextReaderImpl::EntityType
struct CORDL_TYPE __XmlTextReaderImpl__EntityType {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____XmlTextReaderImpl__EntityType_Unwrapped
  enum struct ____XmlTextReaderImpl__EntityType_Unwrapped : int32_t {
    __E_CharacterDec = static_cast<int32_t>(0x0),
    __E_CharacterHex = static_cast<int32_t>(0x1),
    __E_CharacterNamed = static_cast<int32_t>(0x2),
    __E_Expanded = static_cast<int32_t>(0x3),
    __E_Skipped = static_cast<int32_t>(0x4),
    __E_FakeExpanded = static_cast<int32_t>(0x5),
    __E_Unexpanded = static_cast<int32_t>(0x6),
    __E_ExpandedInAttribute = static_cast<int32_t>(0x7),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____XmlTextReaderImpl__EntityType_Unwrapped() const noexcept {
    return static_cast<____XmlTextReaderImpl__EntityType_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __XmlTextReaderImpl__EntityType();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __XmlTextReaderImpl__EntityType(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field CharacterDec value: static_cast<int32_t>(0x0)
  static ::System::Xml::__XmlTextReaderImpl__EntityType const CharacterDec;

  /// @brief Field CharacterHex value: static_cast<int32_t>(0x1)
  static ::System::Xml::__XmlTextReaderImpl__EntityType const CharacterHex;

  /// @brief Field CharacterNamed value: static_cast<int32_t>(0x2)
  static ::System::Xml::__XmlTextReaderImpl__EntityType const CharacterNamed;

  /// @brief Field Expanded value: static_cast<int32_t>(0x3)
  static ::System::Xml::__XmlTextReaderImpl__EntityType const Expanded;

  /// @brief Field ExpandedInAttribute value: static_cast<int32_t>(0x7)
  static ::System::Xml::__XmlTextReaderImpl__EntityType const ExpandedInAttribute;

  /// @brief Field FakeExpanded value: static_cast<int32_t>(0x5)
  static ::System::Xml::__XmlTextReaderImpl__EntityType const FakeExpanded;

  /// @brief Field Skipped value: static_cast<int32_t>(0x4)
  static ::System::Xml::__XmlTextReaderImpl__EntityType const Skipped;

  /// @brief Field Unexpanded value: static_cast<int32_t>(0x6)
  static ::System::Xml::__XmlTextReaderImpl__EntityType const Unexpanded;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::System::Xml::__XmlTextReaderImpl__EntityType, 0x4>, "Size mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__EntityType, value__) == 0x0, "Offset mismatch!");

} // namespace System::Xml
// Type: ::EntityExpandType
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace System::Xml {
// Is value type: true
// CS Name: ::XmlTextReaderImpl::EntityExpandType
struct CORDL_TYPE __XmlTextReaderImpl__EntityExpandType {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____XmlTextReaderImpl__EntityExpandType_Unwrapped
  enum struct ____XmlTextReaderImpl__EntityExpandType_Unwrapped : int32_t {
    __E_All = static_cast<int32_t>(0x0),
    __E_OnlyGeneral = static_cast<int32_t>(0x1),
    __E_OnlyCharacter = static_cast<int32_t>(0x2),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____XmlTextReaderImpl__EntityExpandType_Unwrapped() const noexcept {
    return static_cast<____XmlTextReaderImpl__EntityExpandType_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __XmlTextReaderImpl__EntityExpandType();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __XmlTextReaderImpl__EntityExpandType(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field All value: static_cast<int32_t>(0x0)
  static ::System::Xml::__XmlTextReaderImpl__EntityExpandType const All;

  /// @brief Field OnlyCharacter value: static_cast<int32_t>(0x2)
  static ::System::Xml::__XmlTextReaderImpl__EntityExpandType const OnlyCharacter;

  /// @brief Field OnlyGeneral value: static_cast<int32_t>(0x1)
  static ::System::Xml::__XmlTextReaderImpl__EntityExpandType const OnlyGeneral;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::System::Xml::__XmlTextReaderImpl__EntityExpandType, 0x4>, "Size mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__EntityExpandType, value__) == 0x0, "Offset mismatch!");

} // namespace System::Xml
// Type: ::IncrementalReadState
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace System::Xml {
// Is value type: true
// CS Name: ::XmlTextReaderImpl::IncrementalReadState
struct CORDL_TYPE __XmlTextReaderImpl__IncrementalReadState {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____XmlTextReaderImpl__IncrementalReadState_Unwrapped
  enum struct ____XmlTextReaderImpl__IncrementalReadState_Unwrapped : int32_t {
    __E_Text = static_cast<int32_t>(0x0),
    __E_StartTag = static_cast<int32_t>(0x1),
    __E_PI = static_cast<int32_t>(0x2),
    __E_CDATA = static_cast<int32_t>(0x3),
    __E_Comment = static_cast<int32_t>(0x4),
    __E_Attributes = static_cast<int32_t>(0x5),
    __E_AttributeValue = static_cast<int32_t>(0x6),
    __E_ReadData = static_cast<int32_t>(0x7),
    __E_EndElement = static_cast<int32_t>(0x8),
    __E_End = static_cast<int32_t>(0x9),
    __E_ReadValueChunk_OnCachedValue = static_cast<int32_t>(0xa),
    __E_ReadValueChunk_OnPartialValue = static_cast<int32_t>(0xb),
    __E_ReadContentAsBinary_OnCachedValue = static_cast<int32_t>(0xc),
    __E_ReadContentAsBinary_OnPartialValue = static_cast<int32_t>(0xd),
    __E_ReadContentAsBinary_End = static_cast<int32_t>(0xe),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____XmlTextReaderImpl__IncrementalReadState_Unwrapped() const noexcept {
    return static_cast<____XmlTextReaderImpl__IncrementalReadState_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __XmlTextReaderImpl__IncrementalReadState();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __XmlTextReaderImpl__IncrementalReadState(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field AttributeValue value: static_cast<int32_t>(0x6)
  static ::System::Xml::__XmlTextReaderImpl__IncrementalReadState const AttributeValue;

  /// @brief Field Attributes value: static_cast<int32_t>(0x5)
  static ::System::Xml::__XmlTextReaderImpl__IncrementalReadState const Attributes;

  /// @brief Field CDATA value: static_cast<int32_t>(0x3)
  static ::System::Xml::__XmlTextReaderImpl__IncrementalReadState const CDATA;

  /// @brief Field Comment value: static_cast<int32_t>(0x4)
  static ::System::Xml::__XmlTextReaderImpl__IncrementalReadState const Comment;

  /// @brief Field End value: static_cast<int32_t>(0x9)
  static ::System::Xml::__XmlTextReaderImpl__IncrementalReadState const End;

  /// @brief Field EndElement value: static_cast<int32_t>(0x8)
  static ::System::Xml::__XmlTextReaderImpl__IncrementalReadState const EndElement;

  /// @brief Field PI value: static_cast<int32_t>(0x2)
  static ::System::Xml::__XmlTextReaderImpl__IncrementalReadState const PI;

  /// @brief Field ReadContentAsBinary_End value: static_cast<int32_t>(0xe)
  static ::System::Xml::__XmlTextReaderImpl__IncrementalReadState const ReadContentAsBinary_End;

  /// @brief Field ReadContentAsBinary_OnCachedValue value: static_cast<int32_t>(0xc)
  static ::System::Xml::__XmlTextReaderImpl__IncrementalReadState const ReadContentAsBinary_OnCachedValue;

  /// @brief Field ReadContentAsBinary_OnPartialValue value: static_cast<int32_t>(0xd)
  static ::System::Xml::__XmlTextReaderImpl__IncrementalReadState const ReadContentAsBinary_OnPartialValue;

  /// @brief Field ReadData value: static_cast<int32_t>(0x7)
  static ::System::Xml::__XmlTextReaderImpl__IncrementalReadState const ReadData;

  /// @brief Field ReadValueChunk_OnCachedValue value: static_cast<int32_t>(0xa)
  static ::System::Xml::__XmlTextReaderImpl__IncrementalReadState const ReadValueChunk_OnCachedValue;

  /// @brief Field ReadValueChunk_OnPartialValue value: static_cast<int32_t>(0xb)
  static ::System::Xml::__XmlTextReaderImpl__IncrementalReadState const ReadValueChunk_OnPartialValue;

  /// @brief Field StartTag value: static_cast<int32_t>(0x1)
  static ::System::Xml::__XmlTextReaderImpl__IncrementalReadState const StartTag;

  /// @brief Field Text value: static_cast<int32_t>(0x0)
  static ::System::Xml::__XmlTextReaderImpl__IncrementalReadState const Text;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::System::Xml::__XmlTextReaderImpl__IncrementalReadState, 0x4>, "Size mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__IncrementalReadState, value__) == 0x0, "Offset mismatch!");

} // namespace System::Xml
// Type: ::InitInputType
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace System::Xml {
// Is value type: true
// CS Name: ::XmlTextReaderImpl::InitInputType
struct CORDL_TYPE __XmlTextReaderImpl__InitInputType {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____XmlTextReaderImpl__InitInputType_Unwrapped
  enum struct ____XmlTextReaderImpl__InitInputType_Unwrapped : int32_t {
    __E_UriString = static_cast<int32_t>(0x0),
    __E_Stream = static_cast<int32_t>(0x1),
    __E_TextReader = static_cast<int32_t>(0x2),
    __E_Invalid = static_cast<int32_t>(0x3),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____XmlTextReaderImpl__InitInputType_Unwrapped() const noexcept {
    return static_cast<____XmlTextReaderImpl__InitInputType_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __XmlTextReaderImpl__InitInputType();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __XmlTextReaderImpl__InitInputType(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field Invalid value: static_cast<int32_t>(0x3)
  static ::System::Xml::__XmlTextReaderImpl__InitInputType const Invalid;

  /// @brief Field Stream value: static_cast<int32_t>(0x1)
  static ::System::Xml::__XmlTextReaderImpl__InitInputType const Stream;

  /// @brief Field TextReader value: static_cast<int32_t>(0x2)
  static ::System::Xml::__XmlTextReaderImpl__InitInputType const TextReader;

  /// @brief Field UriString value: static_cast<int32_t>(0x0)
  static ::System::Xml::__XmlTextReaderImpl__InitInputType const UriString;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::System::Xml::__XmlTextReaderImpl__InitInputType, 0x4>, "Size mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__InitInputType, value__) == 0x0, "Offset mismatch!");

} // namespace System::Xml
// Type: ::LaterInitParam
// SizeInfo { instance_size: 96, native_size: -1, calculated_instance_size: 96, calculated_native_size: 92, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace System::Xml {
// Is value type: false
// CS Name: ::XmlTextReaderImpl::LaterInitParam*
class CORDL_TYPE __XmlTextReaderImpl__LaterInitParam : public ::System::Object {
public:
  // Declarations
  /// @brief Field initType, offset 0x58, size 0x4
  __declspec(property(get = __cordl_internal_get_initType, put = __cordl_internal_set_initType))::System::Xml::__XmlTextReaderImpl__InitInputType initType;

  /// @brief Field inputByteCount, offset 0x28, size 0x4
  __declspec(property(get = __cordl_internal_get_inputByteCount, put = __cordl_internal_set_inputByteCount)) int32_t inputByteCount;

  /// @brief Field inputBytes, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_inputBytes, put = __cordl_internal_set_inputBytes))::ArrayW<uint8_t, ::Array<uint8_t>*> inputBytes;

  /// @brief Field inputContext, offset 0x48, size 0x8
  __declspec(property(get = __cordl_internal_get_inputContext, put = __cordl_internal_set_inputContext))::System::Xml::XmlParserContext* inputContext;

  /// @brief Field inputStream, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_inputStream, put = __cordl_internal_set_inputStream))::System::IO::Stream* inputStream;

  /// @brief Field inputTextReader, offset 0x50, size 0x8
  __declspec(property(get = __cordl_internal_get_inputTextReader, put = __cordl_internal_set_inputTextReader))::System::IO::TextReader* inputTextReader;

  /// @brief Field inputUriResolver, offset 0x40, size 0x8
  __declspec(property(get = __cordl_internal_get_inputUriResolver, put = __cordl_internal_set_inputUriResolver))::System::Xml::XmlResolver* inputUriResolver;

  /// @brief Field inputUriStr, offset 0x38, size 0x8
  __declspec(property(get = __cordl_internal_get_inputUriStr, put = __cordl_internal_set_inputUriStr))::StringW inputUriStr;

  /// @brief Field inputbaseUri, offset 0x30, size 0x8
  __declspec(property(get = __cordl_internal_get_inputbaseUri, put = __cordl_internal_set_inputbaseUri))::System::Uri* inputbaseUri;

  /// @brief Field useAsync, offset 0x10, size 0x1
  __declspec(property(get = __cordl_internal_get_useAsync, put = __cordl_internal_set_useAsync)) bool useAsync;

  constexpr ::System::Xml::__XmlTextReaderImpl__InitInputType const& __cordl_internal_get_initType() const;

  constexpr ::System::Xml::__XmlTextReaderImpl__InitInputType& __cordl_internal_get_initType();

  constexpr int32_t const& __cordl_internal_get_inputByteCount() const;

  constexpr int32_t& __cordl_internal_get_inputByteCount();

  constexpr ::ArrayW<uint8_t, ::Array<uint8_t>*> const& __cordl_internal_get_inputBytes() const;

  constexpr ::ArrayW<uint8_t, ::Array<uint8_t>*>& __cordl_internal_get_inputBytes();

  constexpr ::System::Xml::XmlParserContext*& __cordl_internal_get_inputContext();

  constexpr ::cordl_internals::to_const_pointer<::System::Xml::XmlParserContext*> const& __cordl_internal_get_inputContext() const;

  constexpr ::System::IO::Stream*& __cordl_internal_get_inputStream();

  constexpr ::cordl_internals::to_const_pointer<::System::IO::Stream*> const& __cordl_internal_get_inputStream() const;

  constexpr ::System::IO::TextReader*& __cordl_internal_get_inputTextReader();

  constexpr ::cordl_internals::to_const_pointer<::System::IO::TextReader*> const& __cordl_internal_get_inputTextReader() const;

  constexpr ::System::Xml::XmlResolver*& __cordl_internal_get_inputUriResolver();

  constexpr ::cordl_internals::to_const_pointer<::System::Xml::XmlResolver*> const& __cordl_internal_get_inputUriResolver() const;

  constexpr ::StringW const& __cordl_internal_get_inputUriStr() const;

  constexpr ::StringW& __cordl_internal_get_inputUriStr();

  constexpr ::System::Uri*& __cordl_internal_get_inputbaseUri();

  constexpr ::cordl_internals::to_const_pointer<::System::Uri*> const& __cordl_internal_get_inputbaseUri() const;

  constexpr bool const& __cordl_internal_get_useAsync() const;

  constexpr bool& __cordl_internal_get_useAsync();

  constexpr void __cordl_internal_set_initType(::System::Xml::__XmlTextReaderImpl__InitInputType value);

  constexpr void __cordl_internal_set_inputByteCount(int32_t value);

  constexpr void __cordl_internal_set_inputBytes(::ArrayW<uint8_t, ::Array<uint8_t>*> value);

  constexpr void __cordl_internal_set_inputContext(::System::Xml::XmlParserContext* value);

  constexpr void __cordl_internal_set_inputStream(::System::IO::Stream* value);

  constexpr void __cordl_internal_set_inputTextReader(::System::IO::TextReader* value);

  constexpr void __cordl_internal_set_inputUriResolver(::System::Xml::XmlResolver* value);

  constexpr void __cordl_internal_set_inputUriStr(::StringW value);

  constexpr void __cordl_internal_set_inputbaseUri(::System::Uri* value);

  constexpr void __cordl_internal_set_useAsync(bool value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __XmlTextReaderImpl__LaterInitParam();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__XmlTextReaderImpl__LaterInitParam", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __XmlTextReaderImpl__LaterInitParam(__XmlTextReaderImpl__LaterInitParam&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__XmlTextReaderImpl__LaterInitParam", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __XmlTextReaderImpl__LaterInitParam(__XmlTextReaderImpl__LaterInitParam const&) = delete;

  /// @brief Field useAsync, offset: 0x10, size: 0x1, def value: None
  bool ___useAsync;

  /// @brief Field inputStream, offset: 0x18, size: 0x8, def value: None
  ::System::IO::Stream* ___inputStream;

  /// @brief Field inputBytes, offset: 0x20, size: 0x8, def value: None
  ::ArrayW<uint8_t, ::Array<uint8_t>*> ___inputBytes;

  /// @brief Field inputByteCount, offset: 0x28, size: 0x4, def value: None
  int32_t ___inputByteCount;

  /// @brief Field inputbaseUri, offset: 0x30, size: 0x8, def value: None
  ::System::Uri* ___inputbaseUri;

  /// @brief Field inputUriStr, offset: 0x38, size: 0x8, def value: None
  ::StringW ___inputUriStr;

  /// @brief Field inputUriResolver, offset: 0x40, size: 0x8, def value: None
  ::System::Xml::XmlResolver* ___inputUriResolver;

  /// @brief Field inputContext, offset: 0x48, size: 0x8, def value: None
  ::System::Xml::XmlParserContext* ___inputContext;

  /// @brief Field inputTextReader, offset: 0x50, size: 0x8, def value: None
  ::System::IO::TextReader* ___inputTextReader;

  /// @brief Field initType, offset: 0x58, size: 0x4, def value: None
  ::System::Xml::__XmlTextReaderImpl__InitInputType ___initType;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::System::Xml::__XmlTextReaderImpl__LaterInitParam, 0x60>, "Size mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__LaterInitParam, ___useAsync) == 0x10, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__LaterInitParam, ___inputStream) == 0x18, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__LaterInitParam, ___inputBytes) == 0x20, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__LaterInitParam, ___inputByteCount) == 0x28, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__LaterInitParam, ___inputbaseUri) == 0x30, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__LaterInitParam, ___inputUriStr) == 0x38, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__LaterInitParam, ___inputUriResolver) == 0x40, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__LaterInitParam, ___inputContext) == 0x48, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__LaterInitParam, ___inputTextReader) == 0x50, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__LaterInitParam, ___initType) == 0x58, "Offset mismatch!");

} // namespace System::Xml
// Type: ::ParsingState
// SizeInfo { instance_size: 120, native_size: -1, calculated_instance_size: 120, calculated_native_size: 134, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace System::Xml {
// Is value type: true
// CS Name: ::XmlTextReaderImpl::ParsingState
struct CORDL_TYPE __XmlTextReaderImpl__ParsingState {
public:
  // Declarations
  __declspec(property(get = get_LineNo)) int32_t LineNo;

  __declspec(property(get = get_LinePos)) int32_t LinePos;

  /// @brief Method Clear, addr 0x295cccc, size 0x7c, virtual false, abstract: false, final false
  inline void Clear();

  /// @brief Method Close, addr 0x295cd48, size 0x38, virtual false, abstract: false, final false
  inline void Close(bool closeInput);

  /// @brief Method get_LineNo, addr 0x295cd80, size 0x8, virtual false, abstract: false, final false
  inline int32_t get_LineNo();

  /// @brief Method get_LinePos, addr 0x295cd88, size 0x10, virtual false, abstract: false, final false
  inline int32_t get_LinePos();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __XmlTextReaderImpl__ParsingState();

  // Ctor Parameters [CppParam { name: "chars", ty: "::ArrayW<char16_t,::Array<char16_t>*>", modifiers: "", def_value: None }, CppParam { name: "charPos", ty: "int32_t", modifiers: "", def_value: None
  // }, CppParam { name: "charsUsed", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "encoding", ty: "::System::Text::Encoding*", modifiers: "", def_value: None }, CppParam { name:
  // "appendMode", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "stream", ty: "::System::IO::Stream*", modifiers: "", def_value: None }, CppParam { name: "decoder", ty:
  // "::System::Text::Decoder*", modifiers: "", def_value: None }, CppParam { name: "bytes", ty: "::ArrayW<uint8_t,::Array<uint8_t>*>", modifiers: "", def_value: None }, CppParam { name: "bytePos",
  // ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "bytesUsed", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "textReader", ty: "::System::IO::TextReader*",
  // modifiers: "", def_value: None }, CppParam { name: "lineNo", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "lineStartPos", ty: "int32_t", modifiers: "", def_value: None },
  // CppParam { name: "baseUriStr", ty: "::StringW", modifiers: "", def_value: None }, CppParam { name: "baseUri", ty: "::System::Uri*", modifiers: "", def_value: None }, CppParam { name: "isEof", ty:
  // "bool", modifiers: "", def_value: None }, CppParam { name: "isStreamEof", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "entity", ty: "::System::Xml::IDtdEntityInfo*", modifiers:
  // "", def_value: None }, CppParam { name: "entityId", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "eolNormalized", ty: "bool", modifiers: "", def_value: None }, CppParam {
  // name: "entityResolvedManually", ty: "bool", modifiers: "", def_value: None }]
  constexpr __XmlTextReaderImpl__ParsingState(::ArrayW<char16_t, ::Array<char16_t>*> chars, int32_t charPos, int32_t charsUsed, ::System::Text::Encoding* encoding, bool appendMode,
                                              ::System::IO::Stream* stream, ::System::Text::Decoder* decoder, ::ArrayW<uint8_t, ::Array<uint8_t>*> bytes, int32_t bytePos, int32_t bytesUsed,
                                              ::System::IO::TextReader* textReader, int32_t lineNo, int32_t lineStartPos, ::StringW baseUriStr, ::System::Uri* baseUri, bool isEof, bool isStreamEof,
                                              ::System::Xml::IDtdEntityInfo* entity, int32_t entityId, bool eolNormalized, bool entityResolvedManually) noexcept;

  /// @brief Field chars, offset: 0x0, size: 0x8, def value: None
  ::ArrayW<char16_t, ::Array<char16_t>*> chars;

  /// @brief Field charPos, offset: 0x8, size: 0x4, def value: None
  int32_t charPos;

  /// @brief Field charsUsed, offset: 0xc, size: 0x4, def value: None
  int32_t charsUsed;

  /// @brief Field encoding, offset: 0x10, size: 0x8, def value: None
  ::System::Text::Encoding* encoding;

  /// @brief Field appendMode, offset: 0x18, size: 0x1, def value: None
  bool appendMode;

  /// @brief Field stream, offset: 0x20, size: 0x8, def value: None
  ::System::IO::Stream* stream;

  /// @brief Field decoder, offset: 0x28, size: 0x8, def value: None
  ::System::Text::Decoder* decoder;

  /// @brief Field bytes, offset: 0x30, size: 0x8, def value: None
  ::ArrayW<uint8_t, ::Array<uint8_t>*> bytes;

  /// @brief Field bytePos, offset: 0x38, size: 0x4, def value: None
  int32_t bytePos;

  /// @brief Field bytesUsed, offset: 0x3c, size: 0x4, def value: None
  int32_t bytesUsed;

  /// @brief Field textReader, offset: 0x40, size: 0x8, def value: None
  ::System::IO::TextReader* textReader;

  /// @brief Field lineNo, offset: 0x48, size: 0x4, def value: None
  int32_t lineNo;

  /// @brief Field lineStartPos, offset: 0x4c, size: 0x4, def value: None
  int32_t lineStartPos;

  /// @brief Field baseUriStr, offset: 0x50, size: 0x8, def value: None
  ::StringW baseUriStr;

  /// @brief Field baseUri, offset: 0x58, size: 0x8, def value: None
  ::System::Uri* baseUri;

  /// @brief Field isEof, offset: 0x60, size: 0x1, def value: None
  bool isEof;

  /// @brief Field isStreamEof, offset: 0x61, size: 0x1, def value: None
  bool isStreamEof;

  /// @brief Field entity, offset: 0x68, size: 0x8, def value: None
  ::System::Xml::IDtdEntityInfo* entity;

  /// @brief Field entityId, offset: 0x70, size: 0x4, def value: None
  int32_t entityId;

  /// @brief Field eolNormalized, offset: 0x74, size: 0x1, def value: None
  bool eolNormalized;

  /// @brief Field entityResolvedManually, offset: 0x75, size: 0x1, def value: None
  bool entityResolvedManually;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x78 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::System::Xml::__XmlTextReaderImpl__ParsingState, 0x78>, "Size mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, chars) == 0x0, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, charPos) == 0x8, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, charsUsed) == 0xc, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, encoding) == 0x10, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, appendMode) == 0x18, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, stream) == 0x20, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, decoder) == 0x28, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, bytes) == 0x30, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, bytePos) == 0x38, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, bytesUsed) == 0x3c, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, textReader) == 0x40, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, lineNo) == 0x48, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, lineStartPos) == 0x4c, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, baseUriStr) == 0x50, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, baseUri) == 0x58, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, isEof) == 0x60, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, isStreamEof) == 0x61, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, entity) == 0x68, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, entityId) == 0x70, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, eolNormalized) == 0x74, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__ParsingState, entityResolvedManually) == 0x75, "Offset mismatch!");

} // namespace System::Xml
// Type: ::XmlContext
// SizeInfo { instance_size: 48, native_size: -1, calculated_instance_size: 48, calculated_native_size: 48, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace System::Xml {
// Is value type: false
// CS Name: ::XmlTextReaderImpl::XmlContext*
class CORDL_TYPE __XmlTextReaderImpl__XmlContext : public ::System::Object {
public:
  // Declarations
  /// @brief Field defaultNamespace, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_defaultNamespace, put = __cordl_internal_set_defaultNamespace))::StringW defaultNamespace;

  /// @brief Field previousContext, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_previousContext, put = __cordl_internal_set_previousContext))::System::Xml::__XmlTextReaderImpl__XmlContext* previousContext;

  /// @brief Field xmlLang, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_xmlLang, put = __cordl_internal_set_xmlLang))::StringW xmlLang;

  /// @brief Field xmlSpace, offset 0x10, size 0x4
  __declspec(property(get = __cordl_internal_get_xmlSpace, put = __cordl_internal_set_xmlSpace))::System::Xml::XmlSpace xmlSpace;

  static inline ::System::Xml::__XmlTextReaderImpl__XmlContext* New_ctor();

  static inline ::System::Xml::__XmlTextReaderImpl__XmlContext* New_ctor(::System::Xml::__XmlTextReaderImpl__XmlContext* previousContext);

  constexpr ::StringW const& __cordl_internal_get_defaultNamespace() const;

  constexpr ::StringW& __cordl_internal_get_defaultNamespace();

  constexpr ::System::Xml::__XmlTextReaderImpl__XmlContext*& __cordl_internal_get_previousContext();

  constexpr ::cordl_internals::to_const_pointer<::System::Xml::__XmlTextReaderImpl__XmlContext*> const& __cordl_internal_get_previousContext() const;

  constexpr ::StringW const& __cordl_internal_get_xmlLang() const;

  constexpr ::StringW& __cordl_internal_get_xmlLang();

  constexpr ::System::Xml::XmlSpace const& __cordl_internal_get_xmlSpace() const;

  constexpr ::System::Xml::XmlSpace& __cordl_internal_get_xmlSpace();

  constexpr void __cordl_internal_set_defaultNamespace(::StringW value);

  constexpr void __cordl_internal_set_previousContext(::System::Xml::__XmlTextReaderImpl__XmlContext* value);

  constexpr void __cordl_internal_set_xmlLang(::StringW value);

  constexpr void __cordl_internal_set_xmlSpace(::System::Xml::XmlSpace value);

  /// @brief Method .ctor, addr 0x295cd98, size 0x64, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method .ctor, addr 0x295cdfc, size 0x40, virtual false, abstract: false, final false
  inline void _ctor(::System::Xml::__XmlTextReaderImpl__XmlContext* previousContext);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __XmlTextReaderImpl__XmlContext();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__XmlTextReaderImpl__XmlContext", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __XmlTextReaderImpl__XmlContext(__XmlTextReaderImpl__XmlContext&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__XmlTextReaderImpl__XmlContext", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __XmlTextReaderImpl__XmlContext(__XmlTextReaderImpl__XmlContext const&) = delete;

  /// @brief Field xmlSpace, offset: 0x10, size: 0x4, def value: None
  ::System::Xml::XmlSpace ___xmlSpace;

  /// @brief Field xmlLang, offset: 0x18, size: 0x8, def value: None
  ::StringW ___xmlLang;

  /// @brief Field defaultNamespace, offset: 0x20, size: 0x8, def value: None
  ::StringW ___defaultNamespace;

  /// @brief Field previousContext, offset: 0x28, size: 0x8, def value: None
  ::System::Xml::__XmlTextReaderImpl__XmlContext* ___previousContext;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::System::Xml::__XmlTextReaderImpl__XmlContext, 0x30>, "Size mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__XmlContext, ___xmlSpace) == 0x10, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__XmlContext, ___xmlLang) == 0x18, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__XmlContext, ___defaultNamespace) == 0x20, "Offset mismatch!");

static_assert(offsetof(::System::Xml::__XmlTextReaderImpl__XmlContext, ___previousContext) == 0x28, "Offset mismatch!");

} // namespace System::Xml
// Type: ::NoNamespaceManager
// SizeInfo { instance_size: 80, native_size: -1, calculated_instance_size: 80, calculated_native_size: 80, minimum_alignment: 8, natural_alignment: 0, packing: None, specified_packing: None }
namespace System::Xml {
// Is value type: false
// CS Name: ::XmlTextReaderImpl::NoNamespaceManager*
class CORDL_TYPE __XmlTextReaderImpl__NoNamespaceManager : public ::System::Xml::XmlNamespaceManager {
public:
  // Declarations
  __declspec(property(get = get_DefaultNamespace))::StringW DefaultNamespace;

  /// @brief Method AddNamespace, addr 0x295ce98, size 0x4, virtual true, abstract: false, final false
  inline void AddNamespace(::StringW prefix, ::StringW uri);

  /// @brief Method GetEnumerator, addr 0x295cea0, size 0x8, virtual true, abstract: false, final false
  inline ::System::Collections::IEnumerator* GetEnumerator();

  /// @brief Method LookupNamespace, addr 0x295cea8, size 0x48, virtual true, abstract: false, final false
  inline ::StringW LookupNamespace(::StringW prefix);

  /// @brief Method LookupPrefix, addr 0x295cef0, size 0x8, virtual true, abstract: false, final false
  inline ::StringW LookupPrefix(::StringW uri);

  static inline ::System::Xml::__XmlTextReaderImpl__NoNamespaceManager* New_ctor();

  /// @brief Method PopScope, addr 0x295ce90, size 0x8, virtual true, abstract: false, final false
  inline bool PopScope();

  /// @brief Method PushScope, addr 0x295ce8c, size 0x4, virtual true, abstract: false, final false
  inline void PushScope();

  /// @brief Method RemoveNamespace, addr 0x295ce9c, size 0x4, virtual true, abstract: false, final false
  inline void RemoveNamespace(::StringW prefix, ::StringW uri);

  /// @brief Method .ctor, addr 0x295ce3c, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_DefaultNamespace, addr 0x295ce44, size 0x48, virtual true, abstract: false, final false
  inline ::StringW get_DefaultNamespace();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __XmlTextReaderImpl__NoNamespaceManager();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__XmlTextReaderImpl__NoNamespaceManager", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __XmlTextReaderImpl__NoNamespaceManager(__XmlTextReaderImpl__NoNamespaceManager&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__XmlTextReaderImpl__NoNamespaceManager", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __XmlTextReaderImpl__NoNamespaceManager(__XmlTextReaderImpl__NoNamespaceManager const&) = delete;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::System::Xml::__XmlTextReaderImpl__NoNamespaceManager, 0x50>, "Size mismatch!");

} // namespace System::Xml
// Type: ::DtdParserProxy
// SizeInfo { instance_size: 24, native_size: -1, calculated_instance_size: 24, calculated_native_size: 24, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace System::Xml {
// Is value type: false
// CS Name: ::XmlTextReaderImpl::DtdParserProxy*
class CORDL_TYPE __XmlTextReaderImpl__DtdParserProxy : public ::System::Object {
public:
  // Declarations
  __declspec(property(get = System_Xml_IDtdParserAdapterV1_get_Namespaces)) bool System_Xml_IDtdParserAdapterV1_Namespaces;

  __declspec(property(get = System_Xml_IDtdParserAdapterV1_get_Normalization)) bool System_Xml_IDtdParserAdapterV1_Normalization;

  __declspec(property(get = System_Xml_IDtdParserAdapterV1_get_V1CompatibilityMode)) bool System_Xml_IDtdParserAdapterV1_V1CompatibilityMode;

  __declspec(property(get = System_Xml_IDtdParserAdapterWithValidation_get_DtdValidation)) bool System_Xml_IDtdParserAdapterWithValidation_DtdValidation;

  __declspec(property(
      get = System_Xml_IDtdParserAdapterWithValidation_get_ValidationEventHandling))::System::Xml::IValidationEventHandling* System_Xml_IDtdParserAdapterWithValidation_ValidationEventHandling;

  __declspec(property(get = System_Xml_IDtdParserAdapter_get_BaseUri))::System::Uri* System_Xml_IDtdParserAdapter_BaseUri;

  __declspec(property(get = System_Xml_IDtdParserAdapter_get_CurrentPosition, put = System_Xml_IDtdParserAdapter_set_CurrentPosition)) int32_t System_Xml_IDtdParserAdapter_CurrentPosition;

  __declspec(property(get = System_Xml_IDtdParserAdapter_get_EntityStackLength)) int32_t System_Xml_IDtdParserAdapter_EntityStackLength;

  __declspec(property(get = System_Xml_IDtdParserAdapter_get_IsEntityEolNormalized)) bool System_Xml_IDtdParserAdapter_IsEntityEolNormalized;

  __declspec(property(get = System_Xml_IDtdParserAdapter_get_IsEof)) bool System_Xml_IDtdParserAdapter_IsEof;

  __declspec(property(get = System_Xml_IDtdParserAdapter_get_LineNo)) int32_t System_Xml_IDtdParserAdapter_LineNo;

  __declspec(property(get = System_Xml_IDtdParserAdapter_get_LineStartPosition)) int32_t System_Xml_IDtdParserAdapter_LineStartPosition;

  __declspec(property(get = System_Xml_IDtdParserAdapter_get_NameTable))::System::Xml::XmlNameTable* System_Xml_IDtdParserAdapter_NameTable;

  __declspec(property(get = System_Xml_IDtdParserAdapter_get_NamespaceResolver))::System::Xml::IXmlNamespaceResolver* System_Xml_IDtdParserAdapter_NamespaceResolver;

  __declspec(property(get = System_Xml_IDtdParserAdapter_get_ParsingBuffer))::ArrayW<char16_t, ::Array<char16_t>*> System_Xml_IDtdParserAdapter_ParsingBuffer;

  __declspec(property(get = System_Xml_IDtdParserAdapter_get_ParsingBufferLength)) int32_t System_Xml_IDtdParserAdapter_ParsingBufferLength;

  /// @brief Field reader, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_reader, put = __cordl_internal_set_reader))::System::Xml::XmlTextReaderImpl* reader;

  /// @brief Convert operator to "::System::Xml::IDtdParserAdapter"
  constexpr operator ::System::Xml::IDtdParserAdapter*() noexcept;

  /// @brief Convert operator to "::System::Xml::IDtdParserAdapterV1"
  constexpr operator ::System::Xml::IDtdParserAdapterV1*() noexcept;

  /// @brief Convert operator to "::System::Xml::IDtdParserAdapterWithValidation"
  constexpr operator ::System::Xml::IDtdParserAdapterWithValidation*() noexcept;

  static inline ::System::Xml::__XmlTextReaderImpl__DtdParserProxy* New_ctor(::System::Xml::XmlTextReaderImpl* reader);

  /// @brief Method System.Xml.IDtdParserAdapterV1.get_Namespaces, addr 0x295d234, size 0x1c, virtual true, abstract: false, final true
  inline bool System_Xml_IDtdParserAdapterV1_get_Namespaces();

  /// @brief Method System.Xml.IDtdParserAdapterV1.get_Normalization, addr 0x295d218, size 0x1c, virtual true, abstract: false, final true
  inline bool System_Xml_IDtdParserAdapterV1_get_Normalization();

  /// @brief Method System.Xml.IDtdParserAdapterV1.get_V1CompatibilityMode, addr 0x295d250, size 0x1c, virtual true, abstract: false, final true
  inline bool System_Xml_IDtdParserAdapterV1_get_V1CompatibilityMode();

  /// @brief Method System.Xml.IDtdParserAdapterWithValidation.get_DtdValidation, addr 0x295d1e0, size 0x1c, virtual true, abstract: false, final true
  inline bool System_Xml_IDtdParserAdapterWithValidation_get_DtdValidation();

  /// @brief Method System.Xml.IDtdParserAdapterWithValidation.get_ValidationEventHandling, addr 0x295d1fc, size 0x1c, virtual true, abstract: false, final true
  inline ::System::Xml::IValidationEventHandling* System_Xml_IDtdParserAdapterWithValidation_get_ValidationEventHandling();

  /// @brief Method System.Xml.IDtdParserAdapter.OnNewLine, addr 0x295d038, size 0x1c, virtual true, abstract: false, final true
  inline void System_Xml_IDtdParserAdapter_OnNewLine(int32_t pos);

  /// @brief Method System.Xml.IDtdParserAdapter.OnPublicId, addr 0x295d1c4, size 0x1c, virtual true, abstract: false, final true
  inline void System_Xml_IDtdParserAdapter_OnPublicId(::StringW publicId, ::System::Xml::LineInfo keywordLineInfo, ::System::Xml::LineInfo publicLiteralLineInfo);

  /// @brief Method System.Xml.IDtdParserAdapter.OnSystemId, addr 0x295d1a8, size 0x1c, virtual true, abstract: false, final true
  inline void System_Xml_IDtdParserAdapter_OnSystemId(::StringW systemId, ::System::Xml::LineInfo keywordLineInfo, ::System::Xml::LineInfo systemLiteralLineInfo);

  /// @brief Method System.Xml.IDtdParserAdapter.ParseComment, addr 0x295d100, size 0x1c, virtual true, abstract: false, final true
  inline void System_Xml_IDtdParserAdapter_ParseComment(::System::Text::StringBuilder* sb);

  /// @brief Method System.Xml.IDtdParserAdapter.ParseNamedCharRef, addr 0x295d0c4, size 0x20, virtual true, abstract: false, final true
  inline int32_t System_Xml_IDtdParserAdapter_ParseNamedCharRef(bool expand, ::System::Text::StringBuilder* internalSubsetBuilder);

  /// @brief Method System.Xml.IDtdParserAdapter.ParseNumericCharRef, addr 0x295d0a8, size 0x1c, virtual true, abstract: false, final true
  inline int32_t System_Xml_IDtdParserAdapter_ParseNumericCharRef(::System::Text::StringBuilder* internalSubsetBuilder);

  /// @brief Method System.Xml.IDtdParserAdapter.ParsePI, addr 0x295d0e4, size 0x1c, virtual true, abstract: false, final true
  inline void System_Xml_IDtdParserAdapter_ParsePI(::System::Text::StringBuilder* sb);

  /// @brief Method System.Xml.IDtdParserAdapter.PopEntity, addr 0x295d138, size 0x1c, virtual true, abstract: false, final true
  inline bool System_Xml_IDtdParserAdapter_PopEntity(ByRef<::System::Xml::IDtdEntityInfo*> oldEntity, ByRef<int32_t> newEntityId);

  /// @brief Method System.Xml.IDtdParserAdapter.PushEntity, addr 0x295d11c, size 0x1c, virtual true, abstract: false, final true
  inline bool System_Xml_IDtdParserAdapter_PushEntity(::System::Xml::IDtdEntityInfo* entity, ByRef<int32_t> entityId);

  /// @brief Method System.Xml.IDtdParserAdapter.PushExternalSubset, addr 0x295d154, size 0x1c, virtual true, abstract: false, final true
  inline bool System_Xml_IDtdParserAdapter_PushExternalSubset(::StringW systemId, ::StringW publicId);

  /// @brief Method System.Xml.IDtdParserAdapter.PushInternalDtd, addr 0x295d170, size 0x1c, virtual true, abstract: false, final true
  inline void System_Xml_IDtdParserAdapter_PushInternalDtd(::StringW baseUri, ::StringW internalDtd);

  /// @brief Method System.Xml.IDtdParserAdapter.ReadData, addr 0x295d08c, size 0x1c, virtual true, abstract: false, final true
  inline int32_t System_Xml_IDtdParserAdapter_ReadData();

  /// @brief Method System.Xml.IDtdParserAdapter.Throw, addr 0x295d18c, size 0x1c, virtual true, abstract: false, final true
  inline void System_Xml_IDtdParserAdapter_Throw(::System::Exception* e);

  /// @brief Method System.Xml.IDtdParserAdapter.get_BaseUri, addr 0x295cf58, size 0x1c, virtual true, abstract: false, final true
  inline ::System::Uri* System_Xml_IDtdParserAdapter_get_BaseUri();

  /// @brief Method System.Xml.IDtdParserAdapter.get_CurrentPosition, addr 0x295cfc8, size 0x1c, virtual true, abstract: false, final true
  inline int32_t System_Xml_IDtdParserAdapter_get_CurrentPosition();

  /// @brief Method System.Xml.IDtdParserAdapter.get_EntityStackLength, addr 0x295d000, size 0x1c, virtual true, abstract: false, final true
  inline int32_t System_Xml_IDtdParserAdapter_get_EntityStackLength();

  /// @brief Method System.Xml.IDtdParserAdapter.get_IsEntityEolNormalized, addr 0x295d01c, size 0x1c, virtual true, abstract: false, final true
  inline bool System_Xml_IDtdParserAdapter_get_IsEntityEolNormalized();

