#pragma once
// IWYU pragma private; include "GlobalNamespace/ConnectedPlayerManager.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "GlobalNamespace/zzzz__DisconnectedReason_def.hpp"
#include "GlobalNamespace/zzzz__IConnectedPlayer_def.hpp"
#include "GlobalNamespace/zzzz__IPoolablePacket_def.hpp"
#include "GlobalNamespace/zzzz__MultiplayerAvatarsData_def.hpp"
#include "GlobalNamespace/zzzz__PlayerStateHash_def.hpp"
#include "LiteNetLib/Utils/zzzz__INetSerializable_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__AsyncVoidMethodBuilder_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__IAsyncStateMachine_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__TaskAwaiter_1_def.hpp"
#include "System/zzzz__IDisposable_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(ConnectedPlayerManager)
namespace BGNet::Core {
struct DeliveryMethod;
}
namespace BGNet::Core {
class ITaskUtility;
}
namespace BGNet::Core {
class ITimeProvider;
}
namespace GlobalNamespace {
class ByteArrayNetSerializable;
}
namespace GlobalNamespace {
class ConnectedPlayerManager_ConnectedPlayer;
}
namespace GlobalNamespace {
struct ConnectedPlayerManager_InternalMessageType;
}
namespace GlobalNamespace {
class ConnectedPlayerManager_KickPlayerPacket;
}
namespace GlobalNamespace {

namespace LiteNetLib::Utils {
class NetDataReader;
}
namespace LiteNetLib::Utils {
class NetDataWriter;
}
namespace System::Collections::Generic {
template <typename T> class HashSet_1;
}
namespace System::Collections::Generic {
template <typename T> class List_1;
}
namespace System::Runtime::CompilerServices {
class IAsyncStateMachine;
}
namespace System {
template <typename T> class Action_1;
}
namespace System {
class Action;
}
// Forward declare root types
namespace GlobalNamespace {
struct ConnectedPlayerManager_InternalMessageType;
}
namespace GlobalNamespace {
struct ConnectedPlayerManager_MessageType;
}
namespace GlobalNamespace {
class ConnectedPlayerManager;
}
namespace GlobalNamespace {
class ConnectedPlayerManager_ConnectedPlayer;
}
namespace GlobalNamespace {
class ConnectedPlayerManager_KickPlayerPacket;
}
namespace GlobalNamespace {
class ConnectedPlayerManager_PingPacket;
}
namespace GlobalNamespace {
class ConnectedPlayerManager_PlayerAvatarPacket;
}
namespace GlobalNamespace {
class ConnectedPlayerManager_PlayerConnectedPacket;
}
namespace GlobalNamespace {
class ConnectedPlayerManager_PlayerDisconnectedPacket;
}
namespace GlobalNamespace {
class ConnectedPlayerManager_PlayerIdentityPacket;
}
namespace GlobalNamespace {
class ConnectedPlayerManager_PlayerSortOrderPacket;
}
namespace GlobalNamespace {
class ConnectedPlayerManager_PlayerStatePacket;
}
namespace GlobalNamespace {
class ConnectedPlayerManager_PongPacket;
}
namespace GlobalNamespace {
class ConnectedPlayerManager_SyncTimePacket;
}
namespace GlobalNamespace {
struct ConnectedPlayerManager__InitializePlayerEncryption_d__132;
}
// Write type traits
MARK_VAL_T(::GlobalNamespace::ConnectedPlayerManager_InternalMessageType);
MARK_VAL_T(::GlobalNamespace::ConnectedPlayerManager_MessageType);
MARK_REF_PTR_T(::GlobalNamespace::ConnectedPlayerManager);
MARK_REF_PTR_T(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer);
MARK_REF_PTR_T(::GlobalNamespace::ConnectedPlayerManager_KickPlayerPacket);
MARK_REF_PTR_T(::GlobalNamespace::ConnectedPlayerManager_PingPacket);
MARK_REF_PTR_T(::GlobalNamespace::ConnectedPlayerManager_PlayerAvatarPacket);
MARK_REF_PTR_T(::GlobalNamespace::ConnectedPlayerManager_PlayerConnectedPacket);
MARK_REF_PTR_T(::GlobalNamespace::ConnectedPlayerManager_PlayerDisconnectedPacket);
MARK_REF_PTR_T(::GlobalNamespace::ConnectedPlayerManager_PlayerIdentityPacket);
MARK_REF_PTR_T(::GlobalNamespace::ConnectedPlayerManager_PlayerSortOrderPacket);
MARK_REF_PTR_T(::GlobalNamespace::ConnectedPlayerManager_PlayerStatePacket);
MARK_REF_PTR_T(::GlobalNamespace::ConnectedPlayerManager_PongPacket);
MARK_REF_PTR_T(::GlobalNamespace::ConnectedPlayerManager_SyncTimePacket);
MARK_VAL_T(::GlobalNamespace::ConnectedPlayerManager__InitializePlayerEncryption_d__132);
// Dependencies DisconnectedReason, IConnectedPlayer, MultiplayerAvatarsData, PlayerStateHash, System.Object
namespace GlobalNamespace {
// Is value type: false
// CS Name: ConnectedPlayerManager/ConnectedPlayer
class CORDL_TYPE ConnectedPlayerManager_ConnectedPlayer : public ::System::Object {
public:
  // Declarations
  /// @brief Field _connection, offset 0x30, size 0x8
  __declspec(property(get = __cordl_internal_get__connection, put = __cordl_internal_set__connection)) ::GlobalNamespace::IConnection* _connection;

  /// @brief Field _connectionId, offset 0x40, size 0x1
  __declspec(property(get = __cordl_internal_get__connectionId, put = __cordl_internal_set__connectionId)) uint8_t _connectionId;

  /// @brief Field _disconnectedReason, offset 0x4c, size 0x4
  __declspec(property(get = __cordl_internal_get__disconnectedReason, put = __cordl_internal_set__disconnectedReason)) ::GlobalNamespace::DisconnectedReason _disconnectedReason;

  /// @brief Field _encryptionState, offset 0x90, size 0x8
  __declspec(property(get = __cordl_internal_get__encryptionState, put = __cordl_internal_set__encryptionState)) ::GlobalNamespace::EncryptionUtility_IEncryptionState* _encryptionState;

  /// @brief Field _isConnected, offset 0x48, size 0x1
  __declspec(property(get = __cordl_internal_get__isConnected, put = __cordl_internal_set__isConnected)) bool _isConnected;

  /// @brief Field _isConnectionOwner, offset 0x21, size 0x1
  __declspec(property(get = __cordl_internal_get__isConnectionOwner, put = __cordl_internal_set__isConnectionOwner)) bool _isConnectionOwner;

  /// @brief Field _isKicked, offset 0x50, size 0x1
  __declspec(property(get = __cordl_internal_get__isKicked, put = __cordl_internal_set__isKicked)) bool _isKicked;

  /// @brief Field _isMe, offset 0x20, size 0x1
  __declspec(property(get = __cordl_internal_get__isMe, put = __cordl_internal_set__isMe)) bool _isMe;

  /// @brief Field _latency, offset 0x98, size 0x8
  __declspec(property(get = __cordl_internal_get__latency, put = __cordl_internal_set__latency)) ::GlobalNamespace::LongRollingAverage* _latency;

  /// @brief Field _manager, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get__manager, put = __cordl_internal_set__manager)) ::GlobalNamespace::ConnectedPlayerManager* _manager;

  /// @brief Field _parent, offset 0x38, size 0x8
  __declspec(property(get = __cordl_internal_get__parent, put = __cordl_internal_set__parent)) ::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer* _parent;

  /// @brief Field _playerAvatars, offset 0x68, size 0x18
  __declspec(property(get = __cordl_internal_get__playerAvatars, put = __cordl_internal_set__playerAvatars)) ::GlobalNamespace::MultiplayerAvatarsData _playerAvatars;

  /// @brief Field _playerState, offset 0x58, size 0x10
  __declspec(property(get = __cordl_internal_get__playerState, put = __cordl_internal_set__playerState)) ::GlobalNamespace::PlayerStateHash _playerState;

  /// @brief Field _publicEncryptionKey, offset 0x80, size 0x8
  __declspec(property(get = __cordl_internal_get__publicEncryptionKey, put = __cordl_internal_set__publicEncryptionKey)) ::ArrayW<uint8_t, ::Array<uint8_t>*> _publicEncryptionKey;

  /// @brief Field _random, offset 0x88, size 0x8
  __declspec(property(get = __cordl_internal_get__random, put = __cordl_internal_set__random)) ::ArrayW<uint8_t, ::Array<uint8_t>*> _random;

  /// @brief Field _remoteConnectionId, offset 0x41, size 0x1
  __declspec(property(get = __cordl_internal_get__remoteConnectionId, put = __cordl_internal_set__remoteConnectionId)) uint8_t _remoteConnectionId;

  /// @brief Field _sortIndex, offset 0x44, size 0x4
  __declspec(property(get = __cordl_internal_get__sortIndex, put = __cordl_internal_set__sortIndex)) int32_t _sortIndex;

  /// @brief Field _userId, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get__userId, put = __cordl_internal_set__userId)) ::StringW _userId;

  /// @brief Field _userName, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get__userName, put = __cordl_internal_set__userName)) ::StringW _userName;

  __declspec(property(get = get_connection)) ::GlobalNamespace::IConnection* connection;

  __declspec(property(get = get_connectionId)) uint8_t connectionId;

  __declspec(property(get = get_currentLatency)) int64_t currentLatency;

  __declspec(property(get = get_disconnectedReason)) ::GlobalNamespace::DisconnectedReason disconnectedReason;

  __declspec(property(get = get_encryptionState)) ::GlobalNamespace::EncryptionUtility_IEncryptionState* encryptionState;

  __declspec(property(get = get_hasValidLatency)) bool hasValidLatency;

  __declspec(property(get = get_isConnected)) bool isConnected;

  __declspec(property(get = get_isConnectionOwner)) bool isConnectionOwner;

  __declspec(property(get = get_isDirectConnection)) bool isDirectConnection;

  __declspec(property(get = get_isKicked)) bool isKicked;

  __declspec(property(get = get_isMe)) bool isMe;

  __declspec(property(get = get_multiplayerAvatarsData, put = set_multiplayerAvatarsData)) ::GlobalNamespace::MultiplayerAvatarsData multiplayerAvatarsData;

  __declspec(property(get = get_offsetSyncTime)) int64_t offsetSyncTime;

  __declspec(property(get = get_publicEncryptionKey)) ::ArrayW<uint8_t, ::Array<uint8_t>*> publicEncryptionKey;

  __declspec(property(get = get_random)) ::ArrayW<uint8_t, ::Array<uint8_t>*> random;

  __declspec(property(get = get_remoteConnectionId)) uint8_t remoteConnectionId;

  __declspec(property(get = get_sortIndex)) int32_t sortIndex;

  __declspec(property(get = get_userId)) ::StringW userId;

  __declspec(property(get = get_userName)) ::StringW userName;

  /// @brief Convert operator to "::GlobalNamespace::IConnectedPlayer"
  constexpr operator ::GlobalNamespace::IConnectedPlayer*() noexcept;

  /// @brief Method CreateDirectlyConnectedPlayer, addr 0x22bf3cc, size 0x1dc, virtual false, abstract: false, final false
  static inline ::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer* CreateDirectlyConnectedPlayer(::GlobalNamespace::ConnectedPlayerManager* manager, uint8_t connectionId,
                                                                                                         ::GlobalNamespace::IConnection* connection);

  /// @brief Method CreateLocalPlayer, addr 0x22bf2ac, size 0xb8, virtual false, abstract: false, final false
  static inline ::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer* CreateLocalPlayer(::GlobalNamespace::ConnectedPlayerManager* manager, ::StringW userId, ::StringW userName,
                                                                                             bool isConnectionOwner, ::ArrayW<uint8_t, ::Array<uint8_t>*> publicEncryptionKey,
                                                                                             ::ArrayW<uint8_t, ::Array<uint8_t>*> random);

  /// @brief Method CreateRemoteConnectedPlayer, addr 0x22c00a8, size 0xc4, virtual false, abstract: false, final false
  static inline ::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer* CreateRemoteConnectedPlayer(::GlobalNamespace::ConnectedPlayerManager* manager, uint8_t connectionId,
                                                                                                       ::GlobalNamespace::ConnectedPlayerManager_PlayerConnectedPacket* packet,
                                                                                                       ::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer* parent);

  /// @brief Method Disconnect, addr 0x22bafac, size 0x148, virtual false, abstract: false, final false
  inline void Disconnect(::GlobalNamespace::DisconnectedReason disconnectedReason);

  /// @brief Method GetPlayerAvatarPacket, addr 0x22bf0a8, size 0x80, virtual false, abstract: false, final false
  inline ::GlobalNamespace::ConnectedPlayerManager_PlayerAvatarPacket* GetPlayerAvatarPacket();

  /// @brief Method GetPlayerConnectedPacket, addr 0x22bb6d4, size 0x70, virtual false, abstract: false, final false
  inline ::GlobalNamespace::ConnectedPlayerManager_PlayerConnectedPacket* GetPlayerConnectedPacket();

  /// @brief Method GetPlayerIdentityPacket, addr 0x22bb990, size 0x90, virtual false, abstract: false, final false
  inline ::GlobalNamespace::ConnectedPlayerManager_PlayerIdentityPacket* GetPlayerIdentityPacket();

  /// @brief Method GetPlayerSortOrderPacket, addr 0x22bb928, size 0x68, virtual false, abstract: false, final false
  inline ::GlobalNamespace::ConnectedPlayerManager_PlayerSortOrderPacket* GetPlayerSortOrderPacket();

  /// @brief Method GetPlayerStatePacket, addr 0x22befb4, size 0x60, virtual false, abstract: false, final false
  inline ::GlobalNamespace::ConnectedPlayerManager_PlayerStatePacket* GetPlayerStatePacket();

  /// @brief Method HasState, addr 0x22c1398, size 0xc, virtual true, abstract: false, final true
  inline bool HasState(::StringW state);

  static inline ::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer* New_ctor(::GlobalNamespace::ConnectedPlayerManager* manager, uint8_t connectionId, uint8_t remoteConnectionId,
                                                                                    ::GlobalNamespace::IConnection* connection, ::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer* parent,
                                                                                    ::StringW userId, ::StringW userName, bool isConnectionOwner, bool isMe,
                                                                                    ::ArrayW<uint8_t, ::Array<uint8_t>*> publicEncryptionKey, ::ArrayW<uint8_t, ::Array<uint8_t>*> random);

  /// @brief Method SetEncryptionState, addr 0x22c1390, size 0x8, virtual false, abstract: false, final false
  inline void SetEncryptionState(::GlobalNamespace::EncryptionUtility_IEncryptionState* encryptionState);

  /// @brief Method SetKicked, addr 0x22beec8, size 0xc, virtual false, abstract: false, final false
  inline void SetKicked();

  /// @brief Method SetPlayerState, addr 0x22c13a4, size 0x8, virtual false, abstract: false, final false
  inline void SetPlayerState(::GlobalNamespace::PlayerStateHash playerState);

  /// @brief Method ToString, addr 0x22c13ac, size 0x17c, virtual true, abstract: false, final false
  inline ::StringW ToString();

  /// @brief Method UpdateAvatar, addr 0x22c05fc, size 0x24, virtual false, abstract: false, final false
  inline void UpdateAvatar(::GlobalNamespace::ConnectedPlayerManager_PlayerAvatarPacket* packet);

  /// @brief Method UpdateIdentity, addr 0x22c02f4, size 0x64, virtual false, abstract: false, final false
  inline void UpdateIdentity(::GlobalNamespace::ConnectedPlayerManager_PlayerIdentityPacket* packet);

  /// @brief Method UpdateLatency, addr 0x22c0fd8, size 0x1c, virtual false, abstract: false, final false
  inline void UpdateLatency(int64_t latency);

  /// @brief Method UpdateSortIndex, addr 0x22bf210, size 0x1c, virtual false, abstract: false, final false
  inline bool UpdateSortIndex(int32_t index);

  /// @brief Method UpdateState, addr 0x22c04bc, size 0x1c, virtual false, abstract: false, final false
  inline void UpdateState(::GlobalNamespace::ConnectedPlayerManager_PlayerStatePacket* packet);

  constexpr ::GlobalNamespace::IConnection* const& __cordl_internal_get__connection() const;

  constexpr ::GlobalNamespace::IConnection*& __cordl_internal_get__connection();

  constexpr uint8_t const& __cordl_internal_get__connectionId() const;

  constexpr uint8_t& __cordl_internal_get__connectionId();

  constexpr ::GlobalNamespace::DisconnectedReason const& __cordl_internal_get__disconnectedReason() const;

  constexpr ::GlobalNamespace::DisconnectedReason& __cordl_internal_get__disconnectedReason();

  constexpr ::GlobalNamespace::EncryptionUtility_IEncryptionState* const& __cordl_internal_get__encryptionState() const;

  constexpr ::GlobalNamespace::EncryptionUtility_IEncryptionState*& __cordl_internal_get__encryptionState();

  constexpr bool const& __cordl_internal_get__isConnected() const;

  constexpr bool& __cordl_internal_get__isConnected();

  constexpr bool const& __cordl_internal_get__isConnectionOwner() const;

  constexpr bool& __cordl_internal_get__isConnectionOwner();

  constexpr bool const& __cordl_internal_get__isKicked() const;

  constexpr bool& __cordl_internal_get__isKicked();

  constexpr bool const& __cordl_internal_get__isMe() const;

  constexpr bool& __cordl_internal_get__isMe();

  constexpr ::GlobalNamespace::LongRollingAverage* const& __cordl_internal_get__latency() const;

  constexpr ::GlobalNamespace::LongRollingAverage*& __cordl_internal_get__latency();

  constexpr ::GlobalNamespace::ConnectedPlayerManager* const& __cordl_internal_get__manager() const;

  constexpr ::GlobalNamespace::ConnectedPlayerManager*& __cordl_internal_get__manager();

  constexpr ::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer* const& __cordl_internal_get__parent() const;

  constexpr ::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer*& __cordl_internal_get__parent();

  constexpr ::GlobalNamespace::MultiplayerAvatarsData const& __cordl_internal_get__playerAvatars() const;

  constexpr ::GlobalNamespace::MultiplayerAvatarsData& __cordl_internal_get__playerAvatars();

  constexpr ::GlobalNamespace::PlayerStateHash const& __cordl_internal_get__playerState() const;

  constexpr ::GlobalNamespace::PlayerStateHash& __cordl_internal_get__playerState();

  constexpr ::ArrayW<uint8_t, ::Array<uint8_t>*> const& __cordl_internal_get__publicEncryptionKey() const;

  constexpr ::ArrayW<uint8_t, ::Array<uint8_t>*>& __cordl_internal_get__publicEncryptionKey();

  constexpr ::ArrayW<uint8_t, ::Array<uint8_t>*> const& __cordl_internal_get__random() const;

  constexpr ::ArrayW<uint8_t, ::Array<uint8_t>*>& __cordl_internal_get__random();

  constexpr uint8_t const& __cordl_internal_get__remoteConnectionId() const;

  constexpr uint8_t& __cordl_internal_get__remoteConnectionId();

  constexpr int32_t const& __cordl_internal_get__sortIndex() const;

  constexpr int32_t& __cordl_internal_get__sortIndex();

  constexpr ::StringW const& __cordl_internal_get__userId() const;

  constexpr ::StringW& __cordl_internal_get__userId();

  constexpr ::StringW const& __cordl_internal_get__userName() const;

  constexpr ::StringW& __cordl_internal_get__userName();

  constexpr void __cordl_internal_set__connection(::GlobalNamespace::IConnection* value);

  constexpr void __cordl_internal_set__connectionId(uint8_t value);

  constexpr void __cordl_internal_set__disconnectedReason(::GlobalNamespace::DisconnectedReason value);

  constexpr void __cordl_internal_set__encryptionState(::GlobalNamespace::EncryptionUtility_IEncryptionState* value);

  constexpr void __cordl_internal_set__isConnected(bool value);

  constexpr void __cordl_internal_set__isConnectionOwner(bool value);

  constexpr void __cordl_internal_set__isKicked(bool value);

  constexpr void __cordl_internal_set__isMe(bool value);

  constexpr void __cordl_internal_set__latency(::GlobalNamespace::LongRollingAverage* value);

  constexpr void __cordl_internal_set__manager(::GlobalNamespace::ConnectedPlayerManager* value);

  constexpr void __cordl_internal_set__parent(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer* value);

  constexpr void __cordl_internal_set__playerAvatars(::GlobalNamespace::MultiplayerAvatarsData value);

  constexpr void __cordl_internal_set__playerState(::GlobalNamespace::PlayerStateHash value);

  constexpr void __cordl_internal_set__publicEncryptionKey(::ArrayW<uint8_t, ::Array<uint8_t>*> value);

  constexpr void __cordl_internal_set__random(::ArrayW<uint8_t, ::Array<uint8_t>*> value);

  constexpr void __cordl_internal_set__remoteConnectionId(uint8_t value);

  constexpr void __cordl_internal_set__sortIndex(int32_t value);

  constexpr void __cordl_internal_set__userId(::StringW value);

  constexpr void __cordl_internal_set__userName(::StringW value);

  /// @brief Method .ctor, addr 0x22c1200, size 0xfc, virtual false, abstract: false, final false
  inline void _ctor(::GlobalNamespace::ConnectedPlayerManager* manager, uint8_t connectionId, uint8_t remoteConnectionId, ::GlobalNamespace::IConnection* connection,
                    ::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer* parent, ::StringW userId, ::StringW userName, bool isConnectionOwner, bool isMe,
                    ::ArrayW<uint8_t, ::Array<uint8_t>*> publicEncryptionKey, ::ArrayW<uint8_t, ::Array<uint8_t>*> random);

  /// @brief Method get_connection, addr 0x22c1080, size 0x8, virtual false, abstract: false, final false
  inline ::GlobalNamespace::IConnection* get_connection();

  /// @brief Method get_connectionId, addr 0x22c1088, size 0x8, virtual false, abstract: false, final false
  inline uint8_t get_connectionId();

  /// @brief Method get_currentLatency, addr 0x22c1108, size 0x6c, virtual true, abstract: false, final true
  inline int64_t get_currentLatency();

  /// @brief Method get_disconnectedReason, addr 0x22c10b0, size 0x8, virtual true, abstract: false, final true
  inline ::GlobalNamespace::DisconnectedReason get_disconnectedReason();

  /// @brief Method get_encryptionState, addr 0x22c11f8, size 0x8, virtual false, abstract: false, final false
  inline ::GlobalNamespace::EncryptionUtility_IEncryptionState* get_encryptionState();

  /// @brief Method get_hasValidLatency, addr 0x22c10d8, size 0x30, virtual true, abstract: false, final true
  inline bool get_hasValidLatency();

  /// @brief Method get_isConnected, addr 0x22c1098, size 0x8, virtual true, abstract: false, final true
  inline bool get_isConnected();

  /// @brief Method get_isConnectionOwner, addr 0x22c10a0, size 0x8, virtual true, abstract: false, final true
  inline bool get_isConnectionOwner();

  /// @brief Method get_isDirectConnection, addr 0x22bb838, size 0x10, virtual false, abstract: false, final false
  inline bool get_isDirectConnection();

  /// @brief Method get_isKicked, addr 0x22c10a8, size 0x8, virtual true, abstract: false, final true
  inline bool get_isKicked();

  /// @brief Method get_isMe, addr 0x22c10d0, size 0x8, virtual true, abstract: false, final true
  inline bool get_isMe();

  /// @brief Method get_multiplayerAvatarsData, addr 0x22c11c0, size 0x14, virtual true, abstract: false, final true
  inline ::GlobalNamespace::MultiplayerAvatarsData get_multiplayerAvatarsData();

  /// @brief Method get_offsetSyncTime, addr 0x22c1174, size 0x4c, virtual true, abstract: false, final true
  inline int64_t get_offsetSyncTime();

  /// @brief Method get_publicEncryptionKey, addr 0x22c11e8, size 0x8, virtual false, abstract: false, final false
  inline ::ArrayW<uint8_t, ::Array<uint8_t>*> get_publicEncryptionKey();

  /// @brief Method get_random, addr 0x22c11f0, size 0x8, virtual false, abstract: false, final false
  inline ::ArrayW<uint8_t, ::Array<uint8_t>*> get_random();

  /// @brief Method get_remoteConnectionId, addr 0x22c1090, size 0x8, virtual false, abstract: false, final false
  inline uint8_t get_remoteConnectionId();

  /// @brief Method get_sortIndex, addr 0x22c10b8, size 0x8, virtual true, abstract: false, final true
  inline int32_t get_sortIndex();

  /// @brief Method get_userId, addr 0x22c10c0, size 0x8, virtual true, abstract: false, final true
  inline ::StringW get_userId();

  /// @brief Method get_userName, addr 0x22c10c8, size 0x8, virtual true, abstract: false, final true
  inline ::StringW get_userName();

  /// @brief Convert to "::GlobalNamespace::IConnectedPlayer"
  constexpr ::GlobalNamespace::IConnectedPlayer* i___GlobalNamespace__IConnectedPlayer() noexcept;

  /// @brief Method set_multiplayerAvatarsData, addr 0x22c11d4, size 0x14, virtual false, abstract: false, final false
  inline void set_multiplayerAvatarsData(::GlobalNamespace::MultiplayerAvatarsData value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr ConnectedPlayerManager_ConnectedPlayer();

public:
  // Ctor Parameters [CppParam { name: "", ty: "ConnectedPlayerManager_ConnectedPlayer", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  ConnectedPlayerManager_ConnectedPlayer(ConnectedPlayerManager_ConnectedPlayer&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "ConnectedPlayerManager_ConnectedPlayer", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  ConnectedPlayerManager_ConnectedPlayer(ConnectedPlayerManager_ConnectedPlayer const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 14699 };

  /// @brief Field kFixedSyncTimeOffset offset 0xffffffff size 0x8
  static constexpr int64_t kFixedSyncTimeOffset{ static_cast<int64_t>(0x21) };

  /// @brief Field _userId, offset: 0x10, size: 0x8, def value: None
  ::StringW ____userId;

  /// @brief Field _userName, offset: 0x18, size: 0x8, def value: None
  ::StringW ____userName;

  /// @brief Field _isMe, offset: 0x20, size: 0x1, def value: None
  bool ____isMe;

  /// @brief Field _isConnectionOwner, offset: 0x21, size: 0x1, def value: None
  bool ____isConnectionOwner;

  /// @brief Field _manager, offset: 0x28, size: 0x8, def value: None
  ::GlobalNamespace::ConnectedPlayerManager* ____manager;

  /// @brief Field _connection, offset: 0x30, size: 0x8, def value: None
  ::GlobalNamespace::IConnection* ____connection;

  /// @brief Field _parent, offset: 0x38, size: 0x8, def value: None
  ::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer* ____parent;

  /// @brief Field _connectionId, offset: 0x40, size: 0x1, def value: None
  uint8_t ____connectionId;

  /// @brief Field _remoteConnectionId, offset: 0x41, size: 0x1, def value: None
  uint8_t ____remoteConnectionId;

  /// @brief Field _sortIndex, offset: 0x44, size: 0x4, def value: None
  int32_t ____sortIndex;

  /// @brief Field _isConnected, offset: 0x48, size: 0x1, def value: None
  bool ____isConnected;

  /// @brief Field _disconnectedReason, offset: 0x4c, size: 0x4, def value: None
  ::GlobalNamespace::DisconnectedReason ____disconnectedReason;

  /// @brief Field _isKicked, offset: 0x50, size: 0x1, def value: None
  bool ____isKicked;

  /// @brief Field _playerState, offset: 0x58, size: 0x10, def value: None
  ::GlobalNamespace::PlayerStateHash ____playerState;

  /// @brief Field _playerAvatars, offset: 0x68, size: 0x18, def value: None
  ::GlobalNamespace::MultiplayerAvatarsData ____playerAvatars;

  /// @brief Field _publicEncryptionKey, offset: 0x80, size: 0x8, def value: None
  ::ArrayW<uint8_t, ::Array<uint8_t>*> ____publicEncryptionKey;

  /// @brief Field _random, offset: 0x88, size: 0x8, def value: None
  ::ArrayW<uint8_t, ::Array<uint8_t>*> ____random;

  /// @brief Field _encryptionState, offset: 0x90, size: 0x8, def value: None
  ::GlobalNamespace::EncryptionUtility_IEncryptionState* ____encryptionState;

  /// @brief Field _latency, offset: 0x98, size: 0x8, def value: None
  ::GlobalNamespace::LongRollingAverage* ____latency;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____userId) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____userName) == 0x18, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____isMe) == 0x20, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____isConnectionOwner) == 0x21, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____manager) == 0x28, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____connection) == 0x30, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____parent) == 0x38, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____connectionId) == 0x40, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____remoteConnectionId) == 0x41, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____sortIndex) == 0x44, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____isConnected) == 0x48, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____disconnectedReason) == 0x4c, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____isKicked) == 0x50, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____playerState) == 0x58, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____playerAvatars) == 0x68, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____publicEncryptionKey) == 0x80, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____random) == 0x88, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____encryptionState) == 0x90, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, ____latency) == 0x98, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::ConnectedPlayerManager_ConnectedPlayer, 0xa0>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies
namespace GlobalNamespace {
// Is value type: true
// CS Name: ConnectedPlayerManager/InternalMessageType
struct CORDL_TYPE ConnectedPlayerManager_InternalMessageType {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = uint8_t;

  /// @brief Nested struct __ConnectedPlayerManager_InternalMessageType_Unwrapped
  enum struct __ConnectedPlayerManager_InternalMessageType_Unwrapped : uint8_t {
    __E_SyncTime = static_cast<uint8_t>(0x0u),
    __E_PlayerConnected = static_cast<uint8_t>(0x1u),
    __E_PlayerIdentity = static_cast<uint8_t>(0x2u),
    __E_PlayerLatencyUpdate = static_cast<uint8_t>(0x3u),
    __E_PlayerDisconnected = static_cast<uint8_t>(0x4u),
    __E_PlayerSortOrderUpdate = static_cast<uint8_t>(0x5u),
    __E_Party = static_cast<uint8_t>(0x6u),
    __E_MultiplayerSession = static_cast<uint8_t>(0x7u),
    __E_KickPlayer = static_cast<uint8_t>(0x8u),
    __E_PlayerStateUpdate = static_cast<uint8_t>(0x9u),
    __E_PlayerAvatarUpdate = static_cast<uint8_t>(0xau),
    __E_Ping = static_cast<uint8_t>(0xbu),
    __E_Pong = static_cast<uint8_t>(0xcu),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __ConnectedPlayerManager_InternalMessageType_Unwrapped() const noexcept {
    return static_cast<__ConnectedPlayerManager_InternalMessageType_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator uint8_t() const noexcept {
    return static_cast<uint8_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr ConnectedPlayerManager_InternalMessageType();

  // Ctor Parameters [CppParam { name: "value__", ty: "uint8_t", modifiers: "", def_value: None }]
  constexpr ConnectedPlayerManager_InternalMessageType(uint8_t value__) noexcept;

  /// @brief Field KickPlayer value: U8(8)
  static ::GlobalNamespace::ConnectedPlayerManager_InternalMessageType const KickPlayer;

  /// @brief Field MultiplayerSession value: U8(7)
  static ::GlobalNamespace::ConnectedPlayerManager_InternalMessageType const MultiplayerSession;

  /// @brief Field Party value: U8(6)
  static ::GlobalNamespace::ConnectedPlayerManager_InternalMessageType const Party;

  /// @brief Field Ping value: U8(11)
  static ::GlobalNamespace::ConnectedPlayerManager_InternalMessageType const Ping;

  /// @brief Field PlayerAvatarUpdate value: U8(10)
  static ::GlobalNamespace::ConnectedPlayerManager_InternalMessageType const PlayerAvatarUpdate;

  /// @brief Field PlayerConnected value: U8(1)
  static ::GlobalNamespace::ConnectedPlayerManager_InternalMessageType const PlayerConnected;

  /// @brief Field PlayerDisconnected value: U8(4)
  static ::GlobalNamespace::ConnectedPlayerManager_InternalMessageType const PlayerDisconnected;

  /// @brief Field PlayerIdentity value: U8(2)
  static ::GlobalNamespace::ConnectedPlayerManager_InternalMessageType const PlayerIdentity;

  /// @brief Field PlayerLatencyUpdate value: U8(3)
  static ::GlobalNamespace::ConnectedPlayerManager_InternalMessageType const PlayerLatencyUpdate;

  /// @brief Field PlayerSortOrderUpdate value: U8(5)
  static ::GlobalNamespace::ConnectedPlayerManager_InternalMessageType const PlayerSortOrderUpdate;

  /// @brief Field PlayerStateUpdate value: U8(9)
  static ::GlobalNamespace::ConnectedPlayerManager_InternalMessageType const PlayerStateUpdate;

  /// @brief Field Pong value: U8(12)
  static ::GlobalNamespace::ConnectedPlayerManager_InternalMessageType const Pong;

  /// @brief Field SyncTime value: U8(0)
  static ::GlobalNamespace::ConnectedPlayerManager_InternalMessageType const SyncTime;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 14700 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x1 };

  /// @brief Field value__, offset: 0x0, size: 0x1, def value: None
  uint8_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_InternalMessageType, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::ConnectedPlayerManager_InternalMessageType, 0x1>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies
namespace GlobalNamespace {
// Is value type: true
// CS Name: ConnectedPlayerManager/MessageType
struct CORDL_TYPE ConnectedPlayerManager_MessageType {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = uint8_t;

  /// @brief Nested struct __ConnectedPlayerManager_MessageType_Unwrapped
  enum struct __ConnectedPlayerManager_MessageType_Unwrapped : uint8_t {
    __E_Party = static_cast<uint8_t>(0x6u),
    __E_MultiplayerSession = static_cast<uint8_t>(0x7u),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __ConnectedPlayerManager_MessageType_Unwrapped() const noexcept {
    return static_cast<__ConnectedPlayerManager_MessageType_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator uint8_t() const noexcept {
    return static_cast<uint8_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr ConnectedPlayerManager_MessageType();

  // Ctor Parameters [CppParam { name: "value__", ty: "uint8_t", modifiers: "", def_value: None }]
  constexpr ConnectedPlayerManager_MessageType(uint8_t value__) noexcept;

  /// @brief Field MultiplayerSession value: U8(7)
  static ::GlobalNamespace::ConnectedPlayerManager_MessageType const MultiplayerSession;

  /// @brief Field Party value: U8(6)
  static ::GlobalNamespace::ConnectedPlayerManager_MessageType const Party;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 14701 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x1 };

  /// @brief Field value__, offset: 0x0, size: 0x1, def value: None
  uint8_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_MessageType, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::ConnectedPlayerManager_MessageType, 0x1>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies IPoolablePacket, LiteNetLib.Utils.INetSerializable, System.Object
namespace GlobalNamespace {
// Is value type: false
// CS Name: ConnectedPlayerManager/PlayerConnectedPacket
class CORDL_TYPE ConnectedPlayerManager_PlayerConnectedPacket : public ::System::Object {
public:
  // Declarations
  /// @brief Field isConnectionOwner, offset 0x28, size 0x1
  __declspec(property(get = __cordl_internal_get_isConnectionOwner, put = __cordl_internal_set_isConnectionOwner)) bool isConnectionOwner;

  /// @brief Field remoteConnectionId, offset 0x10, size 0x1
  __declspec(property(get = __cordl_internal_get_remoteConnectionId, put = __cordl_internal_set_remoteConnectionId)) uint8_t remoteConnectionId;

  /// @brief Field userId, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_userId, put = __cordl_internal_set_userId)) ::StringW userId;

  /// @brief Field userName, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_userName, put = __cordl_internal_set_userName)) ::StringW userName;

  /// @brief Convert operator to "::GlobalNamespace::IPoolablePacket"
  constexpr operator ::GlobalNamespace::IPoolablePacket*() noexcept;

  /// @brief Convert operator to "::LiteNetLib::Utils::INetSerializable"
  constexpr operator ::LiteNetLib::Utils::INetSerializable*() noexcept;

  /// @brief Method Deserialize, addr 0x22c1588, size 0x68, virtual true, abstract: false, final true
  inline void Deserialize(::LiteNetLib::Utils::NetDataReader* reader);

  /// @brief Method Init, addr 0x22c12fc, size 0x14, virtual false, abstract: false, final false
  inline ::GlobalNamespace::ConnectedPlayerManager_PlayerConnectedPacket* Init(uint8_t connectionId, ::StringW userId, ::StringW userName, bool isConnectionOwner);

  static inline ::GlobalNamespace::ConnectedPlayerManager_PlayerConnectedPacket* New_ctor();

  /// @brief Method Release, addr 0x22c016c, size 0x54, virtual true, abstract: false, final true
  inline void Release();

  /// @brief Method Serialize, addr 0x22c1528, size 0x60, virtual true, abstract: false, final true
  inline void Serialize(::LiteNetLib::Utils::NetDataWriter* writer);

  constexpr bool const& __cordl_internal_get_isConnectionOwner() const;

  constexpr bool& __cordl_internal_get_isConnectionOwner();

  constexpr uint8_t const& __cordl_internal_get_remoteConnectionId() const;

  constexpr uint8_t& __cordl_internal_get_remoteConnectionId();

  constexpr ::StringW const& __cordl_internal_get_userId() const;

  constexpr ::StringW& __cordl_internal_get_userId();

  constexpr ::StringW const& __cordl_internal_get_userName() const;

  constexpr ::StringW& __cordl_internal_get_userName();

  constexpr void __cordl_internal_set_isConnectionOwner(bool value);

  constexpr void __cordl_internal_set_remoteConnectionId(uint8_t value);

  constexpr void __cordl_internal_set_userId(::StringW value);

  constexpr void __cordl_internal_set_userName(::StringW value);

  /// @brief Method .ctor, addr 0x22c15f0, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_pool, addr 0x22bdee0, size 0x40, virtual false, abstract: false, final false
  static inline ::GlobalNamespace::PacketPool_1<::GlobalNamespace::ConnectedPlayerManager_PlayerConnectedPacket*>* get_pool();

  /// @brief Convert to "::GlobalNamespace::IPoolablePacket"
  constexpr ::GlobalNamespace::IPoolablePacket* i___GlobalNamespace__IPoolablePacket() noexcept;

  /// @brief Convert to "::LiteNetLib::Utils::INetSerializable"
  constexpr ::LiteNetLib::Utils::INetSerializable* i___LiteNetLib__Utils__INetSerializable() noexcept;

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr ConnectedPlayerManager_PlayerConnectedPacket();

public:
  // Ctor Parameters [CppParam { name: "", ty: "ConnectedPlayerManager_PlayerConnectedPacket", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  ConnectedPlayerManager_PlayerConnectedPacket(ConnectedPlayerManager_PlayerConnectedPacket&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "ConnectedPlayerManager_PlayerConnectedPacket", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  ConnectedPlayerManager_PlayerConnectedPacket(ConnectedPlayerManager_PlayerConnectedPacket const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 14702 };

  /// @brief Field remoteConnectionId, offset: 0x10, size: 0x1, def value: None
  uint8_t ___remoteConnectionId;

  /// @brief Field userId, offset: 0x18, size: 0x8, def value: None
  ::StringW ___userId;

  /// @brief Field userName, offset: 0x20, size: 0x8, def value: None
  ::StringW ___userName;

  /// @brief Field isConnectionOwner, offset: 0x28, size: 0x1, def value: None
  bool ___isConnectionOwner;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_PlayerConnectedPacket, ___remoteConnectionId) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_PlayerConnectedPacket, ___userId) == 0x18, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_PlayerConnectedPacket, ___userName) == 0x20, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_PlayerConnectedPacket, ___isConnectionOwner) == 0x28, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::ConnectedPlayerManager_PlayerConnectedPacket, 0x30>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies IPoolablePacket, LiteNetLib.Utils.INetSerializable, MultiplayerAvatarsData, PlayerStateHash, System.Object
namespace GlobalNamespace {
// Is value type: false
// CS Name: ConnectedPlayerManager/PlayerIdentityPacket
class CORDL_TYPE ConnectedPlayerManager_PlayerIdentityPacket : public ::System::Object {
public:
  // Declarations
  /// @brief Field playerAvatar, offset 0x20, size 0x18
  __declspec(property(get = __cordl_internal_get_playerAvatar, put = __cordl_internal_set_playerAvatar)) ::GlobalNamespace::MultiplayerAvatarsData playerAvatar;

  /// @brief Field playerState, offset 0x10, size 0x10
  __declspec(property(get = __cordl_internal_get_playerState, put = __cordl_internal_set_playerState)) ::GlobalNamespace::PlayerStateHash playerState;

  /// @brief Field publicEncryptionKey, offset 0x40, size 0x8
  __declspec(property(get = __cordl_internal_get_publicEncryptionKey, put = __cordl_internal_set_publicEncryptionKey)) ::GlobalNamespace::ByteArrayNetSerializable* publicEncryptionKey;

  /// @brief Field random, offset 0x38, size 0x8
  __declspec(property(get = __cordl_internal_get_random, put = __cordl_internal_set_random)) ::GlobalNamespace::ByteArrayNetSerializable* random;

  /// @brief Convert operator to "::GlobalNamespace::IPoolablePacket"
  constexpr operator ::GlobalNamespace::IPoolablePacket*() noexcept;

  /// @brief Convert operator to "::LiteNetLib::Utils::INetSerializable"
  constexpr operator ::LiteNetLib::Utils::INetSerializable*() noexcept;

  /// @brief Method Deserialize, addr 0x22c1650, size 0x80, virtual true, abstract: false, final true
  inline void Deserialize(::LiteNetLib::Utils::NetDataReader* reader);

  /// @brief Method Init, addr 0x22c1310, size 0x58, virtual false, abstract: false, final false
  inline ::GlobalNamespace::ConnectedPlayerManager_PlayerIdentityPacket* Init(::GlobalNamespace::PlayerStateHash states, ::GlobalNamespace::MultiplayerAvatarsData avatar,
                                                                              ::ArrayW<uint8_t, ::Array<uint8_t>*> random, ::ArrayW<uint8_t, ::Array<uint8_t>*> publicEncryptionKey);

  static inline ::GlobalNamespace::ConnectedPlayerManager_PlayerIdentityPacket* New_ctor();

  /// @brief Method Release, addr 0x22c16d0, size 0x6c, virtual true, abstract: false, final true
  inline void Release();

  /// @brief Method Serialize, addr 0x22c15f8, size 0x58, virtual true, abstract: false, final true
  inline void Serialize(::LiteNetLib::Utils::NetDataWriter* writer);

  constexpr ::GlobalNamespace::MultiplayerAvatarsData const& __cordl_internal_get_playerAvatar() const;

  constexpr ::GlobalNamespace::MultiplayerAvatarsData& __cordl_internal_get_playerAvatar();

  constexpr ::GlobalNamespace::PlayerStateHash const& __cordl_internal_get_playerState() const;

  constexpr ::GlobalNamespace::PlayerStateHash& __cordl_internal_get_playerState();

  constexpr ::GlobalNamespace::ByteArrayNetSerializable* const& __cordl_internal_get_publicEncryptionKey() const;

  constexpr ::GlobalNamespace::ByteArrayNetSerializable*& __cordl_internal_get_publicEncryptionKey();

  constexpr ::GlobalNamespace::ByteArrayNetSerializable* const& __cordl_internal_get_random() const;

  constexpr ::GlobalNamespace::ByteArrayNetSerializable*& __cordl_internal_get_random();

  constexpr void __cordl_internal_set_playerAvatar(::GlobalNamespace::MultiplayerAvatarsData value);

  constexpr void __cordl_internal_set_playerState(::GlobalNamespace::PlayerStateHash value);

  constexpr void __cordl_internal_set_publicEncryptionKey(::GlobalNamespace::ByteArrayNetSerializable* value);

  constexpr void __cordl_internal_set_random(::GlobalNamespace::ByteArrayNetSerializable* value);

  /// @brief Method .ctor, addr 0x22c173c, size 0xe0, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_pool, addr 0x22bdf20, size 0x40, virtual false, abstract: false, final false
  static inline ::GlobalNamespace::PacketPool_1<::GlobalNamespace::ConnectedPlayerManager_PlayerIdentityPacket*>* get_pool();

  /// @brief Convert to "::GlobalNamespace::IPoolablePacket"
  constexpr ::GlobalNamespace::IPoolablePacket* i___GlobalNamespace__IPoolablePacket() noexcept;

  /// @brief Convert to "::LiteNetLib::Utils::INetSerializable"
  constexpr ::LiteNetLib::Utils::INetSerializable* i___LiteNetLib__Utils__INetSerializable() noexcept;

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr ConnectedPlayerManager_PlayerIdentityPacket();

public:
  // Ctor Parameters [CppParam { name: "", ty: "ConnectedPlayerManager_PlayerIdentityPacket", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  ConnectedPlayerManager_PlayerIdentityPacket(ConnectedPlayerManager_PlayerIdentityPacket&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "ConnectedPlayerManager_PlayerIdentityPacket", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  ConnectedPlayerManager_PlayerIdentityPacket(ConnectedPlayerManager_PlayerIdentityPacket const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 14703 };

  /// @brief Field playerState, offset: 0x10, size: 0x10, def value: None
  ::GlobalNamespace::PlayerStateHash ___playerState;

  /// @brief Field playerAvatar, offset: 0x20, size: 0x18, def value: None
  ::GlobalNamespace::MultiplayerAvatarsData ___playerAvatar;

  /// @brief Field random, offset: 0x38, size: 0x8, def value: None
  ::GlobalNamespace::ByteArrayNetSerializable* ___random;

  /// @brief Field publicEncryptionKey, offset: 0x40, size: 0x8, def value: None
  ::GlobalNamespace::ByteArrayNetSerializable* ___publicEncryptionKey;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_PlayerIdentityPacket, ___playerState) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_PlayerIdentityPacket, ___playerAvatar) == 0x20, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_PlayerIdentityPacket, ___random) == 0x38, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_PlayerIdentityPacket, ___publicEncryptionKey) == 0x40, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::ConnectedPlayerManager_PlayerIdentityPacket, 0x48>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies IPoolablePacket, LiteNetLib.Utils.INetSerializable, MultiplayerAvatarsData, System.Object
namespace GlobalNamespace {
// Is value type: false
// CS Name: ConnectedPlayerManager/PlayerAvatarPacket
class CORDL_TYPE ConnectedPlayerManager_PlayerAvatarPacket : public ::System::Object {
public:
  // Declarations
  /// @brief Field playerAvatar, offset 0x10, size 0x18
  __declspec(property(get = __cordl_internal_get_playerAvatar, put = __cordl_internal_set_playerAvatar)) ::GlobalNamespace::MultiplayerAvatarsData playerAvatar;

  /// @brief Convert operator to "::GlobalNamespace::IPoolablePacket"
  constexpr operator ::GlobalNamespace::IPoolablePacket*() noexcept;

  /// @brief Convert operator to "::LiteNetLib::Utils::INetSerializable"
  constexpr operator ::LiteNetLib::Utils::INetSerializable*() noexcept;

  /// @brief Method Deserialize, addr 0x22c1828, size 0x40, virtual true, abstract: false, final true
  inline void Deserialize(::LiteNetLib::Utils::NetDataReader* reader);

  /// @brief Method Init, addr 0x22c1370, size 0x14, virtual false, abstract: false, final false
  inline ::GlobalNamespace::ConnectedPlayerManager_PlayerAvatarPacket* Init(::GlobalNamespace::MultiplayerAvatarsData avatar);

  static inline ::GlobalNamespace::ConnectedPlayerManager_PlayerAvatarPacket* New_ctor();

  /// @brief Method Release, addr 0x22c0620, size 0x54, virtual true, abstract: false, final true
  inline void Release();

  /// @brief Method Serialize, addr 0x22c181c, size 0xc, virtual true, abstract: false, final true
  inline void Serialize(::LiteNetLib::Utils::NetDataWriter* writer);

  constexpr ::GlobalNamespace::MultiplayerAvatarsData const& __cordl_internal_get_playerAvatar() const;

  constexpr ::GlobalNamespace::MultiplayerAvatarsData& __cordl_internal_get_playerAvatar();

  constexpr void __cordl_internal_set_playerAvatar(::GlobalNamespace::MultiplayerAvatarsData value);

  /// @brief Method .ctor, addr 0x22c1868, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_pool, addr 0x22be060, size 0x40, virtual false, abstract: false, final false
  static inline ::GlobalNamespace::PacketPool_1<::GlobalNamespace::ConnectedPlayerManager_PlayerAvatarPacket*>* get_pool();

  /// @brief Convert to "::GlobalNamespace::IPoolablePacket"
  constexpr ::GlobalNamespace::IPoolablePacket* i___GlobalNamespace__IPoolablePacket() noexcept;

  /// @brief Convert to "::LiteNetLib::Utils::INetSerializable"
  constexpr ::LiteNetLib::Utils::INetSerializable* i___LiteNetLib__Utils__INetSerializable() noexcept;

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr ConnectedPlayerManager_PlayerAvatarPacket();

public:
  // Ctor Parameters [CppParam { name: "", ty: "ConnectedPlayerManager_PlayerAvatarPacket", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  ConnectedPlayerManager_PlayerAvatarPacket(ConnectedPlayerManager_PlayerAvatarPacket&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "ConnectedPlayerManager_PlayerAvatarPacket", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  ConnectedPlayerManager_PlayerAvatarPacket(ConnectedPlayerManager_PlayerAvatarPacket const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 14704 };

  /// @brief Field playerAvatar, offset: 0x10, size: 0x18, def value: None
  ::GlobalNamespace::MultiplayerAvatarsData ___playerAvatar;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_PlayerAvatarPacket, ___playerAvatar) == 0x10, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::ConnectedPlayerManager_PlayerAvatarPacket, 0x28>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies IPoolablePacket, LiteNetLib.Utils.INetSerializable, PlayerStateHash, System.Object
namespace GlobalNamespace {
// Is value type: false
// CS Name: ConnectedPlayerManager/PlayerStatePacket
class CORDL_TYPE ConnectedPlayerManager_PlayerStatePacket : public ::System::Object {
public:
  // Declarations
  /// @brief Field playerState, offset 0x10, size 0x10
  __declspec(property(get = __cordl_internal_get_playerState, put = __cordl_internal_set_playerState)) ::GlobalNamespace::PlayerStateHash playerState;

  /// @brief Convert operator to "::GlobalNamespace::IPoolablePacket"
  constexpr operator ::GlobalNamespace::IPoolablePacket*() noexcept;

  /// @brief Convert operator to "::LiteNetLib::Utils::INetSerializable"
  constexpr operator ::LiteNetLib::Utils::INetSerializable*() noexcept;

  /// @brief Method Deserialize, addr 0x22c187c, size 0x20, virtual true, abstract: false, final true
  inline void Deserialize(::LiteNetLib::Utils::NetDataReader* reader);

  /// @brief Method Init, addr 0x22c1368, size 0x8, virtual false, abstract: false, final false
  inline ::GlobalNamespace::ConnectedPlayerManager_PlayerStatePacket* Init(::GlobalNamespace::PlayerStateHash states);

  static inline ::GlobalNamespace::ConnectedPlayerManager_PlayerStatePacket* New_ctor();

  /// @brief Method Release, addr 0x22c04d8, size 0x54, virtual true, abstract: false, final true
  inline void Release();

  /// @brief Method Serialize, addr 0x22c1870, size 0xc, virtual true, abstract: false, final true
  inline void Serialize(::LiteNetLib::Utils::NetDataWriter* writer);

  constexpr ::GlobalNamespace::PlayerStateHash const& __cordl_internal_get_playerState() const;

  constexpr ::GlobalNamespace::PlayerStateHash& __cordl_internal_get_playerState();

  constexpr void __cordl_internal_set_playerState(::GlobalNamespace::PlayerStateHash value);

  /// @brief Method .ctor, addr 0x22c189c, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_pool, addr 0x22be0a0, size 0x40, virtual false, abstract: false, final false
  static inline ::GlobalNamespace::PacketPool_1<::GlobalNamespace::ConnectedPlayerManager_PlayerStatePacket*>* get_pool();

  /// @brief Convert to "::GlobalNamespace::IPoolablePacket"
  constexpr ::GlobalNamespace::IPoolablePacket* i___GlobalNamespace__IPoolablePacket() noexcept;

  /// @brief Convert to "::LiteNetLib::Utils::INetSerializable"
  constexpr ::LiteNetLib::Utils::INetSerializable* i___LiteNetLib__Utils__INetSerializable() noexcept;

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr ConnectedPlayerManager_PlayerStatePacket();

public:
  // Ctor Parameters [CppParam { name: "", ty: "ConnectedPlayerManager_PlayerStatePacket", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  ConnectedPlayerManager_PlayerStatePacket(ConnectedPlayerManager_PlayerStatePacket&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "ConnectedPlayerManager_PlayerStatePacket", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  ConnectedPlayerManager_PlayerStatePacket(ConnectedPlayerManager_PlayerStatePacket const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 14705 };

  /// @brief Field playerState, offset: 0x10, size: 0x10, def value: None
  ::GlobalNamespace::PlayerStateHash ___playerState;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::ConnectedPlayerManager_PlayerStatePacket, ___playerState) == 0x10, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::ConnectedPlayerManager_PlayerStatePacket, 0x20>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies IPoolablePacket, LiteNetLib.Utils.INetSerializable, System.Object
namespace GlobalNamespace {
// Is value type: false
// CS Name: ConnectedPlayerManager/PlayerSortOrderPacket
class CORDL_TYPE ConnectedPlayerManager_PlayerSortOrderPacket : public ::System::Object {
public:
  // Declarations
  /// @brief Field sortIndex, offset 0x18, size 0x4
  __declspec(property(get = __cordl_internal_get_sortIndex, put = __cordl_internal_set_sortIndex)) int32_t sortIndex;

  /// @brief Field userId, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_userId, put = __cordl_internal_set_userId)) ::StringW userId;

  /// @brief Convert operator to "::GlobalNamespace::IPoolablePacket"
  constexpr operator ::GlobalNamespace::IPoolablePacket*() noexcept;

  /// @brief Convert operator to "::LiteNetLib::Utils::INetSerializable"
  constexpr operator ::LiteNetLib::Utils::INetSerializable*() noexcept;

  /// @brief Method Deserialize, addr 0x22c18e4, size 0x44, virtual true, abstract: false, final true
  inline void Deserialize(::LiteNetLib::Utils::NetDataReader* reader);

  /// @brief Method Init, addr 0x22c1384, size 0xc, virtual false, abstract: false, final false
  inline ::GlobalNamespace::ConnectedPlayerManager_PlayerSortOrderPacket* Init(::StringW userId, int32_t sortIndex);

  static inline ::GlobalNamespace::ConnectedPlayerManager_PlayerSortOrderPacket* New_ctor();

  /// @brief Method Release, addr 0x22c09d0, size 0x54, virtual true, abstract: false, final true
  inline void Release();

  /// @brief Method Serialize, addr 0x22c18a4, size 0x40, virtual true, abstract: false, final true
  inline void Serialize(::LiteNetLib::Utils::NetDataWriter* writer);

  constexpr int32_t const& __cordl_internal_get_sortIndex() const;

  constexpr int32_t& __cordl_internal_get_sortIndex();

  constexpr ::StringW const& __cordl_internal_get_userId() const;

  constexpr ::StringW& __cordl_internal_get_userId();

  constexpr void __cordl_internal_set_sortIndex(int32_t value);

  constexpr void __cordl_internal_set_userId(::StringW value);

  /// @brief Method .ctor, addr 0x22c1928, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_pool, addr 0x22bdfa0, size 0x40, virtual false, abstract: false, final false
  static inline ::GlobalNamespace::PacketPool_1<::GlobalNamespace::ConnectedPlayerManager_PlayerSortOrderPacket*>* get_pool();

  /// @brief Convert to "::GlobalNamespace::IPoolablePacket"
  constexpr ::GlobalNamespace::IPoolablePacket* i___GlobalNamespace__IPoolablePacket() noexcept;

  /// @brief Convert to "::LiteNetLib::Utils::INetSerializable"
  constexpr ::LiteNetLib::Utils::INetSerializable* i___LiteNetLib__Utils__INetSerializable() noexcept;

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr ConnectedPlayerManager_PlayerSortOrderPacket();

public:
  // Ctor Parameters [CppParam { name: "", ty: "ConnectedPlayerManager_PlayerSortOrderPacket", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  ConnectedPlayerManager_PlayerSortOrderPacket(ConnectedPlayerManager_PlayerSortOrderPacket&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "ConnectedPlayerManager_PlayerSortOrderPacket", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  ConnectedPlayerManager_PlayerSortOrderPacket(ConnectedPlayerManager_PlayerSortOrderPacket const&) = delete;

