#pragma once
// IWYU pragma private; include "GlobalNamespace/PlayerSaveData.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "GlobalNamespace/zzzz__BeatmapDifficulty_def.hpp"
#include "GlobalNamespace/zzzz__RankModel_def.hpp"
#include "GlobalNamespace/zzzz__VersionSaveData_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "UnityEngine/zzzz__Color_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cmath>
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(PlayerSaveData)
namespace GlobalNamespace {
struct GameplayModifiers_PlayerSaveData_EnabledObstacleType;
}
namespace GlobalNamespace {
struct GameplayModifiers_PlayerSaveData_EnergyType;
}
namespace GlobalNamespace {
struct GameplayModifiers_PlayerSaveData_SongSpeed;
}
namespace GlobalNamespace {
struct PlayerSaveData_ColorOverrideType;
}
namespace GlobalNamespace {
class PlayerSaveData_ColorScheme;
}
namespace GlobalNamespace {
class PlayerSaveData_ColorSchemesSettings;
}
namespace GlobalNamespace {
class PlayerSaveData_GameplayModifiers;
}
namespace GlobalNamespace {
class PlayerSaveData_GuestPlayer;
}
namespace GlobalNamespace {
class PlayerSaveData_LocalPlayer;
}
namespace GlobalNamespace {
class PlayerSaveData_MultiplayerModeSettings;
}
namespace GlobalNamespace {
class PlayerSaveData_OverrideEnvironmentSettings;
}
namespace GlobalNamespace {
class PlayerSaveData_PlayerAgreementsData;
}

namespace GlobalNamespace {
class PlayerSaveData;
}
namespace GlobalNamespace {
class PlayerSaveData_ColorScheme;
}
namespace GlobalNamespace {
class PlayerSaveData_ColorSchemesSettings;
}
namespace GlobalNamespace {
class PlayerSaveData_GameplayModifiers;
}
namespace GlobalNamespace {
class PlayerSaveData_GuestPlayer;
}
namespace GlobalNamespace {
class PlayerSaveData_LocalPlayer;
}
namespace GlobalNamespace {
class PlayerSaveData_MultiplayerModeSettings;
}
namespace GlobalNamespace {
class PlayerSaveData_OverrideEnvironmentSettings;
}
namespace GlobalNamespace {
class PlayerSaveData_PlayerAgreementsData;
}
namespace GlobalNamespace {
class PlayerSaveData_PlayerAllOverallStatsData;
}
namespace GlobalNamespace {
class PlayerSaveData_PlayerLevelStatsData;
}
namespace GlobalNamespace {
class PlayerSaveData_PlayerMissionStatsData;
}
namespace GlobalNamespace {
class PlayerSaveData_PlayerOverallStatsData;
}
namespace GlobalNamespace {
class PlayerSaveData_PlayerSpecificSettings;
}
namespace GlobalNamespace {
class PlayerSaveData_PracticeSettings;
}
// Write type traits
MARK_VAL_T(::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnabledObstacleType);
MARK_VAL_T(::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnergyType);
MARK_VAL_T(::GlobalNamespace::GameplayModifiers_PlayerSaveData_SongSpeed);
MARK_VAL_T(::GlobalNamespace::PlayerSaveData_ColorOverrideType);
MARK_VAL_T(::GlobalNamespace::PlayerSaveData_PlayerSensitivityFlagSaveData);
MARK_VAL_T(::GlobalNamespace::PlayerSaveData_UserAgeCategorySaveData);
MARK_VAL_T(::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData);
MARK_VAL_T(::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData);
MARK_VAL_T(::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData);
MARK_REF_PTR_T(::GlobalNamespace::PlayerSaveData);
MARK_REF_PTR_T(::GlobalNamespace::PlayerSaveData_ColorScheme);
MARK_REF_PTR_T(::GlobalNamespace::PlayerSaveData_ColorSchemesSettings);
MARK_REF_PTR_T(::GlobalNamespace::PlayerSaveData_GameplayModifiers);
MARK_REF_PTR_T(::GlobalNamespace::PlayerSaveData_GuestPlayer);
MARK_REF_PTR_T(::GlobalNamespace::PlayerSaveData_LocalPlayer);
MARK_REF_PTR_T(::GlobalNamespace::PlayerSaveData_MultiplayerModeSettings);
MARK_REF_PTR_T(::GlobalNamespace::PlayerSaveData_OverrideEnvironmentSettings);
MARK_REF_PTR_T(::GlobalNamespace::PlayerSaveData_PlayerAgreementsData);
MARK_REF_PTR_T(::GlobalNamespace::PlayerSaveData_PlayerAllOverallStatsData);
MARK_REF_PTR_T(::GlobalNamespace::PlayerSaveData_PlayerLevelStatsData);
MARK_REF_PTR_T(::GlobalNamespace::PlayerSaveData_PlayerMissionStatsData);
MARK_REF_PTR_T(::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData);
MARK_REF_PTR_T(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings);
MARK_REF_PTR_T(::GlobalNamespace::PlayerSaveData_PracticeSettings);
// Dependencies
namespace GlobalNamespace {
// Is value type: true
// CS Name: PlayerSaveData/GameplayModifiers/EnabledObstacleType
struct CORDL_TYPE GameplayModifiers_PlayerSaveData_EnabledObstacleType {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct __GameplayModifiers_PlayerSaveData_EnabledObstacleType_Unwrapped
  enum struct __GameplayModifiers_PlayerSaveData_EnabledObstacleType_Unwrapped : int32_t {
    __E_All = static_cast<int32_t>(0x0),
    __E_FullHeightOnly = static_cast<int32_t>(0x1),
    __E_None = static_cast<int32_t>(0x2),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __GameplayModifiers_PlayerSaveData_EnabledObstacleType_Unwrapped() const noexcept {
    return static_cast<__GameplayModifiers_PlayerSaveData_EnabledObstacleType_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr GameplayModifiers_PlayerSaveData_EnabledObstacleType();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr GameplayModifiers_PlayerSaveData_EnabledObstacleType(int32_t value__) noexcept;

  /// @brief Field All value: I32(0)
  static ::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnabledObstacleType const All;

  /// @brief Field FullHeightOnly value: I32(1)
  static ::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnabledObstacleType const FullHeightOnly;

  /// @brief Field None value: I32(2)
  static ::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnabledObstacleType const None;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 13283 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnabledObstacleType, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnabledObstacleType, 0x4>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies
namespace GlobalNamespace {
// Is value type: true
// CS Name: PlayerSaveData/GameplayModifiers/EnergyType
struct CORDL_TYPE GameplayModifiers_PlayerSaveData_EnergyType {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct __GameplayModifiers_PlayerSaveData_EnergyType_Unwrapped
  enum struct __GameplayModifiers_PlayerSaveData_EnergyType_Unwrapped : int32_t {
    __E_Bar = static_cast<int32_t>(0x0),
    __E_Battery = static_cast<int32_t>(0x1),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __GameplayModifiers_PlayerSaveData_EnergyType_Unwrapped() const noexcept {
    return static_cast<__GameplayModifiers_PlayerSaveData_EnergyType_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr GameplayModifiers_PlayerSaveData_EnergyType();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr GameplayModifiers_PlayerSaveData_EnergyType(int32_t value__) noexcept;

  /// @brief Field Bar value: I32(0)
  static ::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnergyType const Bar;

  /// @brief Field Battery value: I32(1)
  static ::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnergyType const Battery;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 13284 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnergyType, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnergyType, 0x4>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies
namespace GlobalNamespace {
// Is value type: true
// CS Name: PlayerSaveData/GameplayModifiers/SongSpeed
struct CORDL_TYPE GameplayModifiers_PlayerSaveData_SongSpeed {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct __GameplayModifiers_PlayerSaveData_SongSpeed_Unwrapped
  enum struct __GameplayModifiers_PlayerSaveData_SongSpeed_Unwrapped : int32_t {
    __E_Normal = static_cast<int32_t>(0x0),
    __E_Faster = static_cast<int32_t>(0x1),
    __E_Slower = static_cast<int32_t>(0x2),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __GameplayModifiers_PlayerSaveData_SongSpeed_Unwrapped() const noexcept {
    return static_cast<__GameplayModifiers_PlayerSaveData_SongSpeed_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr GameplayModifiers_PlayerSaveData_SongSpeed();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr GameplayModifiers_PlayerSaveData_SongSpeed(int32_t value__) noexcept;

  /// @brief Field Faster value: I32(1)
  static ::GlobalNamespace::GameplayModifiers_PlayerSaveData_SongSpeed const Faster;

  /// @brief Field Normal value: I32(0)
  static ::GlobalNamespace::GameplayModifiers_PlayerSaveData_SongSpeed const Normal;

  /// @brief Field Slower value: I32(2)
  static ::GlobalNamespace::GameplayModifiers_PlayerSaveData_SongSpeed const Slower;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 13285 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::GameplayModifiers_PlayerSaveData_SongSpeed, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::GameplayModifiers_PlayerSaveData_SongSpeed, 0x4>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies PlayerSaveData::GameplayModifiers::EnabledObstacleType, PlayerSaveData::GameplayModifiers::EnergyType, PlayerSaveData::GameplayModifiers::SongSpeed, System.Object
namespace GlobalNamespace {
// Is value type: false
// CS Name: PlayerSaveData/GameplayModifiers
class CORDL_TYPE PlayerSaveData_GameplayModifiers : public ::System::Object {
public:
  // Declarations
  using EnabledObstacleType = ::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnabledObstacleType;

  using EnergyType = ::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnergyType;

  using SongSpeed = ::GlobalNamespace::GameplayModifiers_PlayerSaveData_SongSpeed;

  /// @brief Field disappearingArrows, offset 0x1e, size 0x1
  __declspec(property(get = __cordl_internal_get_disappearingArrows, put = __cordl_internal_set_disappearingArrows)) bool disappearingArrows;

  /// @brief Field enabledObstacleType, offset 0x18, size 0x4
  __declspec(property(get = __cordl_internal_get_enabledObstacleType,
                      put = __cordl_internal_set_enabledObstacleType)) ::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnabledObstacleType enabledObstacleType;

  /// @brief Field energyType, offset 0x10, size 0x4
  __declspec(property(get = __cordl_internal_get_energyType, put = __cordl_internal_set_energyType)) ::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnergyType energyType;

  /// @brief Field failOnSaberClash, offset 0x16, size 0x1
  __declspec(property(get = __cordl_internal_get_failOnSaberClash, put = __cordl_internal_set_failOnSaberClash)) bool failOnSaberClash;

  /// @brief Field fastNotes, offset 0x1c, size 0x1
  __declspec(property(get = __cordl_internal_get_fastNotes, put = __cordl_internal_set_fastNotes)) bool fastNotes;

  /// @brief Field ghostNotes, offset 0x1f, size 0x1
  __declspec(property(get = __cordl_internal_get_ghostNotes, put = __cordl_internal_set_ghostNotes)) bool ghostNotes;

  /// @brief Field instaFail, offset 0x15, size 0x1
  __declspec(property(get = __cordl_internal_get_instaFail, put = __cordl_internal_set_instaFail)) bool instaFail;

  /// @brief Field noArrows, offset 0x28, size 0x1
  __declspec(property(get = __cordl_internal_get_noArrows, put = __cordl_internal_set_noArrows)) bool noArrows;

  /// @brief Field noBombs, offset 0x20, size 0x1
  __declspec(property(get = __cordl_internal_get_noBombs, put = __cordl_internal_set_noBombs)) bool noBombs;

  /// @brief Field noFailOn0Energy, offset 0x14, size 0x1
  __declspec(property(get = __cordl_internal_get_noFailOn0Energy, put = __cordl_internal_set_noFailOn0Energy)) bool noFailOn0Energy;

  /// @brief Field proMode, offset 0x29, size 0x1
  __declspec(property(get = __cordl_internal_get_proMode, put = __cordl_internal_set_proMode)) bool proMode;

  /// @brief Field smallCubes, offset 0x2b, size 0x1
  __declspec(property(get = __cordl_internal_get_smallCubes, put = __cordl_internal_set_smallCubes)) bool smallCubes;

  /// @brief Field songSpeed, offset 0x24, size 0x4
  __declspec(property(get = __cordl_internal_get_songSpeed, put = __cordl_internal_set_songSpeed)) ::GlobalNamespace::GameplayModifiers_PlayerSaveData_SongSpeed songSpeed;

  /// @brief Field strictAngles, offset 0x1d, size 0x1
  __declspec(property(get = __cordl_internal_get_strictAngles, put = __cordl_internal_set_strictAngles)) bool strictAngles;

  /// @brief Field zenMode, offset 0x2a, size 0x1
  __declspec(property(get = __cordl_internal_get_zenMode, put = __cordl_internal_set_zenMode)) bool zenMode;

  static inline ::GlobalNamespace::PlayerSaveData_GameplayModifiers* New_ctor();

  constexpr bool const& __cordl_internal_get_disappearingArrows() const;

  constexpr bool& __cordl_internal_get_disappearingArrows();

  constexpr ::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnabledObstacleType const& __cordl_internal_get_enabledObstacleType() const;

  constexpr ::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnabledObstacleType& __cordl_internal_get_enabledObstacleType();

  constexpr ::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnergyType const& __cordl_internal_get_energyType() const;

  constexpr ::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnergyType& __cordl_internal_get_energyType();

  constexpr bool const& __cordl_internal_get_failOnSaberClash() const;

  constexpr bool& __cordl_internal_get_failOnSaberClash();

  constexpr bool const& __cordl_internal_get_fastNotes() const;

  constexpr bool& __cordl_internal_get_fastNotes();

  constexpr bool const& __cordl_internal_get_ghostNotes() const;

  constexpr bool& __cordl_internal_get_ghostNotes();

  constexpr bool const& __cordl_internal_get_instaFail() const;

  constexpr bool& __cordl_internal_get_instaFail();

  constexpr bool const& __cordl_internal_get_noArrows() const;

  constexpr bool& __cordl_internal_get_noArrows();

  constexpr bool const& __cordl_internal_get_noBombs() const;

  constexpr bool& __cordl_internal_get_noBombs();

  constexpr bool const& __cordl_internal_get_noFailOn0Energy() const;

  constexpr bool& __cordl_internal_get_noFailOn0Energy();

  constexpr bool const& __cordl_internal_get_proMode() const;

  constexpr bool& __cordl_internal_get_proMode();

  constexpr bool const& __cordl_internal_get_smallCubes() const;

  constexpr bool& __cordl_internal_get_smallCubes();

  constexpr ::GlobalNamespace::GameplayModifiers_PlayerSaveData_SongSpeed const& __cordl_internal_get_songSpeed() const;

  constexpr ::GlobalNamespace::GameplayModifiers_PlayerSaveData_SongSpeed& __cordl_internal_get_songSpeed();

  constexpr bool const& __cordl_internal_get_strictAngles() const;

  constexpr bool& __cordl_internal_get_strictAngles();

  constexpr bool const& __cordl_internal_get_zenMode() const;

  constexpr bool& __cordl_internal_get_zenMode();

  constexpr void __cordl_internal_set_disappearingArrows(bool value);

  constexpr void __cordl_internal_set_enabledObstacleType(::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnabledObstacleType value);

  constexpr void __cordl_internal_set_energyType(::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnergyType value);

  constexpr void __cordl_internal_set_failOnSaberClash(bool value);

  constexpr void __cordl_internal_set_fastNotes(bool value);

  constexpr void __cordl_internal_set_ghostNotes(bool value);

  constexpr void __cordl_internal_set_instaFail(bool value);

  constexpr void __cordl_internal_set_noArrows(bool value);

  constexpr void __cordl_internal_set_noBombs(bool value);

  constexpr void __cordl_internal_set_noFailOn0Energy(bool value);

  constexpr void __cordl_internal_set_proMode(bool value);

  constexpr void __cordl_internal_set_smallCubes(bool value);

  constexpr void __cordl_internal_set_songSpeed(::GlobalNamespace::GameplayModifiers_PlayerSaveData_SongSpeed value);

  constexpr void __cordl_internal_set_strictAngles(bool value);

  constexpr void __cordl_internal_set_zenMode(bool value);

  /// @brief Method .ctor, addr 0x26f1ec0, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr PlayerSaveData_GameplayModifiers();

public:
  // Ctor Parameters [CppParam { name: "", ty: "PlayerSaveData_GameplayModifiers", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  PlayerSaveData_GameplayModifiers(PlayerSaveData_GameplayModifiers&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "PlayerSaveData_GameplayModifiers", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  PlayerSaveData_GameplayModifiers(PlayerSaveData_GameplayModifiers const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 13286 };

  /// @brief Field energyType, offset: 0x10, size: 0x4, def value: None
  ::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnergyType ___energyType;

  /// @brief Field noFailOn0Energy, offset: 0x14, size: 0x1, def value: None
  bool ___noFailOn0Energy;

  /// @brief Field instaFail, offset: 0x15, size: 0x1, def value: None
  bool ___instaFail;

  /// @brief Field failOnSaberClash, offset: 0x16, size: 0x1, def value: None
  bool ___failOnSaberClash;

  /// @brief Field enabledObstacleType, offset: 0x18, size: 0x4, def value: None
  ::GlobalNamespace::GameplayModifiers_PlayerSaveData_EnabledObstacleType ___enabledObstacleType;

  /// @brief Field fastNotes, offset: 0x1c, size: 0x1, def value: None
  bool ___fastNotes;

  /// @brief Field strictAngles, offset: 0x1d, size: 0x1, def value: None
  bool ___strictAngles;

  /// @brief Field disappearingArrows, offset: 0x1e, size: 0x1, def value: None
  bool ___disappearingArrows;

  /// @brief Field ghostNotes, offset: 0x1f, size: 0x1, def value: None
  bool ___ghostNotes;

  /// @brief Field noBombs, offset: 0x20, size: 0x1, def value: None
  bool ___noBombs;

  /// @brief Field songSpeed, offset: 0x24, size: 0x4, def value: None
  ::GlobalNamespace::GameplayModifiers_PlayerSaveData_SongSpeed ___songSpeed;

  /// @brief Field noArrows, offset: 0x28, size: 0x1, def value: None
  bool ___noArrows;

  /// @brief Field proMode, offset: 0x29, size: 0x1, def value: None
  bool ___proMode;

  /// @brief Field zenMode, offset: 0x2a, size: 0x1, def value: None
  bool ___zenMode;

  /// @brief Field smallCubes, offset: 0x2b, size: 0x1, def value: None
  bool ___smallCubes;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::PlayerSaveData_GameplayModifiers, ___energyType) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_GameplayModifiers, ___noFailOn0Energy) == 0x14, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_GameplayModifiers, ___instaFail) == 0x15, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_GameplayModifiers, ___failOnSaberClash) == 0x16, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_GameplayModifiers, ___enabledObstacleType) == 0x18, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_GameplayModifiers, ___fastNotes) == 0x1c, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_GameplayModifiers, ___strictAngles) == 0x1d, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_GameplayModifiers, ___disappearingArrows) == 0x1e, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_GameplayModifiers, ___ghostNotes) == 0x1f, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_GameplayModifiers, ___noBombs) == 0x20, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_GameplayModifiers, ___songSpeed) == 0x24, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_GameplayModifiers, ___noArrows) == 0x28, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_GameplayModifiers, ___proMode) == 0x29, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_GameplayModifiers, ___zenMode) == 0x2a, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_GameplayModifiers, ___smallCubes) == 0x2b, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::PlayerSaveData_GameplayModifiers, 0x30>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies
namespace GlobalNamespace {
// Is value type: true
// CS Name: PlayerSaveData/ColorOverrideType
struct CORDL_TYPE PlayerSaveData_ColorOverrideType {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct __PlayerSaveData_ColorOverrideType_Unwrapped
  enum struct __PlayerSaveData_ColorOverrideType_Unwrapped : int32_t {
    __E_All = static_cast<int32_t>(0x0),
    __E_NotesOnly = static_cast<int32_t>(0x1),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __PlayerSaveData_ColorOverrideType_Unwrapped() const noexcept {
    return static_cast<__PlayerSaveData_ColorOverrideType_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr PlayerSaveData_ColorOverrideType();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr PlayerSaveData_ColorOverrideType(int32_t value__) noexcept;

  /// @brief Field All value: I32(0)
  static ::GlobalNamespace::PlayerSaveData_ColorOverrideType const All;

  /// @brief Field NotesOnly value: I32(1)
  static ::GlobalNamespace::PlayerSaveData_ColorOverrideType const NotesOnly;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 13287 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::PlayerSaveData_ColorOverrideType, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::PlayerSaveData_ColorOverrideType, 0x4>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies
namespace GlobalNamespace {
// Is value type: true
// CS Name: PlayerSaveData/PlayerSpecificSettings/EnvironmentEffectsFilterPresetSaveData
struct CORDL_TYPE PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct __PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData_Unwrapped
  enum struct __PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData_Unwrapped : int32_t {
    __E_AllEffects = static_cast<int32_t>(0x0),
    __E_StrobeFilter = static_cast<int32_t>(0x1),
    __E_NoEffects = static_cast<int32_t>(0xa),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData_Unwrapped() const noexcept {
    return static_cast<__PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData(int32_t value__) noexcept;

  /// @brief Field AllEffects value: I32(0)
  static ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData const AllEffects;

  /// @brief Field NoEffects value: I32(10)
  static ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData const NoEffects;

  /// @brief Field StrobeFilter value: I32(1)
  static ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData const StrobeFilter;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 13288 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData, 0x4>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies
namespace GlobalNamespace {
// Is value type: true
// CS Name: PlayerSaveData/PlayerSpecificSettings/ArcVisibilityTypeSaveData
struct CORDL_TYPE PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct __PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData_Unwrapped
  enum struct __PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData_Unwrapped : int32_t {
    __E_None = static_cast<int32_t>(0x0),
    __E_Low = static_cast<int32_t>(0x1),
    __E_Standard = static_cast<int32_t>(0x2),
    __E_High = static_cast<int32_t>(0x3),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData_Unwrapped() const noexcept {
    return static_cast<__PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData(int32_t value__) noexcept;

  /// @brief Field High value: I32(3)
  static ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData const High;

  /// @brief Field Low value: I32(1)
  static ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData const Low;

  /// @brief Field None value: I32(0)
  static ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData const None;

  /// @brief Field Standard value: I32(2)
  static ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData const Standard;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 13289 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData, 0x4>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies
namespace GlobalNamespace {
// Is value type: true
// CS Name: PlayerSaveData/PlayerSpecificSettings/NoteJumpDurationTypeSettingsSaveData
struct CORDL_TYPE PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct __PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData_Unwrapped
  enum struct __PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData_Unwrapped : int32_t {
    __E_Dynamic = static_cast<int32_t>(0x0),
    __E_Static = static_cast<int32_t>(0x1),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData_Unwrapped() const noexcept {
    return static_cast<__PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData(int32_t value__) noexcept;

  /// @brief Field Dynamic value: I32(0)
  static ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData const Dynamic;

  /// @brief Field Static value: I32(1)
  static ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData const Static;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 13290 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData, 0x4>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies PlayerSaveData::PlayerSpecificSettings::ArcVisibilityTypeSaveData, PlayerSaveData::PlayerSpecificSettings::EnvironmentEffectsFilterPresetSaveData,
// PlayerSaveData::PlayerSpecificSettings::NoteJumpDurationTypeSettingsSaveData, System.Object
namespace GlobalNamespace {
// Is value type: false
// CS Name: PlayerSaveData/PlayerSpecificSettings
class CORDL_TYPE PlayerSaveData_PlayerSpecificSettings : public ::System::Object {
public:
  // Declarations
  using ArcVisibilityTypeSaveData = ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData;

  using EnvironmentEffectsFilterPresetSaveData = ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData;

  using NoteJumpDurationTypeSettingsSaveData = ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData;

  /// @brief Field _noteJumpDurationTypeSettingsSaveData, offset 0x28, size 0x4
  __declspec(property(get = __cordl_internal_get__noteJumpDurationTypeSettingsSaveData,
                      put = __cordl_internal_set__noteJumpDurationTypeSettingsSaveData)) ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData
      _noteJumpDurationTypeSettingsSaveData;

  /// @brief Field adaptiveSfx, offset 0x39, size 0x1
  __declspec(property(get = __cordl_internal_get_adaptiveSfx, put = __cordl_internal_set_adaptiveSfx)) bool adaptiveSfx;

  /// @brief Field advancedHud, offset 0x22, size 0x1
  __declspec(property(get = __cordl_internal_get_advancedHud, put = __cordl_internal_set_advancedHud)) bool advancedHud;

  /// @brief Field arcsHapticFeedback, offset 0x3a, size 0x1
  __declspec(property(get = __cordl_internal_get_arcsHapticFeedback, put = __cordl_internal_set_arcsHapticFeedback)) bool arcsHapticFeedback;

  /// @brief Field arcsVisibleSaveData, offset 0x3c, size 0x4
  __declspec(property(get = __cordl_internal_get_arcsVisibleSaveData,
                      put = __cordl_internal_set_arcsVisibleSaveData)) ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData arcsVisibleSaveData;

  /// @brief Field autoRestart, offset 0x30, size 0x1
  __declspec(property(get = __cordl_internal_get_autoRestart, put = __cordl_internal_set_autoRestart)) bool autoRestart;

  /// @brief Field automaticPlayerHeight, offset 0x18, size 0x1
  __declspec(property(get = __cordl_internal_get_automaticPlayerHeight, put = __cordl_internal_set_automaticPlayerHeight)) bool automaticPlayerHeight;

  /// @brief Field environmentEffectsFilterDefaultPreset, offset 0x40, size 0x4
  __declspec(property(get = __cordl_internal_get_environmentEffectsFilterDefaultPreset,
                      put = __cordl_internal_set_environmentEffectsFilterDefaultPreset)) ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData
      environmentEffectsFilterDefaultPreset;

  /// @brief Field environmentEffectsFilterExpertPlusPreset, offset 0x44, size 0x4
  __declspec(property(get = __cordl_internal_get_environmentEffectsFilterExpertPlusPreset,
                      put = __cordl_internal_set_environmentEffectsFilterExpertPlusPreset)) ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData
      environmentEffectsFilterExpertPlusPreset;

  /// @brief Field headsetHapticIntensity, offset 0x48, size 0x4
  __declspec(property(get = __cordl_internal_get_headsetHapticIntensity, put = __cordl_internal_set_headsetHapticIntensity)) float_t headsetHapticIntensity;

  /// @brief Field hideNoteSpawnEffect, offset 0x38, size 0x1
  __declspec(property(get = __cordl_internal_get_hideNoteSpawnEffect, put = __cordl_internal_set_hideNoteSpawnEffect)) bool hideNoteSpawnEffect;

  /// @brief Field leftHanded, offset 0x11, size 0x1
  __declspec(property(get = __cordl_internal_get_leftHanded, put = __cordl_internal_set_leftHanded)) bool leftHanded;

  /// @brief Field noFailEffects, offset 0x31, size 0x1
  __declspec(property(get = __cordl_internal_get_noFailEffects, put = __cordl_internal_set_noFailEffects)) bool noFailEffects;

  /// @brief Field noTextsAndHuds, offset 0x21, size 0x1
  __declspec(property(get = __cordl_internal_get_noTextsAndHuds, put = __cordl_internal_set_noTextsAndHuds)) bool noTextsAndHuds;

  /// @brief Field noteJumpBeatOffset, offset 0x34, size 0x4
  __declspec(property(get = __cordl_internal_get_noteJumpBeatOffset, put = __cordl_internal_set_noteJumpBeatOffset)) float_t noteJumpBeatOffset;

  /// @brief Field noteJumpFixedDuration, offset 0x2c, size 0x4
  __declspec(property(get = __cordl_internal_get_noteJumpFixedDuration, put = __cordl_internal_set_noteJumpFixedDuration)) float_t noteJumpFixedDuration;

  /// @brief Field playerHeight, offset 0x14, size 0x4
  __declspec(property(get = __cordl_internal_get_playerHeight, put = __cordl_internal_set_playerHeight)) float_t playerHeight;

  /// @brief Field reduceDebris, offset 0x20, size 0x1
  __declspec(property(get = __cordl_internal_get_reduceDebris, put = __cordl_internal_set_reduceDebris)) bool reduceDebris;

  /// @brief Field saberTrailIntensity, offset 0x24, size 0x4
  __declspec(property(get = __cordl_internal_get_saberTrailIntensity, put = __cordl_internal_set_saberTrailIntensity)) float_t saberTrailIntensity;

  /// @brief Field sfxVolume, offset 0x1c, size 0x4
  __declspec(property(get = __cordl_internal_get_sfxVolume, put = __cordl_internal_set_sfxVolume)) float_t sfxVolume;

  /// @brief Field staticLights, offset 0x10, size 0x1
  __declspec(property(get = __cordl_internal_get_staticLights, put = __cordl_internal_set_staticLights)) bool staticLights;

  static inline ::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings* New_ctor();

  constexpr ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData const& __cordl_internal_get__noteJumpDurationTypeSettingsSaveData() const;

  constexpr ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData& __cordl_internal_get__noteJumpDurationTypeSettingsSaveData();

  constexpr bool const& __cordl_internal_get_adaptiveSfx() const;

  constexpr bool& __cordl_internal_get_adaptiveSfx();

  constexpr bool const& __cordl_internal_get_advancedHud() const;

  constexpr bool& __cordl_internal_get_advancedHud();

  constexpr bool const& __cordl_internal_get_arcsHapticFeedback() const;

  constexpr bool& __cordl_internal_get_arcsHapticFeedback();

  constexpr ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData const& __cordl_internal_get_arcsVisibleSaveData() const;

  constexpr ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData& __cordl_internal_get_arcsVisibleSaveData();

  constexpr bool const& __cordl_internal_get_autoRestart() const;

  constexpr bool& __cordl_internal_get_autoRestart();

  constexpr bool const& __cordl_internal_get_automaticPlayerHeight() const;

  constexpr bool& __cordl_internal_get_automaticPlayerHeight();

  constexpr ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData const& __cordl_internal_get_environmentEffectsFilterDefaultPreset() const;

  constexpr ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData& __cordl_internal_get_environmentEffectsFilterDefaultPreset();

  constexpr ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData const& __cordl_internal_get_environmentEffectsFilterExpertPlusPreset() const;

  constexpr ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData& __cordl_internal_get_environmentEffectsFilterExpertPlusPreset();

  constexpr float_t const& __cordl_internal_get_headsetHapticIntensity() const;

  constexpr float_t& __cordl_internal_get_headsetHapticIntensity();

  constexpr bool const& __cordl_internal_get_hideNoteSpawnEffect() const;

  constexpr bool& __cordl_internal_get_hideNoteSpawnEffect();

  constexpr bool const& __cordl_internal_get_leftHanded() const;

  constexpr bool& __cordl_internal_get_leftHanded();

  constexpr bool const& __cordl_internal_get_noFailEffects() const;

  constexpr bool& __cordl_internal_get_noFailEffects();

  constexpr bool const& __cordl_internal_get_noTextsAndHuds() const;

  constexpr bool& __cordl_internal_get_noTextsAndHuds();

  constexpr float_t const& __cordl_internal_get_noteJumpBeatOffset() const;

  constexpr float_t& __cordl_internal_get_noteJumpBeatOffset();

  constexpr float_t const& __cordl_internal_get_noteJumpFixedDuration() const;

  constexpr float_t& __cordl_internal_get_noteJumpFixedDuration();

  constexpr float_t const& __cordl_internal_get_playerHeight() const;

  constexpr float_t& __cordl_internal_get_playerHeight();

  constexpr bool const& __cordl_internal_get_reduceDebris() const;

  constexpr bool& __cordl_internal_get_reduceDebris();

  constexpr float_t const& __cordl_internal_get_saberTrailIntensity() const;

  constexpr float_t& __cordl_internal_get_saberTrailIntensity();

  constexpr float_t const& __cordl_internal_get_sfxVolume() const;

  constexpr float_t& __cordl_internal_get_sfxVolume();

  constexpr bool const& __cordl_internal_get_staticLights() const;

  constexpr bool& __cordl_internal_get_staticLights();

  constexpr void __cordl_internal_set__noteJumpDurationTypeSettingsSaveData(::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData value);

  constexpr void __cordl_internal_set_adaptiveSfx(bool value);

  constexpr void __cordl_internal_set_advancedHud(bool value);

  constexpr void __cordl_internal_set_arcsHapticFeedback(bool value);

  constexpr void __cordl_internal_set_arcsVisibleSaveData(::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData value);

  constexpr void __cordl_internal_set_autoRestart(bool value);

  constexpr void __cordl_internal_set_automaticPlayerHeight(bool value);

  constexpr void __cordl_internal_set_environmentEffectsFilterDefaultPreset(::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData value);

  constexpr void __cordl_internal_set_environmentEffectsFilterExpertPlusPreset(::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData value);

  constexpr void __cordl_internal_set_headsetHapticIntensity(float_t value);

  constexpr void __cordl_internal_set_hideNoteSpawnEffect(bool value);

  constexpr void __cordl_internal_set_leftHanded(bool value);

  constexpr void __cordl_internal_set_noFailEffects(bool value);

  constexpr void __cordl_internal_set_noTextsAndHuds(bool value);

  constexpr void __cordl_internal_set_noteJumpBeatOffset(float_t value);

  constexpr void __cordl_internal_set_noteJumpFixedDuration(float_t value);

  constexpr void __cordl_internal_set_playerHeight(float_t value);

  constexpr void __cordl_internal_set_reduceDebris(bool value);

  constexpr void __cordl_internal_set_saberTrailIntensity(float_t value);

  constexpr void __cordl_internal_set_sfxVolume(float_t value);

  constexpr void __cordl_internal_set_staticLights(bool value);

  /// @brief Method .ctor, addr 0x26f1ec8, size 0x38, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr PlayerSaveData_PlayerSpecificSettings();

public:
  // Ctor Parameters [CppParam { name: "", ty: "PlayerSaveData_PlayerSpecificSettings", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  PlayerSaveData_PlayerSpecificSettings(PlayerSaveData_PlayerSpecificSettings&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "PlayerSaveData_PlayerSpecificSettings", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  PlayerSaveData_PlayerSpecificSettings(PlayerSaveData_PlayerSpecificSettings const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 13291 };

  /// @brief Field staticLights, offset: 0x10, size: 0x1, def value: None
  bool ___staticLights;

  /// @brief Field leftHanded, offset: 0x11, size: 0x1, def value: None
  bool ___leftHanded;

  /// @brief Field playerHeight, offset: 0x14, size: 0x4, def value: None
  float_t ___playerHeight;

  /// @brief Field automaticPlayerHeight, offset: 0x18, size: 0x1, def value: None
  bool ___automaticPlayerHeight;

  /// @brief Field sfxVolume, offset: 0x1c, size: 0x4, def value: None
  float_t ___sfxVolume;

  /// @brief Field reduceDebris, offset: 0x20, size: 0x1, def value: None
  bool ___reduceDebris;

  /// @brief Field noTextsAndHuds, offset: 0x21, size: 0x1, def value: None
  bool ___noTextsAndHuds;

  /// @brief Field advancedHud, offset: 0x22, size: 0x1, def value: None
  bool ___advancedHud;

  /// @brief Field saberTrailIntensity, offset: 0x24, size: 0x4, def value: None
  float_t ___saberTrailIntensity;

  /// @brief Field _noteJumpDurationTypeSettingsSaveData, offset: 0x28, size: 0x4, def value: None
  ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_NoteJumpDurationTypeSettingsSaveData ____noteJumpDurationTypeSettingsSaveData;

  /// @brief Field noteJumpFixedDuration, offset: 0x2c, size: 0x4, def value: None
  float_t ___noteJumpFixedDuration;

  /// @brief Field autoRestart, offset: 0x30, size: 0x1, def value: None
  bool ___autoRestart;

  /// @brief Field noFailEffects, offset: 0x31, size: 0x1, def value: None
  bool ___noFailEffects;

  /// @brief Field noteJumpBeatOffset, offset: 0x34, size: 0x4, def value: None
  float_t ___noteJumpBeatOffset;

  /// @brief Field hideNoteSpawnEffect, offset: 0x38, size: 0x1, def value: None
  bool ___hideNoteSpawnEffect;

  /// @brief Field adaptiveSfx, offset: 0x39, size: 0x1, def value: None
  bool ___adaptiveSfx;

  /// @brief Field arcsHapticFeedback, offset: 0x3a, size: 0x1, def value: None
  bool ___arcsHapticFeedback;

  /// @brief Field arcsVisibleSaveData, offset: 0x3c, size: 0x4, def value: None
  ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_ArcVisibilityTypeSaveData ___arcsVisibleSaveData;

  /// @brief Field environmentEffectsFilterDefaultPreset, offset: 0x40, size: 0x4, def value: None
  ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData ___environmentEffectsFilterDefaultPreset;

  /// @brief Field environmentEffectsFilterExpertPlusPreset, offset: 0x44, size: 0x4, def value: None
  ::GlobalNamespace::PlayerSpecificSettings_PlayerSaveData_EnvironmentEffectsFilterPresetSaveData ___environmentEffectsFilterExpertPlusPreset;

  /// @brief Field headsetHapticIntensity, offset: 0x48, size: 0x4, def value: None
  float_t ___headsetHapticIntensity;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___staticLights) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___leftHanded) == 0x11, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___playerHeight) == 0x14, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___automaticPlayerHeight) == 0x18, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___sfxVolume) == 0x1c, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___reduceDebris) == 0x20, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___noTextsAndHuds) == 0x21, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___advancedHud) == 0x22, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___saberTrailIntensity) == 0x24, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ____noteJumpDurationTypeSettingsSaveData) == 0x28, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___noteJumpFixedDuration) == 0x2c, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___autoRestart) == 0x30, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___noFailEffects) == 0x31, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___noteJumpBeatOffset) == 0x34, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___hideNoteSpawnEffect) == 0x38, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___adaptiveSfx) == 0x39, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___arcsHapticFeedback) == 0x3a, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___arcsVisibleSaveData) == 0x3c, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___environmentEffectsFilterDefaultPreset) == 0x40, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___environmentEffectsFilterExpertPlusPreset) == 0x44, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, ___headsetHapticIntensity) == 0x48, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::PlayerSaveData_PlayerSpecificSettings, 0x50>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies System.Object
namespace GlobalNamespace {
// Is value type: false
// CS Name: PlayerSaveData/PlayerAllOverallStatsData
class CORDL_TYPE PlayerSaveData_PlayerAllOverallStatsData : public ::System::Object {
public:
  // Declarations
  /// @brief Field campaignOverallStatsData, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_campaignOverallStatsData,
                      put = __cordl_internal_set_campaignOverallStatsData)) ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* campaignOverallStatsData;

  /// @brief Field onlinePlayOverallStatsData, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_onlinePlayOverallStatsData,
                      put = __cordl_internal_set_onlinePlayOverallStatsData)) ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* onlinePlayOverallStatsData;

  /// @brief Field partyFreePlayOverallStatsData, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_partyFreePlayOverallStatsData,
                      put = __cordl_internal_set_partyFreePlayOverallStatsData)) ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* partyFreePlayOverallStatsData;

  /// @brief Field soloFreePlayOverallStatsData, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_soloFreePlayOverallStatsData,
                      put = __cordl_internal_set_soloFreePlayOverallStatsData)) ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* soloFreePlayOverallStatsData;

  static inline ::GlobalNamespace::PlayerSaveData_PlayerAllOverallStatsData* New_ctor();

  static inline ::GlobalNamespace::PlayerSaveData_PlayerAllOverallStatsData* New_ctor(::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* campaignOverallStatsData,
                                                                                      ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* soloFreePlayOverallStatsData,
                                                                                      ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* partyFreePlayOverallStatsData,
                                                                                      ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* onlinePlayOverallStatsData);

  constexpr ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* const& __cordl_internal_get_campaignOverallStatsData() const;

  constexpr ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData*& __cordl_internal_get_campaignOverallStatsData();

  constexpr ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* const& __cordl_internal_get_onlinePlayOverallStatsData() const;

  constexpr ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData*& __cordl_internal_get_onlinePlayOverallStatsData();

  constexpr ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* const& __cordl_internal_get_partyFreePlayOverallStatsData() const;

  constexpr ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData*& __cordl_internal_get_partyFreePlayOverallStatsData();

  constexpr ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* const& __cordl_internal_get_soloFreePlayOverallStatsData() const;

  constexpr ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData*& __cordl_internal_get_soloFreePlayOverallStatsData();

  constexpr void __cordl_internal_set_campaignOverallStatsData(::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* value);

  constexpr void __cordl_internal_set_onlinePlayOverallStatsData(::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* value);

  constexpr void __cordl_internal_set_partyFreePlayOverallStatsData(::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* value);

  constexpr void __cordl_internal_set_soloFreePlayOverallStatsData(::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* value);

  /// @brief Method .ctor, addr 0x26f5804, size 0xac, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method .ctor, addr 0x26f5998, size 0x40, virtual false, abstract: false, final false
  inline void _ctor(::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* campaignOverallStatsData, ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* soloFreePlayOverallStatsData,
                    ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* partyFreePlayOverallStatsData, ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* onlinePlayOverallStatsData);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr PlayerSaveData_PlayerAllOverallStatsData();

public:
  // Ctor Parameters [CppParam { name: "", ty: "PlayerSaveData_PlayerAllOverallStatsData", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  PlayerSaveData_PlayerAllOverallStatsData(PlayerSaveData_PlayerAllOverallStatsData&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "PlayerSaveData_PlayerAllOverallStatsData", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  PlayerSaveData_PlayerAllOverallStatsData(PlayerSaveData_PlayerAllOverallStatsData const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 13292 };

  /// @brief Field campaignOverallStatsData, offset: 0x10, size: 0x8, def value: None
  ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* ___campaignOverallStatsData;

  /// @brief Field soloFreePlayOverallStatsData, offset: 0x18, size: 0x8, def value: None
  ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* ___soloFreePlayOverallStatsData;

  /// @brief Field partyFreePlayOverallStatsData, offset: 0x20, size: 0x8, def value: None
  ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* ___partyFreePlayOverallStatsData;

  /// @brief Field onlinePlayOverallStatsData, offset: 0x28, size: 0x8, def value: None
  ::GlobalNamespace::PlayerSaveData_PlayerOverallStatsData* ___onlinePlayOverallStatsData;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerAllOverallStatsData, ___campaignOverallStatsData) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerAllOverallStatsData, ___soloFreePlayOverallStatsData) == 0x18, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerAllOverallStatsData, ___partyFreePlayOverallStatsData) == 0x20, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::PlayerSaveData_PlayerAllOverallStatsData, ___onlinePlayOverallStatsData) == 0x28, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::GlobalNamespace::PlayerSaveData_PlayerAllOverallStatsData, 0x30>, "Size mismatch!");

} // namespace GlobalNamespace
// Dependencies System.Object
namespace GlobalNamespace {
// Is value type: false
// CS Name: PlayerSaveData/PlayerOverallStatsData
class CORDL_TYPE PlayerSaveData_PlayerOverallStatsData : public ::System::Object {
public:
  // Declarations
  /// @brief Field badCutsCount, offset 0x14, size 0x4
  __declspec(property(get = __cordl_internal_get_badCutsCount, put = __cordl_internal_set_badCutsCount)) int32_t badCutsCount;

  /// @brief Field cleardLevelsCount, offset 0x2c, size 0x4
  __declspec(property(get = __cordl_internal_get_cleardLevelsCount, put = __cordl_internal_set_cleardLevelsCount)) int32_t cleardLevelsCount;

  /// @brief Field cummulativeCutScoreWithoutMultiplier, offset 0x40, size 0x8
  __declspec(property(get = __cordl_internal_get_cummulativeCutScoreWithoutMultiplier, put = __cordl_internal_set_cummulativeCutScoreWithoutMultiplier)) int64_t cummulativeCutScoreWithoutMultiplier;

  /// @brief Field failedLevelsCount, offset 0x30, size 0x4
  __declspec(property(get = __cordl_internal_get_failedLevelsCount, put = __cordl_internal_set_failedLevelsCount)) int32_t failedLevelsCount;

  /// @brief Field fullComboCount, offset 0x34, size 0x4
  __declspec(property(get = __cordl_internal_get_fullComboCount, put = __cordl_internal_set_fullComboCount)) int32_t fullComboCount;

  /// @brief Field goodCutsCount, offset 0x10, size 0x4
  __declspec(property(get = __cordl_internal_get_goodCutsCount, put = __cordl_internal_set_goodCutsCount)) int32_t goodCutsCount;

  /// @brief Field handDistanceTravelled, offset 0x3c, size 0x4
  __declspec(property(get = __cordl_internal_get_handDistanceTravelled, put = __cordl_internal_set_handDistanceTravelled)) int32_t handDistanceTravelled;

  /// @brief Field missedCutsCount, offset 0x18, size 0x4
  __declspec(property(get = __cordl_internal_get_missedCutsCount, put = __cordl_internal_set_missedCutsCount)) int32_t missedCutsCount;

  /// @brief Field playedLevelsCount, offset 0x28, size 0x4
  __declspec(property(get = __cordl_internal_get_playedLevelsCount, put = __cordl_internal_set_playedLevelsCount)) int32_t playedLevelsCount;

  /// @brief Field timePlayed, offset 0x38, size 0x4
  __declspec(property(get = __cordl_internal_get_timePlayed, put = __cordl_internal_set_timePlayed)) float_t timePlayed;

