#pragma once
// IWYU pragma private; include "GlobalNamespace/PlayerSaveData.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "GlobalNamespace/zzzz__BeatmapDifficulty_def.hpp"
#include "GlobalNamespace/zzzz__PlayerSaveData_def.hpp"
#include "GlobalNamespace/zzzz__RankModel_def.hpp"
#include "GlobalNamespace/zzzz__VersionSaveData_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "UnityEngine/zzzz__Color_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cmath>
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(PlayerSaveData)
namespace GlobalNamespace {
class __PlayerSaveData__ColorScheme;
}
namespace GlobalNamespace {
class __PlayerSaveData__ColorSchemesSettings;
}
namespace GlobalNamespace {
class __PlayerSaveData__GameplayModifiers;
}
namespace GlobalNamespace {
struct __PlayerSaveData__GameplayModifiers__EnabledObstacleType;
}
namespace GlobalNamespace {
struct __PlayerSaveData__GameplayModifiers__EnergyType;
}
namespace GlobalNamespace {
struct __PlayerSaveData__GameplayModifiers__SongSpeed;
}
namespace GlobalNamespace {
class __PlayerSaveData__GuestPlayer;
}
namespace GlobalNamespace {
class __PlayerSaveData__LocalPlayer;
}
namespace GlobalNamespace {
class __PlayerSaveData__MultiplayerModeSettings;
}
namespace GlobalNamespace {
class __PlayerSaveData__OverrideEnvironmentSettings;
}

namespace GlobalNamespace {
class __PlayerSaveData__GuestPlayer;
}
namespace GlobalNamespace {
class __PlayerSaveData__LocalPlayer;
}
namespace GlobalNamespace {
class __PlayerSaveData__MultiplayerModeSettings;
}
namespace GlobalNamespace {
class __PlayerSaveData__OverrideEnvironmentSettings;
}
namespace GlobalNamespace {
class __PlayerSaveData__PlayerAgreementsData;
}
namespace GlobalNamespace {
class __PlayerSaveData__PlayerAllOverallStatsData;
}
namespace GlobalNamespace {
class __PlayerSaveData__PlayerLevelStatsData;
}
namespace GlobalNamespace {
class __PlayerSaveData__PlayerMissionStatsData;
}
namespace GlobalNamespace {
class __PlayerSaveData__PlayerOverallStatsData;
}
namespace GlobalNamespace {
class __PlayerSaveData__PlayerSpecificSettings;
}
namespace GlobalNamespace {
class __PlayerSaveData__PracticeSettings;
}
// Write type traits
MARK_VAL_T(::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnabledObstacleType);
MARK_VAL_T(::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnergyType);
MARK_VAL_T(::GlobalNamespace::__PlayerSaveData__GameplayModifiers__SongSpeed);
MARK_VAL_T(::GlobalNamespace::__PlayerSaveData__PlayerSensitivityFlagSaveData);
MARK_VAL_T(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData);
MARK_VAL_T(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData);
MARK_VAL_T(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData);
MARK_VAL_T(::GlobalNamespace::__PlayerSaveData__UserAgeCategorySaveData);
MARK_REF_PTR_T(::GlobalNamespace::PlayerSaveData);
MARK_REF_PTR_T(::GlobalNamespace::__PlayerSaveData__ColorScheme);
MARK_REF_PTR_T(::GlobalNamespace::__PlayerSaveData__ColorSchemesSettings);
MARK_REF_PTR_T(::GlobalNamespace::__PlayerSaveData__GameplayModifiers);
MARK_REF_PTR_T(::GlobalNamespace::__PlayerSaveData__GuestPlayer);
MARK_REF_PTR_T(::GlobalNamespace::__PlayerSaveData__LocalPlayer);
MARK_REF_PTR_T(::GlobalNamespace::__PlayerSaveData__MultiplayerModeSettings);
MARK_REF_PTR_T(::GlobalNamespace::__PlayerSaveData__OverrideEnvironmentSettings);
MARK_REF_PTR_T(::GlobalNamespace::__PlayerSaveData__PlayerAgreementsData);
MARK_REF_PTR_T(::GlobalNamespace::__PlayerSaveData__PlayerAllOverallStatsData);
MARK_REF_PTR_T(::GlobalNamespace::__PlayerSaveData__PlayerLevelStatsData);
MARK_REF_PTR_T(::GlobalNamespace::__PlayerSaveData__PlayerMissionStatsData);
MARK_REF_PTR_T(::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData);
MARK_REF_PTR_T(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings);
MARK_REF_PTR_T(::GlobalNamespace::__PlayerSaveData__PracticeSettings);
// Type: ::EnabledObstacleType
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: true
// CS Name: ::PlayerSaveData::GameplayModifiers::EnabledObstacleType
struct CORDL_TYPE __PlayerSaveData__GameplayModifiers__EnabledObstacleType {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____PlayerSaveData__GameplayModifiers__EnabledObstacleType_Unwrapped
  enum struct ____PlayerSaveData__GameplayModifiers__EnabledObstacleType_Unwrapped : int32_t {
    __E_All = static_cast<int32_t>(0x0),
    __E_FullHeightOnly = static_cast<int32_t>(0x1),
    __E_None = static_cast<int32_t>(0x2),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____PlayerSaveData__GameplayModifiers__EnabledObstacleType_Unwrapped() const noexcept {
    return static_cast<____PlayerSaveData__GameplayModifiers__EnabledObstacleType_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __PlayerSaveData__GameplayModifiers__EnabledObstacleType();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __PlayerSaveData__GameplayModifiers__EnabledObstacleType(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field All value: static_cast<int32_t>(0x0)
  static ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnabledObstacleType const All;

  /// @brief Field FullHeightOnly value: static_cast<int32_t>(0x1)
  static ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnabledObstacleType const FullHeightOnly;

  /// @brief Field None value: static_cast<int32_t>(0x2)
  static ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnabledObstacleType const None;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnabledObstacleType, 0x4>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnabledObstacleType, value__) == 0x0, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::EnergyType
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: true
// CS Name: ::PlayerSaveData::GameplayModifiers::EnergyType
struct CORDL_TYPE __PlayerSaveData__GameplayModifiers__EnergyType {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____PlayerSaveData__GameplayModifiers__EnergyType_Unwrapped
  enum struct ____PlayerSaveData__GameplayModifiers__EnergyType_Unwrapped : int32_t {
    __E_Bar = static_cast<int32_t>(0x0),
    __E_Battery = static_cast<int32_t>(0x1),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____PlayerSaveData__GameplayModifiers__EnergyType_Unwrapped() const noexcept {
    return static_cast<____PlayerSaveData__GameplayModifiers__EnergyType_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __PlayerSaveData__GameplayModifiers__EnergyType();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __PlayerSaveData__GameplayModifiers__EnergyType(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field Bar value: static_cast<int32_t>(0x0)
  static ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnergyType const Bar;

  /// @brief Field Battery value: static_cast<int32_t>(0x1)
  static ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnergyType const Battery;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnergyType, 0x4>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnergyType, value__) == 0x0, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::SongSpeed
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: true
// CS Name: ::PlayerSaveData::GameplayModifiers::SongSpeed
struct CORDL_TYPE __PlayerSaveData__GameplayModifiers__SongSpeed {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____PlayerSaveData__GameplayModifiers__SongSpeed_Unwrapped
  enum struct ____PlayerSaveData__GameplayModifiers__SongSpeed_Unwrapped : int32_t {
    __E_Normal = static_cast<int32_t>(0x0),
    __E_Faster = static_cast<int32_t>(0x1),
    __E_Slower = static_cast<int32_t>(0x2),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____PlayerSaveData__GameplayModifiers__SongSpeed_Unwrapped() const noexcept {
    return static_cast<____PlayerSaveData__GameplayModifiers__SongSpeed_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __PlayerSaveData__GameplayModifiers__SongSpeed();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __PlayerSaveData__GameplayModifiers__SongSpeed(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field Faster value: static_cast<int32_t>(0x1)
  static ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__SongSpeed const Faster;

  /// @brief Field Normal value: static_cast<int32_t>(0x0)
  static ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__SongSpeed const Normal;

  /// @brief Field Slower value: static_cast<int32_t>(0x2)
  static ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__SongSpeed const Slower;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__PlayerSaveData__GameplayModifiers__SongSpeed, 0x4>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers__SongSpeed, value__) == 0x0, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::GameplayModifiers
// SizeInfo { instance_size: 48, native_size: -1, calculated_instance_size: 48, calculated_native_size: 45, minimum_alignment: 8, natural_alignment: 4, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::PlayerSaveData::GameplayModifiers*
class CORDL_TYPE __PlayerSaveData__GameplayModifiers : public ::System::Object {
public:
  // Declarations
  using EnabledObstacleType = ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnabledObstacleType;

  using EnergyType = ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnergyType;

  using SongSpeed = ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__SongSpeed;

  /// @brief Field disappearingArrows, offset 0x1e, size 0x1
  __declspec(property(get = __cordl_internal_get_disappearingArrows, put = __cordl_internal_set_disappearingArrows)) bool disappearingArrows;

  /// @brief Field enabledObstacleType, offset 0x18, size 0x4
  __declspec(property(get = __cordl_internal_get_enabledObstacleType,
                      put = __cordl_internal_set_enabledObstacleType))::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnabledObstacleType enabledObstacleType;

  /// @brief Field energyType, offset 0x10, size 0x4
  __declspec(property(get = __cordl_internal_get_energyType, put = __cordl_internal_set_energyType))::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnergyType energyType;

  /// @brief Field failOnSaberClash, offset 0x15, size 0x1
  __declspec(property(get = __cordl_internal_get_failOnSaberClash, put = __cordl_internal_set_failOnSaberClash)) bool failOnSaberClash;

  /// @brief Field fastNotes, offset 0x1c, size 0x1
  __declspec(property(get = __cordl_internal_get_fastNotes, put = __cordl_internal_set_fastNotes)) bool fastNotes;

  /// @brief Field ghostNotes, offset 0x1f, size 0x1
  __declspec(property(get = __cordl_internal_get_ghostNotes, put = __cordl_internal_set_ghostNotes)) bool ghostNotes;

  /// @brief Field instaFail, offset 0x14, size 0x1
  __declspec(property(get = __cordl_internal_get_instaFail, put = __cordl_internal_set_instaFail)) bool instaFail;

  /// @brief Field noArrows, offset 0x28, size 0x1
  __declspec(property(get = __cordl_internal_get_noArrows, put = __cordl_internal_set_noArrows)) bool noArrows;

  /// @brief Field noBombs, offset 0x20, size 0x1
  __declspec(property(get = __cordl_internal_get_noBombs, put = __cordl_internal_set_noBombs)) bool noBombs;

  /// @brief Field noFailOn0Energy, offset 0x29, size 0x1
  __declspec(property(get = __cordl_internal_get_noFailOn0Energy, put = __cordl_internal_set_noFailOn0Energy)) bool noFailOn0Energy;

  /// @brief Field proMode, offset 0x2a, size 0x1
  __declspec(property(get = __cordl_internal_get_proMode, put = __cordl_internal_set_proMode)) bool proMode;

  /// @brief Field smallCubes, offset 0x2c, size 0x1
  __declspec(property(get = __cordl_internal_get_smallCubes, put = __cordl_internal_set_smallCubes)) bool smallCubes;

  /// @brief Field songSpeed, offset 0x24, size 0x4
  __declspec(property(get = __cordl_internal_get_songSpeed, put = __cordl_internal_set_songSpeed))::GlobalNamespace::__PlayerSaveData__GameplayModifiers__SongSpeed songSpeed;

  /// @brief Field strictAngles, offset 0x1d, size 0x1
  __declspec(property(get = __cordl_internal_get_strictAngles, put = __cordl_internal_set_strictAngles)) bool strictAngles;

  /// @brief Field zenMode, offset 0x2b, size 0x1
  __declspec(property(get = __cordl_internal_get_zenMode, put = __cordl_internal_set_zenMode)) bool zenMode;

  static inline ::GlobalNamespace::__PlayerSaveData__GameplayModifiers* New_ctor();

  constexpr bool const& __cordl_internal_get_disappearingArrows() const;

  constexpr bool& __cordl_internal_get_disappearingArrows();

  constexpr ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnabledObstacleType const& __cordl_internal_get_enabledObstacleType() const;

  constexpr ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnabledObstacleType& __cordl_internal_get_enabledObstacleType();

  constexpr ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnergyType const& __cordl_internal_get_energyType() const;

  constexpr ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnergyType& __cordl_internal_get_energyType();

  constexpr bool const& __cordl_internal_get_failOnSaberClash() const;

  constexpr bool& __cordl_internal_get_failOnSaberClash();

  constexpr bool const& __cordl_internal_get_fastNotes() const;

  constexpr bool& __cordl_internal_get_fastNotes();

  constexpr bool const& __cordl_internal_get_ghostNotes() const;

  constexpr bool& __cordl_internal_get_ghostNotes();

  constexpr bool const& __cordl_internal_get_instaFail() const;

  constexpr bool& __cordl_internal_get_instaFail();

  constexpr bool const& __cordl_internal_get_noArrows() const;

  constexpr bool& __cordl_internal_get_noArrows();

  constexpr bool const& __cordl_internal_get_noBombs() const;

  constexpr bool& __cordl_internal_get_noBombs();

  constexpr bool const& __cordl_internal_get_noFailOn0Energy() const;

  constexpr bool& __cordl_internal_get_noFailOn0Energy();

  constexpr bool const& __cordl_internal_get_proMode() const;

  constexpr bool& __cordl_internal_get_proMode();

  constexpr bool const& __cordl_internal_get_smallCubes() const;

  constexpr bool& __cordl_internal_get_smallCubes();

  constexpr ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__SongSpeed const& __cordl_internal_get_songSpeed() const;

  constexpr ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__SongSpeed& __cordl_internal_get_songSpeed();

  constexpr bool const& __cordl_internal_get_strictAngles() const;

  constexpr bool& __cordl_internal_get_strictAngles();

  constexpr bool const& __cordl_internal_get_zenMode() const;

  constexpr bool& __cordl_internal_get_zenMode();

  constexpr void __cordl_internal_set_disappearingArrows(bool value);

  constexpr void __cordl_internal_set_enabledObstacleType(::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnabledObstacleType value);

  constexpr void __cordl_internal_set_energyType(::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnergyType value);

  constexpr void __cordl_internal_set_failOnSaberClash(bool value);

  constexpr void __cordl_internal_set_fastNotes(bool value);

  constexpr void __cordl_internal_set_ghostNotes(bool value);

  constexpr void __cordl_internal_set_instaFail(bool value);

  constexpr void __cordl_internal_set_noArrows(bool value);

  constexpr void __cordl_internal_set_noBombs(bool value);

  constexpr void __cordl_internal_set_noFailOn0Energy(bool value);

  constexpr void __cordl_internal_set_proMode(bool value);

  constexpr void __cordl_internal_set_smallCubes(bool value);

  constexpr void __cordl_internal_set_songSpeed(::GlobalNamespace::__PlayerSaveData__GameplayModifiers__SongSpeed value);

  constexpr void __cordl_internal_set_strictAngles(bool value);

  constexpr void __cordl_internal_set_zenMode(bool value);

  /// @brief Method .ctor, addr 0x14e69a4, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __PlayerSaveData__GameplayModifiers();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__PlayerSaveData__GameplayModifiers", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __PlayerSaveData__GameplayModifiers(__PlayerSaveData__GameplayModifiers&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__PlayerSaveData__GameplayModifiers", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __PlayerSaveData__GameplayModifiers(__PlayerSaveData__GameplayModifiers const&) = delete;

  /// @brief Field energyType, offset: 0x10, size: 0x4, def value: None
  ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnergyType ___energyType;

  /// @brief Field instaFail, offset: 0x14, size: 0x1, def value: None
  bool ___instaFail;

  /// @brief Field failOnSaberClash, offset: 0x15, size: 0x1, def value: None
  bool ___failOnSaberClash;

  /// @brief Field enabledObstacleType, offset: 0x18, size: 0x4, def value: None
  ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__EnabledObstacleType ___enabledObstacleType;

  /// @brief Field fastNotes, offset: 0x1c, size: 0x1, def value: None
  bool ___fastNotes;

  /// @brief Field strictAngles, offset: 0x1d, size: 0x1, def value: None
  bool ___strictAngles;

  /// @brief Field disappearingArrows, offset: 0x1e, size: 0x1, def value: None
  bool ___disappearingArrows;

  /// @brief Field ghostNotes, offset: 0x1f, size: 0x1, def value: None
  bool ___ghostNotes;

  /// @brief Field noBombs, offset: 0x20, size: 0x1, def value: None
  bool ___noBombs;

  /// @brief Field songSpeed, offset: 0x24, size: 0x4, def value: None
  ::GlobalNamespace::__PlayerSaveData__GameplayModifiers__SongSpeed ___songSpeed;

  /// @brief Field noArrows, offset: 0x28, size: 0x1, def value: None
  bool ___noArrows;

  /// @brief Field noFailOn0Energy, offset: 0x29, size: 0x1, def value: None
  bool ___noFailOn0Energy;

  /// @brief Field proMode, offset: 0x2a, size: 0x1, def value: None
  bool ___proMode;

  /// @brief Field zenMode, offset: 0x2b, size: 0x1, def value: None
  bool ___zenMode;

  /// @brief Field smallCubes, offset: 0x2c, size: 0x1, def value: None
  bool ___smallCubes;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__PlayerSaveData__GameplayModifiers, 0x30>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers, ___energyType) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers, ___instaFail) == 0x14, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers, ___failOnSaberClash) == 0x15, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers, ___enabledObstacleType) == 0x18, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers, ___fastNotes) == 0x1c, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers, ___strictAngles) == 0x1d, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers, ___disappearingArrows) == 0x1e, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers, ___ghostNotes) == 0x1f, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers, ___noBombs) == 0x20, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers, ___songSpeed) == 0x24, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers, ___noArrows) == 0x28, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers, ___noFailOn0Energy) == 0x29, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers, ___proMode) == 0x2a, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers, ___zenMode) == 0x2b, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__GameplayModifiers, ___smallCubes) == 0x2c, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::EnvironmentEffectsFilterPresetSaveData
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: true
// CS Name: ::PlayerSaveData::PlayerSpecificSettings::EnvironmentEffectsFilterPresetSaveData
struct CORDL_TYPE __PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData_Unwrapped
  enum struct ____PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData_Unwrapped : int32_t {
    __E_AllEffects = static_cast<int32_t>(0x0),
    __E_StrobeFilter = static_cast<int32_t>(0x1),
    __E_NoEffects = static_cast<int32_t>(0xa),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData_Unwrapped() const noexcept {
    return static_cast<____PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field AllEffects value: static_cast<int32_t>(0x0)
  static ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData const AllEffects;

  /// @brief Field NoEffects value: static_cast<int32_t>(0xa)
  static ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData const NoEffects;

  /// @brief Field StrobeFilter value: static_cast<int32_t>(0x1)
  static ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData const StrobeFilter;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData, 0x4>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData, value__) == 0x0, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::ArcVisibilityTypeSaveData
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: true
// CS Name: ::PlayerSaveData::PlayerSpecificSettings::ArcVisibilityTypeSaveData
struct CORDL_TYPE __PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData_Unwrapped
  enum struct ____PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData_Unwrapped : int32_t {
    __E_None = static_cast<int32_t>(0x0),
    __E_Low = static_cast<int32_t>(0x1),
    __E_Standard = static_cast<int32_t>(0x2),
    __E_High = static_cast<int32_t>(0x3),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData_Unwrapped() const noexcept {
    return static_cast<____PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field High value: static_cast<int32_t>(0x3)
  static ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData const High;

  /// @brief Field Low value: static_cast<int32_t>(0x1)
  static ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData const Low;

  /// @brief Field None value: static_cast<int32_t>(0x0)
  static ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData const None;

  /// @brief Field Standard value: static_cast<int32_t>(0x2)
  static ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData const Standard;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData, 0x4>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData, value__) == 0x0, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::NoteJumpDurationTypeSettingsSaveData
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: true
// CS Name: ::PlayerSaveData::PlayerSpecificSettings::NoteJumpDurationTypeSettingsSaveData
struct CORDL_TYPE __PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData_Unwrapped
  enum struct ____PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData_Unwrapped : int32_t {
    __E_Dynamic = static_cast<int32_t>(0x0),
    __E_Static = static_cast<int32_t>(0x1),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData_Unwrapped() const noexcept {
    return static_cast<____PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field Dynamic value: static_cast<int32_t>(0x0)
  static ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData const Dynamic;

  /// @brief Field Static value: static_cast<int32_t>(0x1)
  static ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData const Static;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData, 0x4>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData, value__) == 0x0, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::PlayerSpecificSettings
// SizeInfo { instance_size: 80, native_size: -1, calculated_instance_size: 80, calculated_native_size: 76, minimum_alignment: 8, natural_alignment: 4, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::PlayerSaveData::PlayerSpecificSettings*
class CORDL_TYPE __PlayerSaveData__PlayerSpecificSettings : public ::System::Object {
public:
  // Declarations
  using ArcVisibilityTypeSaveData = ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData;

  using EnvironmentEffectsFilterPresetSaveData = ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData;

  using NoteJumpDurationTypeSettingsSaveData = ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData;

  /// @brief Field _noteJumpDurationTypeSettingsSaveData, offset 0x28, size 0x4
  __declspec(property(get = __cordl_internal_get__noteJumpDurationTypeSettingsSaveData,
                      put = __cordl_internal_set__noteJumpDurationTypeSettingsSaveData))::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData
      _noteJumpDurationTypeSettingsSaveData;

  /// @brief Field adaptiveSfx, offset 0x39, size 0x1
  __declspec(property(get = __cordl_internal_get_adaptiveSfx, put = __cordl_internal_set_adaptiveSfx)) bool adaptiveSfx;

  /// @brief Field advancedHud, offset 0x22, size 0x1
  __declspec(property(get = __cordl_internal_get_advancedHud, put = __cordl_internal_set_advancedHud)) bool advancedHud;

  /// @brief Field arcsHapticFeedback, offset 0x3a, size 0x1
  __declspec(property(get = __cordl_internal_get_arcsHapticFeedback, put = __cordl_internal_set_arcsHapticFeedback)) bool arcsHapticFeedback;

  /// @brief Field arcsVisibleSaveData, offset 0x3c, size 0x4
  __declspec(property(get = __cordl_internal_get_arcsVisibleSaveData,
                      put = __cordl_internal_set_arcsVisibleSaveData))::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData arcsVisibleSaveData;

  /// @brief Field autoRestart, offset 0x30, size 0x1
  __declspec(property(get = __cordl_internal_get_autoRestart, put = __cordl_internal_set_autoRestart)) bool autoRestart;

  /// @brief Field automaticPlayerHeight, offset 0x18, size 0x1
  __declspec(property(get = __cordl_internal_get_automaticPlayerHeight, put = __cordl_internal_set_automaticPlayerHeight)) bool automaticPlayerHeight;

  /// @brief Field environmentEffectsFilterDefaultPreset, offset 0x40, size 0x4
  __declspec(property(get = __cordl_internal_get_environmentEffectsFilterDefaultPreset,
                      put = __cordl_internal_set_environmentEffectsFilterDefaultPreset))::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData
      environmentEffectsFilterDefaultPreset;

  /// @brief Field environmentEffectsFilterExpertPlusPreset, offset 0x44, size 0x4
  __declspec(property(get = __cordl_internal_get_environmentEffectsFilterExpertPlusPreset,
                      put = __cordl_internal_set_environmentEffectsFilterExpertPlusPreset))::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData
      environmentEffectsFilterExpertPlusPreset;

  /// @brief Field headsetHapticIntensity, offset 0x48, size 0x4
  __declspec(property(get = __cordl_internal_get_headsetHapticIntensity, put = __cordl_internal_set_headsetHapticIntensity)) float_t headsetHapticIntensity;

  /// @brief Field hideNoteSpawnEffect, offset 0x38, size 0x1
  __declspec(property(get = __cordl_internal_get_hideNoteSpawnEffect, put = __cordl_internal_set_hideNoteSpawnEffect)) bool hideNoteSpawnEffect;

  /// @brief Field leftHanded, offset 0x11, size 0x1
  __declspec(property(get = __cordl_internal_get_leftHanded, put = __cordl_internal_set_leftHanded)) bool leftHanded;

  /// @brief Field noFailEffects, offset 0x31, size 0x1
  __declspec(property(get = __cordl_internal_get_noFailEffects, put = __cordl_internal_set_noFailEffects)) bool noFailEffects;

  /// @brief Field noTextsAndHuds, offset 0x21, size 0x1
  __declspec(property(get = __cordl_internal_get_noTextsAndHuds, put = __cordl_internal_set_noTextsAndHuds)) bool noTextsAndHuds;

  /// @brief Field noteJumpBeatOffset, offset 0x34, size 0x4
  __declspec(property(get = __cordl_internal_get_noteJumpBeatOffset, put = __cordl_internal_set_noteJumpBeatOffset)) float_t noteJumpBeatOffset;

  /// @brief Field noteJumpFixedDuration, offset 0x2c, size 0x4
  __declspec(property(get = __cordl_internal_get_noteJumpFixedDuration, put = __cordl_internal_set_noteJumpFixedDuration)) float_t noteJumpFixedDuration;

  /// @brief Field playerHeight, offset 0x14, size 0x4
  __declspec(property(get = __cordl_internal_get_playerHeight, put = __cordl_internal_set_playerHeight)) float_t playerHeight;

  /// @brief Field reduceDebris, offset 0x20, size 0x1
  __declspec(property(get = __cordl_internal_get_reduceDebris, put = __cordl_internal_set_reduceDebris)) bool reduceDebris;

  /// @brief Field saberTrailIntensity, offset 0x24, size 0x4
  __declspec(property(get = __cordl_internal_get_saberTrailIntensity, put = __cordl_internal_set_saberTrailIntensity)) float_t saberTrailIntensity;

  /// @brief Field sfxVolume, offset 0x1c, size 0x4
  __declspec(property(get = __cordl_internal_get_sfxVolume, put = __cordl_internal_set_sfxVolume)) float_t sfxVolume;

  /// @brief Field staticLights, offset 0x10, size 0x1
  __declspec(property(get = __cordl_internal_get_staticLights, put = __cordl_internal_set_staticLights)) bool staticLights;

  static inline ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings* New_ctor();

  constexpr ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData const& __cordl_internal_get__noteJumpDurationTypeSettingsSaveData() const;

  constexpr ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData& __cordl_internal_get__noteJumpDurationTypeSettingsSaveData();

  constexpr bool const& __cordl_internal_get_adaptiveSfx() const;

  constexpr bool& __cordl_internal_get_adaptiveSfx();

  constexpr bool const& __cordl_internal_get_advancedHud() const;

  constexpr bool& __cordl_internal_get_advancedHud();

  constexpr bool const& __cordl_internal_get_arcsHapticFeedback() const;

  constexpr bool& __cordl_internal_get_arcsHapticFeedback();

  constexpr ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData const& __cordl_internal_get_arcsVisibleSaveData() const;

  constexpr ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData& __cordl_internal_get_arcsVisibleSaveData();

  constexpr bool const& __cordl_internal_get_autoRestart() const;

  constexpr bool& __cordl_internal_get_autoRestart();

  constexpr bool const& __cordl_internal_get_automaticPlayerHeight() const;

  constexpr bool& __cordl_internal_get_automaticPlayerHeight();

  constexpr ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData const& __cordl_internal_get_environmentEffectsFilterDefaultPreset() const;

  constexpr ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData& __cordl_internal_get_environmentEffectsFilterDefaultPreset();

  constexpr ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData const& __cordl_internal_get_environmentEffectsFilterExpertPlusPreset() const;

  constexpr ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData& __cordl_internal_get_environmentEffectsFilterExpertPlusPreset();

  constexpr float_t const& __cordl_internal_get_headsetHapticIntensity() const;

  constexpr float_t& __cordl_internal_get_headsetHapticIntensity();

  constexpr bool const& __cordl_internal_get_hideNoteSpawnEffect() const;

  constexpr bool& __cordl_internal_get_hideNoteSpawnEffect();

  constexpr bool const& __cordl_internal_get_leftHanded() const;

  constexpr bool& __cordl_internal_get_leftHanded();

  constexpr bool const& __cordl_internal_get_noFailEffects() const;

  constexpr bool& __cordl_internal_get_noFailEffects();

  constexpr bool const& __cordl_internal_get_noTextsAndHuds() const;

  constexpr bool& __cordl_internal_get_noTextsAndHuds();

  constexpr float_t const& __cordl_internal_get_noteJumpBeatOffset() const;

  constexpr float_t& __cordl_internal_get_noteJumpBeatOffset();

  constexpr float_t const& __cordl_internal_get_noteJumpFixedDuration() const;

  constexpr float_t& __cordl_internal_get_noteJumpFixedDuration();

  constexpr float_t const& __cordl_internal_get_playerHeight() const;

  constexpr float_t& __cordl_internal_get_playerHeight();

  constexpr bool const& __cordl_internal_get_reduceDebris() const;

  constexpr bool& __cordl_internal_get_reduceDebris();

  constexpr float_t const& __cordl_internal_get_saberTrailIntensity() const;

  constexpr float_t& __cordl_internal_get_saberTrailIntensity();

  constexpr float_t const& __cordl_internal_get_sfxVolume() const;

  constexpr float_t& __cordl_internal_get_sfxVolume();

  constexpr bool const& __cordl_internal_get_staticLights() const;

  constexpr bool& __cordl_internal_get_staticLights();

  constexpr void __cordl_internal_set__noteJumpDurationTypeSettingsSaveData(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData value);

  constexpr void __cordl_internal_set_adaptiveSfx(bool value);

  constexpr void __cordl_internal_set_advancedHud(bool value);

  constexpr void __cordl_internal_set_arcsHapticFeedback(bool value);

  constexpr void __cordl_internal_set_arcsVisibleSaveData(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData value);

  constexpr void __cordl_internal_set_autoRestart(bool value);

  constexpr void __cordl_internal_set_automaticPlayerHeight(bool value);

  constexpr void __cordl_internal_set_environmentEffectsFilterDefaultPreset(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData value);

  constexpr void __cordl_internal_set_environmentEffectsFilterExpertPlusPreset(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData value);

  constexpr void __cordl_internal_set_headsetHapticIntensity(float_t value);

  constexpr void __cordl_internal_set_hideNoteSpawnEffect(bool value);

  constexpr void __cordl_internal_set_leftHanded(bool value);

  constexpr void __cordl_internal_set_noFailEffects(bool value);

  constexpr void __cordl_internal_set_noTextsAndHuds(bool value);

  constexpr void __cordl_internal_set_noteJumpBeatOffset(float_t value);

  constexpr void __cordl_internal_set_noteJumpFixedDuration(float_t value);

  constexpr void __cordl_internal_set_playerHeight(float_t value);

  constexpr void __cordl_internal_set_reduceDebris(bool value);

  constexpr void __cordl_internal_set_saberTrailIntensity(float_t value);

  constexpr void __cordl_internal_set_sfxVolume(float_t value);

  constexpr void __cordl_internal_set_staticLights(bool value);

  /// @brief Method .ctor, addr 0x14e69ac, size 0x38, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __PlayerSaveData__PlayerSpecificSettings();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__PlayerSaveData__PlayerSpecificSettings", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __PlayerSaveData__PlayerSpecificSettings(__PlayerSaveData__PlayerSpecificSettings&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__PlayerSaveData__PlayerSpecificSettings", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __PlayerSaveData__PlayerSpecificSettings(__PlayerSaveData__PlayerSpecificSettings const&) = delete;

  /// @brief Field staticLights, offset: 0x10, size: 0x1, def value: None
  bool ___staticLights;

  /// @brief Field leftHanded, offset: 0x11, size: 0x1, def value: None
  bool ___leftHanded;

  /// @brief Field playerHeight, offset: 0x14, size: 0x4, def value: None
  float_t ___playerHeight;

  /// @brief Field automaticPlayerHeight, offset: 0x18, size: 0x1, def value: None
  bool ___automaticPlayerHeight;

  /// @brief Field sfxVolume, offset: 0x1c, size: 0x4, def value: None
  float_t ___sfxVolume;

  /// @brief Field reduceDebris, offset: 0x20, size: 0x1, def value: None
  bool ___reduceDebris;

  /// @brief Field noTextsAndHuds, offset: 0x21, size: 0x1, def value: None
  bool ___noTextsAndHuds;

  /// @brief Field advancedHud, offset: 0x22, size: 0x1, def value: None
  bool ___advancedHud;

  /// @brief Field saberTrailIntensity, offset: 0x24, size: 0x4, def value: None
  float_t ___saberTrailIntensity;

  /// @brief Field _noteJumpDurationTypeSettingsSaveData, offset: 0x28, size: 0x4, def value: None
  ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__NoteJumpDurationTypeSettingsSaveData ____noteJumpDurationTypeSettingsSaveData;

  /// @brief Field noteJumpFixedDuration, offset: 0x2c, size: 0x4, def value: None
  float_t ___noteJumpFixedDuration;

  /// @brief Field autoRestart, offset: 0x30, size: 0x1, def value: None
  bool ___autoRestart;

  /// @brief Field noFailEffects, offset: 0x31, size: 0x1, def value: None
  bool ___noFailEffects;

  /// @brief Field noteJumpBeatOffset, offset: 0x34, size: 0x4, def value: None
  float_t ___noteJumpBeatOffset;

  /// @brief Field hideNoteSpawnEffect, offset: 0x38, size: 0x1, def value: None
  bool ___hideNoteSpawnEffect;

  /// @brief Field adaptiveSfx, offset: 0x39, size: 0x1, def value: None
  bool ___adaptiveSfx;

  /// @brief Field arcsHapticFeedback, offset: 0x3a, size: 0x1, def value: None
  bool ___arcsHapticFeedback;

  /// @brief Field arcsVisibleSaveData, offset: 0x3c, size: 0x4, def value: None
  ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__ArcVisibilityTypeSaveData ___arcsVisibleSaveData;

  /// @brief Field environmentEffectsFilterDefaultPreset, offset: 0x40, size: 0x4, def value: None
  ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData ___environmentEffectsFilterDefaultPreset;

  /// @brief Field environmentEffectsFilterExpertPlusPreset, offset: 0x44, size: 0x4, def value: None
  ::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings__EnvironmentEffectsFilterPresetSaveData ___environmentEffectsFilterExpertPlusPreset;

  /// @brief Field headsetHapticIntensity, offset: 0x48, size: 0x4, def value: None
  float_t ___headsetHapticIntensity;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, 0x50>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___staticLights) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___leftHanded) == 0x11, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___playerHeight) == 0x14, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___automaticPlayerHeight) == 0x18, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___sfxVolume) == 0x1c, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___reduceDebris) == 0x20, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___noTextsAndHuds) == 0x21, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___advancedHud) == 0x22, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___saberTrailIntensity) == 0x24, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ____noteJumpDurationTypeSettingsSaveData) == 0x28, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___noteJumpFixedDuration) == 0x2c, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___autoRestart) == 0x30, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___noFailEffects) == 0x31, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___noteJumpBeatOffset) == 0x34, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___hideNoteSpawnEffect) == 0x38, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___adaptiveSfx) == 0x39, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___arcsHapticFeedback) == 0x3a, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___arcsVisibleSaveData) == 0x3c, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___environmentEffectsFilterDefaultPreset) == 0x40, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___environmentEffectsFilterExpertPlusPreset) == 0x44, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerSpecificSettings, ___headsetHapticIntensity) == 0x48, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::PlayerAllOverallStatsData
// SizeInfo { instance_size: 48, native_size: -1, calculated_instance_size: 48, calculated_native_size: 48, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::PlayerSaveData::PlayerAllOverallStatsData*
class CORDL_TYPE __PlayerSaveData__PlayerAllOverallStatsData : public ::System::Object {
public:
  // Declarations
  /// @brief Field campaignOverallStatsData, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_campaignOverallStatsData,
                      put = __cordl_internal_set_campaignOverallStatsData))::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* campaignOverallStatsData;

  /// @brief Field onlinePlayOverallStatsData, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_onlinePlayOverallStatsData,
                      put = __cordl_internal_set_onlinePlayOverallStatsData))::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* onlinePlayOverallStatsData;

  /// @brief Field partyFreePlayOverallStatsData, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_partyFreePlayOverallStatsData,
                      put = __cordl_internal_set_partyFreePlayOverallStatsData))::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* partyFreePlayOverallStatsData;

  /// @brief Field soloFreePlayOverallStatsData, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_soloFreePlayOverallStatsData,
                      put = __cordl_internal_set_soloFreePlayOverallStatsData))::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* soloFreePlayOverallStatsData;

  static inline ::GlobalNamespace::__PlayerSaveData__PlayerAllOverallStatsData* New_ctor();

  static inline ::GlobalNamespace::__PlayerSaveData__PlayerAllOverallStatsData* New_ctor(::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* campaignOverallStatsData,
                                                                                         ::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* soloFreePlayOverallStatsData,
                                                                                         ::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* partyFreePlayOverallStatsData,
                                                                                         ::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* onlinePlayOverallStatsData);

  constexpr ::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData*& __cordl_internal_get_campaignOverallStatsData();

  constexpr ::cordl_internals::to_const_pointer<::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData*> const& __cordl_internal_get_campaignOverallStatsData() const;

  constexpr ::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData*& __cordl_internal_get_onlinePlayOverallStatsData();

  constexpr ::cordl_internals::to_const_pointer<::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData*> const& __cordl_internal_get_onlinePlayOverallStatsData() const;

  constexpr ::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData*& __cordl_internal_get_partyFreePlayOverallStatsData();

  constexpr ::cordl_internals::to_const_pointer<::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData*> const& __cordl_internal_get_partyFreePlayOverallStatsData() const;

  constexpr ::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData*& __cordl_internal_get_soloFreePlayOverallStatsData();

  constexpr ::cordl_internals::to_const_pointer<::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData*> const& __cordl_internal_get_soloFreePlayOverallStatsData() const;

  constexpr void __cordl_internal_set_campaignOverallStatsData(::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* value);

  constexpr void __cordl_internal_set_onlinePlayOverallStatsData(::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* value);

  constexpr void __cordl_internal_set_partyFreePlayOverallStatsData(::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* value);

  constexpr void __cordl_internal_set_soloFreePlayOverallStatsData(::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* value);

  /// @brief Method .ctor, addr 0x14ea398, size 0xc0, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method .ctor, addr 0x14ea544, size 0x40, virtual false, abstract: false, final false
  inline void _ctor(::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* campaignOverallStatsData, ::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* soloFreePlayOverallStatsData,
                    ::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* partyFreePlayOverallStatsData,
                    ::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* onlinePlayOverallStatsData);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __PlayerSaveData__PlayerAllOverallStatsData();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__PlayerSaveData__PlayerAllOverallStatsData", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __PlayerSaveData__PlayerAllOverallStatsData(__PlayerSaveData__PlayerAllOverallStatsData&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__PlayerSaveData__PlayerAllOverallStatsData", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __PlayerSaveData__PlayerAllOverallStatsData(__PlayerSaveData__PlayerAllOverallStatsData const&) = delete;

  /// @brief Field campaignOverallStatsData, offset: 0x10, size: 0x8, def value: None
  ::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* ___campaignOverallStatsData;

  /// @brief Field soloFreePlayOverallStatsData, offset: 0x18, size: 0x8, def value: None
  ::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* ___soloFreePlayOverallStatsData;

  /// @brief Field partyFreePlayOverallStatsData, offset: 0x20, size: 0x8, def value: None
  ::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* ___partyFreePlayOverallStatsData;

  /// @brief Field onlinePlayOverallStatsData, offset: 0x28, size: 0x8, def value: None
  ::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* ___onlinePlayOverallStatsData;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__PlayerSaveData__PlayerAllOverallStatsData, 0x30>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerAllOverallStatsData, ___campaignOverallStatsData) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerAllOverallStatsData, ___soloFreePlayOverallStatsData) == 0x18, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerAllOverallStatsData, ___partyFreePlayOverallStatsData) == 0x20, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__PlayerSaveData__PlayerAllOverallStatsData, ___onlinePlayOverallStatsData) == 0x28, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::PlayerOverallStatsData
// SizeInfo { instance_size: 72, native_size: -1, calculated_instance_size: 72, calculated_native_size: 72, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::PlayerSaveData::PlayerOverallStatsData*
class CORDL_TYPE __PlayerSaveData__PlayerOverallStatsData : public ::System::Object {
public:
  // Declarations
  /// @brief Field badCutsCount, offset 0x14, size 0x4
  __declspec(property(get = __cordl_internal_get_badCutsCount, put = __cordl_internal_set_badCutsCount)) int32_t badCutsCount;

  /// @brief Field cleardLevelsCount, offset 0x2c, size 0x4
  __declspec(property(get = __cordl_internal_get_cleardLevelsCount, put = __cordl_internal_set_cleardLevelsCount)) int32_t cleardLevelsCount;

  /// @brief Field cummulativeCutScoreWithoutMultiplier, offset 0x40, size 0x8
  __declspec(property(get = __cordl_internal_get_cummulativeCutScoreWithoutMultiplier, put = __cordl_internal_set_cummulativeCutScoreWithoutMultiplier)) int64_t cummulativeCutScoreWithoutMultiplier;

  /// @brief Field failedLevelsCount, offset 0x30, size 0x4
  __declspec(property(get = __cordl_internal_get_failedLevelsCount, put = __cordl_internal_set_failedLevelsCount)) int32_t failedLevelsCount;

  /// @brief Field fullComboCount, offset 0x34, size 0x4
  __declspec(property(get = __cordl_internal_get_fullComboCount, put = __cordl_internal_set_fullComboCount)) int32_t fullComboCount;

  /// @brief Field goodCutsCount, offset 0x10, size 0x4
  __declspec(property(get = __cordl_internal_get_goodCutsCount, put = __cordl_internal_set_goodCutsCount)) int32_t goodCutsCount;

  /// @brief Field handDistanceTravelled, offset 0x3c, size 0x4
  __declspec(property(get = __cordl_internal_get_handDistanceTravelled, put = __cordl_internal_set_handDistanceTravelled)) int32_t handDistanceTravelled;

  /// @brief Field missedCutsCount, offset 0x18, size 0x4
  __declspec(property(get = __cordl_internal_get_missedCutsCount, put = __cordl_internal_set_missedCutsCount)) int32_t missedCutsCount;

  /// @brief Field playedLevelsCount, offset 0x28, size 0x4
  __declspec(property(get = __cordl_internal_get_playedLevelsCount, put = __cordl_internal_set_playedLevelsCount)) int32_t playedLevelsCount;

  /// @brief Field timePlayed, offset 0x38, size 0x4
  __declspec(property(get = __cordl_internal_get_timePlayed, put = __cordl_internal_set_timePlayed)) float_t timePlayed;

  /// @brief Field totalScore, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_totalScore, put = __cordl_internal_set_totalScore)) int64_t totalScore;

  static inline ::GlobalNamespace::__PlayerSaveData__PlayerOverallStatsData* New_ctor();

