#pragma once
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "GlobalNamespace/zzzz__DisconnectedReason_def.hpp"
#include "GlobalNamespace/zzzz__EncryptionUtility_def.hpp"
#include "GlobalNamespace/zzzz__MultiplayerAvatarsData_def.hpp"
#include "GlobalNamespace/zzzz__PlayerStateHash_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__AsyncVoidMethodBuilder_def.hpp"
#include "System/Runtime/CompilerServices/zzzz__TaskAwaiter_1_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(ConnectedPlayerManager)
namespace BGNet::Core {
struct DeliveryMethod;
}
namespace BGNet::Core {
class ITaskUtility;
}
namespace BGNet::Core {
class ITimeProvider;
}
namespace GlobalNamespace {
class ByteArrayNetSerializable;
}
namespace GlobalNamespace {
struct ConnectionFailedReason;
}
namespace GlobalNamespace {
struct DisconnectedReason;
}
namespace GlobalNamespace {
class IConnectedPlayer;
}
namespace GlobalNamespace {
class IConnectionManager;
}
namespace GlobalNamespace {
class IConnection;
}
namespace GlobalNamespace {
class IDiffieHellmanKeyPair;
}
namespace GlobalNamespace {
template <typename TData> class INetworkPacketSubSerializer_1;
}
namespace GlobalNamespace {
class IPoolablePacket;
}
namespace GlobalNamespace {
class LongRollingAverage;

namespace System::Runtime::CompilerServices {
template <typename TResult> struct TaskAwaiter_1;
}
namespace System {
template <typename T> class Action_1;
}
namespace System {
class Action;
}
namespace System {
class IDisposable;
}
// Forward declare root types
namespace GlobalNamespace {
struct __ConnectedPlayerManager__InternalMessageType;
}
namespace GlobalNamespace {
struct __ConnectedPlayerManager__MessageType;
}
namespace GlobalNamespace {
class ConnectedPlayerManager;
}
namespace GlobalNamespace {
class __ConnectedPlayerManager__ConnectedPlayer;
}
namespace GlobalNamespace {
class __ConnectedPlayerManager__KickPlayerPacket;
}
namespace GlobalNamespace {
class __ConnectedPlayerManager__PingPacket;
}
namespace GlobalNamespace {
class __ConnectedPlayerManager__PlayerAvatarPacket;
}
namespace GlobalNamespace {
class __ConnectedPlayerManager__PlayerConnectedPacket;
}
namespace GlobalNamespace {
class __ConnectedPlayerManager__PlayerDisconnectedPacket;
}
namespace GlobalNamespace {
class __ConnectedPlayerManager__PlayerIdentityPacket;
}
namespace GlobalNamespace {
class __ConnectedPlayerManager__PlayerSortOrderPacket;
}
namespace GlobalNamespace {
class __ConnectedPlayerManager__PlayerStatePacket;
}
namespace GlobalNamespace {
class __ConnectedPlayerManager__PongPacket;
}
namespace GlobalNamespace {
class __ConnectedPlayerManager__SyncTimePacket;
}
namespace GlobalNamespace {
struct __ConnectedPlayerManager___InitializePlayerEncryption_d__132;
}
// Write type traits
MARK_VAL_T(::GlobalNamespace::__ConnectedPlayerManager__InternalMessageType);
MARK_VAL_T(::GlobalNamespace::__ConnectedPlayerManager__MessageType);
MARK_REF_PTR_T(::GlobalNamespace::ConnectedPlayerManager);
MARK_REF_PTR_T(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer);
MARK_REF_PTR_T(::GlobalNamespace::__ConnectedPlayerManager__KickPlayerPacket);
MARK_REF_PTR_T(::GlobalNamespace::__ConnectedPlayerManager__PingPacket);
MARK_REF_PTR_T(::GlobalNamespace::__ConnectedPlayerManager__PlayerAvatarPacket);
MARK_REF_PTR_T(::GlobalNamespace::__ConnectedPlayerManager__PlayerConnectedPacket);
MARK_REF_PTR_T(::GlobalNamespace::__ConnectedPlayerManager__PlayerDisconnectedPacket);
MARK_REF_PTR_T(::GlobalNamespace::__ConnectedPlayerManager__PlayerIdentityPacket);
MARK_REF_PTR_T(::GlobalNamespace::__ConnectedPlayerManager__PlayerSortOrderPacket);
MARK_REF_PTR_T(::GlobalNamespace::__ConnectedPlayerManager__PlayerStatePacket);
MARK_REF_PTR_T(::GlobalNamespace::__ConnectedPlayerManager__PongPacket);
MARK_REF_PTR_T(::GlobalNamespace::__ConnectedPlayerManager__SyncTimePacket);
MARK_VAL_T(::GlobalNamespace::__ConnectedPlayerManager___InitializePlayerEncryption_d__132);
// Type: ::ConnectedPlayer
// SizeInfo { instance_size: 160, native_size: -1, calculated_instance_size: 160, calculated_native_size: 160, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::ConnectedPlayerManager::ConnectedPlayer*
class CORDL_TYPE __ConnectedPlayerManager__ConnectedPlayer : public ::System::Object {
public:
  // Declarations
  /// @brief Field _connection, offset 0x30, size 0x8
  __declspec(property(get = __cordl_internal_get__connection, put = __cordl_internal_set__connection))::GlobalNamespace::IConnection* _connection;

  /// @brief Field _connectionId, offset 0x40, size 0x1
  __declspec(property(get = __cordl_internal_get__connectionId, put = __cordl_internal_set__connectionId)) uint8_t _connectionId;

  /// @brief Field _disconnectedReason, offset 0x4c, size 0x4
  __declspec(property(get = __cordl_internal_get__disconnectedReason, put = __cordl_internal_set__disconnectedReason))::GlobalNamespace::DisconnectedReason _disconnectedReason;

  /// @brief Field _encryptionState, offset 0x90, size 0x8
  __declspec(property(get = __cordl_internal_get__encryptionState, put = __cordl_internal_set__encryptionState))::GlobalNamespace::__EncryptionUtility__IEncryptionState* _encryptionState;

  /// @brief Field _isConnected, offset 0x48, size 0x1
  __declspec(property(get = __cordl_internal_get__isConnected, put = __cordl_internal_set__isConnected)) bool _isConnected;

  /// @brief Field _isConnectionOwner, offset 0x21, size 0x1
  __declspec(property(get = __cordl_internal_get__isConnectionOwner, put = __cordl_internal_set__isConnectionOwner)) bool _isConnectionOwner;

  /// @brief Field _isKicked, offset 0x50, size 0x1
  __declspec(property(get = __cordl_internal_get__isKicked, put = __cordl_internal_set__isKicked)) bool _isKicked;

  /// @brief Field _isMe, offset 0x20, size 0x1
  __declspec(property(get = __cordl_internal_get__isMe, put = __cordl_internal_set__isMe)) bool _isMe;

  /// @brief Field _latency, offset 0x98, size 0x8
  __declspec(property(get = __cordl_internal_get__latency, put = __cordl_internal_set__latency))::GlobalNamespace::LongRollingAverage* _latency;

  /// @brief Field _manager, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get__manager, put = __cordl_internal_set__manager))::GlobalNamespace::ConnectedPlayerManager* _manager;

  /// @brief Field _parent, offset 0x38, size 0x8
  __declspec(property(get = __cordl_internal_get__parent, put = __cordl_internal_set__parent))::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer* _parent;

  /// @brief Field _playerAvatars, offset 0x68, size 0x18
  __declspec(property(get = __cordl_internal_get__playerAvatars, put = __cordl_internal_set__playerAvatars))::GlobalNamespace::MultiplayerAvatarsData _playerAvatars;

  /// @brief Field _playerState, offset 0x58, size 0x10
  __declspec(property(get = __cordl_internal_get__playerState, put = __cordl_internal_set__playerState))::GlobalNamespace::PlayerStateHash _playerState;

  /// @brief Field _publicEncryptionKey, offset 0x80, size 0x8
  __declspec(property(get = __cordl_internal_get__publicEncryptionKey, put = __cordl_internal_set__publicEncryptionKey))::ArrayW<uint8_t, ::Array<uint8_t>*> _publicEncryptionKey;

  /// @brief Field _random, offset 0x88, size 0x8
  __declspec(property(get = __cordl_internal_get__random, put = __cordl_internal_set__random))::ArrayW<uint8_t, ::Array<uint8_t>*> _random;

  /// @brief Field _remoteConnectionId, offset 0x41, size 0x1
  __declspec(property(get = __cordl_internal_get__remoteConnectionId, put = __cordl_internal_set__remoteConnectionId)) uint8_t _remoteConnectionId;

  /// @brief Field _sortIndex, offset 0x44, size 0x4
  __declspec(property(get = __cordl_internal_get__sortIndex, put = __cordl_internal_set__sortIndex)) int32_t _sortIndex;

  /// @brief Field _userId, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get__userId, put = __cordl_internal_set__userId))::StringW _userId;

  /// @brief Field _userName, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get__userName, put = __cordl_internal_set__userName))::StringW _userName;

  __declspec(property(get = get_connection))::GlobalNamespace::IConnection* connection;

  __declspec(property(get = get_connectionId)) uint8_t connectionId;

  __declspec(property(get = get_currentLatency)) int64_t currentLatency;

  __declspec(property(get = get_disconnectedReason))::GlobalNamespace::DisconnectedReason disconnectedReason;

  __declspec(property(get = get_encryptionState))::GlobalNamespace::__EncryptionUtility__IEncryptionState* encryptionState;

  __declspec(property(get = get_hasValidLatency)) bool hasValidLatency;

  __declspec(property(get = get_isConnected)) bool isConnected;

  __declspec(property(get = get_isConnectionOwner)) bool isConnectionOwner;

  __declspec(property(get = get_isDirectConnection)) bool isDirectConnection;

  __declspec(property(get = get_isKicked)) bool isKicked;

  __declspec(property(get = get_isMe)) bool isMe;

  __declspec(property(get = get_multiplayerAvatarsData, put = set_multiplayerAvatarsData))::GlobalNamespace::MultiplayerAvatarsData multiplayerAvatarsData;

  __declspec(property(get = get_offsetSyncTime)) int64_t offsetSyncTime;

  __declspec(property(get = get_publicEncryptionKey))::ArrayW<uint8_t, ::Array<uint8_t>*> publicEncryptionKey;

  __declspec(property(get = get_random))::ArrayW<uint8_t, ::Array<uint8_t>*> random;

  __declspec(property(get = get_remoteConnectionId)) uint8_t remoteConnectionId;

  __declspec(property(get = get_sortIndex)) int32_t sortIndex;

  __declspec(property(get = get_userId))::StringW userId;

  __declspec(property(get = get_userName))::StringW userName;

  /// @brief Convert operator to "::GlobalNamespace::IConnectedPlayer"
  constexpr operator ::GlobalNamespace::IConnectedPlayer*() noexcept;

  /// @brief Method CreateDirectlyConnectedPlayer, addr 0xe9ff68, size 0x1e0, virtual false, abstract: false, final false
  static inline ::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer* CreateDirectlyConnectedPlayer(::GlobalNamespace::ConnectedPlayerManager* manager, uint8_t connectionId,
                                                                                                            ::GlobalNamespace::IConnection* connection);

  /// @brief Method CreateLocalPlayer, addr 0xe9fe40, size 0xc0, virtual false, abstract: false, final false
  static inline ::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer* CreateLocalPlayer(::GlobalNamespace::ConnectedPlayerManager* manager, ::StringW userId, ::StringW userName,
                                                                                                bool isConnectionOwner, ::ArrayW<uint8_t, ::Array<uint8_t>*> publicEncryptionKey,
                                                                                                ::ArrayW<uint8_t, ::Array<uint8_t>*> random);

  /// @brief Method CreateRemoteConnectedPlayer, addr 0xea0c4c, size 0xd0, virtual false, abstract: false, final false
  static inline ::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer* CreateRemoteConnectedPlayer(::GlobalNamespace::ConnectedPlayerManager* manager, uint8_t connectionId,
                                                                                                          ::GlobalNamespace::__ConnectedPlayerManager__PlayerConnectedPacket* packet,
                                                                                                          ::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer* parent);

  /// @brief Method Disconnect, addr 0xe9ba94, size 0x148, virtual false, abstract: false, final false
  inline void Disconnect(::GlobalNamespace::DisconnectedReason disconnectedReason);

  /// @brief Method GetPlayerAvatarPacket, addr 0xe9fc38, size 0x80, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__ConnectedPlayerManager__PlayerAvatarPacket* GetPlayerAvatarPacket();

  /// @brief Method GetPlayerConnectedPacket, addr 0xe9c1c0, size 0x70, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__ConnectedPlayerManager__PlayerConnectedPacket* GetPlayerConnectedPacket();

  /// @brief Method GetPlayerIdentityPacket, addr 0xe9c47c, size 0x90, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__ConnectedPlayerManager__PlayerIdentityPacket* GetPlayerIdentityPacket();

  /// @brief Method GetPlayerSortOrderPacket, addr 0xe9c414, size 0x68, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__ConnectedPlayerManager__PlayerSortOrderPacket* GetPlayerSortOrderPacket();

  /// @brief Method GetPlayerStatePacket, addr 0xe9fb44, size 0x60, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__ConnectedPlayerManager__PlayerStatePacket* GetPlayerStatePacket();

  /// @brief Method HasState, addr 0xea1e98, size 0xc, virtual true, abstract: false, final true
  inline bool HasState(::StringW state);

  static inline ::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer* New_ctor(::GlobalNamespace::ConnectedPlayerManager* manager, uint8_t connectionId, uint8_t remoteConnectionId,
                                                                                       ::GlobalNamespace::IConnection* connection, ::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer* parent,
                                                                                       ::StringW userId, ::StringW userName, bool isConnectionOwner, bool isMe,
                                                                                       ::ArrayW<uint8_t, ::Array<uint8_t>*> publicEncryptionKey, ::ArrayW<uint8_t, ::Array<uint8_t>*> random);

  /// @brief Method SetEncryptionState, addr 0xea1e90, size 0x8, virtual false, abstract: false, final false
  inline void SetEncryptionState(::GlobalNamespace::__EncryptionUtility__IEncryptionState* encryptionState);

  /// @brief Method SetKicked, addr 0xe9fa58, size 0xc, virtual false, abstract: false, final false
  inline void SetKicked();

  /// @brief Method SetPlayerState, addr 0xea1ea4, size 0x8, virtual false, abstract: false, final false
  inline void SetPlayerState(::GlobalNamespace::PlayerStateHash playerState);

  /// @brief Method ToString, addr 0xea1eac, size 0x17c, virtual true, abstract: false, final false
  inline ::StringW ToString();

  /// @brief Method UpdateAvatar, addr 0xea114c, size 0x24, virtual false, abstract: false, final false
  inline void UpdateAvatar(::GlobalNamespace::__ConnectedPlayerManager__PlayerAvatarPacket* packet);

  /// @brief Method UpdateIdentity, addr 0xea0ea4, size 0x64, virtual false, abstract: false, final false
  inline void UpdateIdentity(::GlobalNamespace::__ConnectedPlayerManager__PlayerIdentityPacket* packet);

  /// @brief Method UpdateLatency, addr 0xea1ad4, size 0x1c, virtual false, abstract: false, final false
  inline void UpdateLatency(int64_t latency);

  /// @brief Method UpdateSortIndex, addr 0xe9fda0, size 0x20, virtual false, abstract: false, final false
  inline bool UpdateSortIndex(int32_t index);

  /// @brief Method UpdateState, addr 0xea1068, size 0x1c, virtual false, abstract: false, final false
  inline void UpdateState(::GlobalNamespace::__ConnectedPlayerManager__PlayerStatePacket* packet);

  constexpr ::GlobalNamespace::IConnection*& __cordl_internal_get__connection();

  constexpr ::cordl_internals::to_const_pointer<::GlobalNamespace::IConnection*> const& __cordl_internal_get__connection() const;

  constexpr uint8_t const& __cordl_internal_get__connectionId() const;

  constexpr uint8_t& __cordl_internal_get__connectionId();

  constexpr ::GlobalNamespace::DisconnectedReason const& __cordl_internal_get__disconnectedReason() const;

  constexpr ::GlobalNamespace::DisconnectedReason& __cordl_internal_get__disconnectedReason();

  constexpr ::GlobalNamespace::__EncryptionUtility__IEncryptionState*& __cordl_internal_get__encryptionState();

  constexpr ::cordl_internals::to_const_pointer<::GlobalNamespace::__EncryptionUtility__IEncryptionState*> const& __cordl_internal_get__encryptionState() const;

  constexpr bool const& __cordl_internal_get__isConnected() const;

  constexpr bool& __cordl_internal_get__isConnected();

  constexpr bool const& __cordl_internal_get__isConnectionOwner() const;

  constexpr bool& __cordl_internal_get__isConnectionOwner();

  constexpr bool const& __cordl_internal_get__isKicked() const;

  constexpr bool& __cordl_internal_get__isKicked();

  constexpr bool const& __cordl_internal_get__isMe() const;

  constexpr bool& __cordl_internal_get__isMe();

  constexpr ::GlobalNamespace::LongRollingAverage*& __cordl_internal_get__latency();

  constexpr ::cordl_internals::to_const_pointer<::GlobalNamespace::LongRollingAverage*> const& __cordl_internal_get__latency() const;

  constexpr ::GlobalNamespace::ConnectedPlayerManager*& __cordl_internal_get__manager();

  constexpr ::cordl_internals::to_const_pointer<::GlobalNamespace::ConnectedPlayerManager*> const& __cordl_internal_get__manager() const;

  constexpr ::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer*& __cordl_internal_get__parent();

  constexpr ::cordl_internals::to_const_pointer<::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer*> const& __cordl_internal_get__parent() const;

  constexpr ::GlobalNamespace::MultiplayerAvatarsData const& __cordl_internal_get__playerAvatars() const;

  constexpr ::GlobalNamespace::MultiplayerAvatarsData& __cordl_internal_get__playerAvatars();

  constexpr ::GlobalNamespace::PlayerStateHash const& __cordl_internal_get__playerState() const;

  constexpr ::GlobalNamespace::PlayerStateHash& __cordl_internal_get__playerState();

  constexpr ::ArrayW<uint8_t, ::Array<uint8_t>*> const& __cordl_internal_get__publicEncryptionKey() const;

  constexpr ::ArrayW<uint8_t, ::Array<uint8_t>*>& __cordl_internal_get__publicEncryptionKey();

  constexpr ::ArrayW<uint8_t, ::Array<uint8_t>*> const& __cordl_internal_get__random() const;

  constexpr ::ArrayW<uint8_t, ::Array<uint8_t>*>& __cordl_internal_get__random();

  constexpr uint8_t const& __cordl_internal_get__remoteConnectionId() const;

  constexpr uint8_t& __cordl_internal_get__remoteConnectionId();

  constexpr int32_t const& __cordl_internal_get__sortIndex() const;

  constexpr int32_t& __cordl_internal_get__sortIndex();

  constexpr ::StringW const& __cordl_internal_get__userId() const;

  constexpr ::StringW& __cordl_internal_get__userId();

  constexpr ::StringW const& __cordl_internal_get__userName() const;

  constexpr ::StringW& __cordl_internal_get__userName();

  constexpr void __cordl_internal_set__connection(::GlobalNamespace::IConnection* value);

  constexpr void __cordl_internal_set__connectionId(uint8_t value);

  constexpr void __cordl_internal_set__disconnectedReason(::GlobalNamespace::DisconnectedReason value);

  constexpr void __cordl_internal_set__encryptionState(::GlobalNamespace::__EncryptionUtility__IEncryptionState* value);

  constexpr void __cordl_internal_set__isConnected(bool value);

  constexpr void __cordl_internal_set__isConnectionOwner(bool value);

  constexpr void __cordl_internal_set__isKicked(bool value);

  constexpr void __cordl_internal_set__isMe(bool value);

  constexpr void __cordl_internal_set__latency(::GlobalNamespace::LongRollingAverage* value);

  constexpr void __cordl_internal_set__manager(::GlobalNamespace::ConnectedPlayerManager* value);

  constexpr void __cordl_internal_set__parent(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer* value);

  constexpr void __cordl_internal_set__playerAvatars(::GlobalNamespace::MultiplayerAvatarsData value);

  constexpr void __cordl_internal_set__playerState(::GlobalNamespace::PlayerStateHash value);

  constexpr void __cordl_internal_set__publicEncryptionKey(::ArrayW<uint8_t, ::Array<uint8_t>*> value);

  constexpr void __cordl_internal_set__random(::ArrayW<uint8_t, ::Array<uint8_t>*> value);

  constexpr void __cordl_internal_set__remoteConnectionId(uint8_t value);

  constexpr void __cordl_internal_set__sortIndex(int32_t value);

  constexpr void __cordl_internal_set__userId(::StringW value);

  constexpr void __cordl_internal_set__userName(::StringW value);

  /// @brief Method .ctor, addr 0xea1cfc, size 0x100, virtual false, abstract: false, final false
  inline void _ctor(::GlobalNamespace::ConnectedPlayerManager* manager, uint8_t connectionId, uint8_t remoteConnectionId, ::GlobalNamespace::IConnection* connection,
                    ::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer* parent, ::StringW userId, ::StringW userName, bool isConnectionOwner, bool isMe,
                    ::ArrayW<uint8_t, ::Array<uint8_t>*> publicEncryptionKey, ::ArrayW<uint8_t, ::Array<uint8_t>*> random);

  /// @brief Method get_connection, addr 0xea1b7c, size 0x8, virtual false, abstract: false, final false
  inline ::GlobalNamespace::IConnection* get_connection();

  /// @brief Method get_connectionId, addr 0xea1b84, size 0x8, virtual false, abstract: false, final false
  inline uint8_t get_connectionId();

  /// @brief Method get_currentLatency, addr 0xea1c04, size 0x6c, virtual true, abstract: false, final true
  inline int64_t get_currentLatency();

  /// @brief Method get_disconnectedReason, addr 0xea1bac, size 0x8, virtual true, abstract: false, final true
  inline ::GlobalNamespace::DisconnectedReason get_disconnectedReason();

  /// @brief Method get_encryptionState, addr 0xea1cf4, size 0x8, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__EncryptionUtility__IEncryptionState* get_encryptionState();

  /// @brief Method get_hasValidLatency, addr 0xea1bd4, size 0x30, virtual true, abstract: false, final true
  inline bool get_hasValidLatency();

  /// @brief Method get_isConnected, addr 0xea1b94, size 0x8, virtual true, abstract: false, final true
  inline bool get_isConnected();

  /// @brief Method get_isConnectionOwner, addr 0xea1b9c, size 0x8, virtual true, abstract: false, final true
  inline bool get_isConnectionOwner();

  /// @brief Method get_isDirectConnection, addr 0xe9c324, size 0x10, virtual false, abstract: false, final false
  inline bool get_isDirectConnection();

  /// @brief Method get_isKicked, addr 0xea1ba4, size 0x8, virtual true, abstract: false, final true
  inline bool get_isKicked();

  /// @brief Method get_isMe, addr 0xea1bcc, size 0x8, virtual true, abstract: false, final true
  inline bool get_isMe();

  /// @brief Method get_multiplayerAvatarsData, addr 0xea1cbc, size 0x14, virtual true, abstract: false, final true
  inline ::GlobalNamespace::MultiplayerAvatarsData get_multiplayerAvatarsData();

  /// @brief Method get_offsetSyncTime, addr 0xea1c70, size 0x4c, virtual true, abstract: false, final true
  inline int64_t get_offsetSyncTime();

  /// @brief Method get_publicEncryptionKey, addr 0xea1ce4, size 0x8, virtual false, abstract: false, final false
  inline ::ArrayW<uint8_t, ::Array<uint8_t>*> get_publicEncryptionKey();

  /// @brief Method get_random, addr 0xea1cec, size 0x8, virtual false, abstract: false, final false
  inline ::ArrayW<uint8_t, ::Array<uint8_t>*> get_random();

  /// @brief Method get_remoteConnectionId, addr 0xea1b8c, size 0x8, virtual false, abstract: false, final false
  inline uint8_t get_remoteConnectionId();

  /// @brief Method get_sortIndex, addr 0xea1bb4, size 0x8, virtual true, abstract: false, final true
  inline int32_t get_sortIndex();

  /// @brief Method get_userId, addr 0xea1bbc, size 0x8, virtual true, abstract: false, final true
  inline ::StringW get_userId();

  /// @brief Method get_userName, addr 0xea1bc4, size 0x8, virtual true, abstract: false, final true
  inline ::StringW get_userName();

  /// @brief Convert to "::GlobalNamespace::IConnectedPlayer"
  constexpr ::GlobalNamespace::IConnectedPlayer* i___GlobalNamespace__IConnectedPlayer() noexcept;

  /// @brief Method set_multiplayerAvatarsData, addr 0xea1cd0, size 0x14, virtual false, abstract: false, final false
  inline void set_multiplayerAvatarsData(::GlobalNamespace::MultiplayerAvatarsData value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __ConnectedPlayerManager__ConnectedPlayer();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__ConnectedPlayerManager__ConnectedPlayer", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __ConnectedPlayerManager__ConnectedPlayer(__ConnectedPlayerManager__ConnectedPlayer&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__ConnectedPlayerManager__ConnectedPlayer", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __ConnectedPlayerManager__ConnectedPlayer(__ConnectedPlayerManager__ConnectedPlayer const&) = delete;

  /// @brief Field _userId, offset: 0x10, size: 0x8, def value: None
  ::StringW ____userId;

  /// @brief Field _userName, offset: 0x18, size: 0x8, def value: None
  ::StringW ____userName;

  /// @brief Field _isMe, offset: 0x20, size: 0x1, def value: None
  bool ____isMe;

  /// @brief Field _isConnectionOwner, offset: 0x21, size: 0x1, def value: None
  bool ____isConnectionOwner;

  /// @brief Field _manager, offset: 0x28, size: 0x8, def value: None
  ::GlobalNamespace::ConnectedPlayerManager* ____manager;

  /// @brief Field _connection, offset: 0x30, size: 0x8, def value: None
  ::GlobalNamespace::IConnection* ____connection;

  /// @brief Field _parent, offset: 0x38, size: 0x8, def value: None
  ::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer* ____parent;

  /// @brief Field _connectionId, offset: 0x40, size: 0x1, def value: None
  uint8_t ____connectionId;

  /// @brief Field _remoteConnectionId, offset: 0x41, size: 0x1, def value: None
  uint8_t ____remoteConnectionId;

  /// @brief Field _sortIndex, offset: 0x44, size: 0x4, def value: None
  int32_t ____sortIndex;

  /// @brief Field _isConnected, offset: 0x48, size: 0x1, def value: None
  bool ____isConnected;

  /// @brief Field _disconnectedReason, offset: 0x4c, size: 0x4, def value: None
  ::GlobalNamespace::DisconnectedReason ____disconnectedReason;

  /// @brief Field _isKicked, offset: 0x50, size: 0x1, def value: None
  bool ____isKicked;

  /// @brief Field _playerState, offset: 0x58, size: 0x10, def value: None
  ::GlobalNamespace::PlayerStateHash ____playerState;

  /// @brief Field _playerAvatars, offset: 0x68, size: 0x18, def value: None
  ::GlobalNamespace::MultiplayerAvatarsData ____playerAvatars;

  /// @brief Field _publicEncryptionKey, offset: 0x80, size: 0x8, def value: None
  ::ArrayW<uint8_t, ::Array<uint8_t>*> ____publicEncryptionKey;

  /// @brief Field _random, offset: 0x88, size: 0x8, def value: None
  ::ArrayW<uint8_t, ::Array<uint8_t>*> ____random;

  /// @brief Field _encryptionState, offset: 0x90, size: 0x8, def value: None
  ::GlobalNamespace::__EncryptionUtility__IEncryptionState* ____encryptionState;

  /// @brief Field _latency, offset: 0x98, size: 0x8, def value: None
  ::GlobalNamespace::LongRollingAverage* ____latency;

  /// @brief Field kFixedSyncTimeOffset offset 0xffffffff size 0x8
  static constexpr int64_t kFixedSyncTimeOffset{ static_cast<int64_t>(0x21) };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, 0xa0>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____userId) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____userName) == 0x18, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____isMe) == 0x20, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____isConnectionOwner) == 0x21, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____manager) == 0x28, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____connection) == 0x30, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____parent) == 0x38, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____connectionId) == 0x40, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____remoteConnectionId) == 0x41, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____sortIndex) == 0x44, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____isConnected) == 0x48, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____disconnectedReason) == 0x4c, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____isKicked) == 0x50, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____playerState) == 0x58, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____playerAvatars) == 0x68, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____publicEncryptionKey) == 0x80, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____random) == 0x88, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____encryptionState) == 0x90, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__ConnectedPlayer, ____latency) == 0x98, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::InternalMessageType
// SizeInfo { instance_size: 1, native_size: 1, calculated_instance_size: 1, calculated_native_size: 17, minimum_alignment: 1, natural_alignment: 1, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: true
// CS Name: ::ConnectedPlayerManager::InternalMessageType
struct CORDL_TYPE __ConnectedPlayerManager__InternalMessageType {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = uint8_t;

  /// @brief Nested struct ____ConnectedPlayerManager__InternalMessageType_Unwrapped
  enum struct ____ConnectedPlayerManager__InternalMessageType_Unwrapped : uint8_t {
    __E_SyncTime = static_cast<uint8_t>(0x0u),
    __E_PlayerConnected = static_cast<uint8_t>(0x1u),
    __E_PlayerIdentity = static_cast<uint8_t>(0x2u),
    __E_PlayerLatencyUpdate = static_cast<uint8_t>(0x3u),
    __E_PlayerDisconnected = static_cast<uint8_t>(0x4u),
    __E_PlayerSortOrderUpdate = static_cast<uint8_t>(0x5u),
    __E_Party = static_cast<uint8_t>(0x6u),
    __E_MultiplayerSession = static_cast<uint8_t>(0x7u),
    __E_KickPlayer = static_cast<uint8_t>(0x8u),
    __E_PlayerStateUpdate = static_cast<uint8_t>(0x9u),
    __E_PlayerAvatarUpdate = static_cast<uint8_t>(0xau),
    __E_Ping = static_cast<uint8_t>(0xbu),
    __E_Pong = static_cast<uint8_t>(0xcu),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____ConnectedPlayerManager__InternalMessageType_Unwrapped() const noexcept {
    return static_cast<____ConnectedPlayerManager__InternalMessageType_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr operator uint8_t() const noexcept {
    return static_cast<uint8_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __ConnectedPlayerManager__InternalMessageType();

  // Ctor Parameters [CppParam { name: "value__", ty: "uint8_t", modifiers: "", def_value: None }]
  constexpr __ConnectedPlayerManager__InternalMessageType(uint8_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x1, def value: None
  uint8_t value__;

  /// @brief Field KickPlayer value: static_cast<uint8_t>(0x8u)
  static ::GlobalNamespace::__ConnectedPlayerManager__InternalMessageType const KickPlayer;

  /// @brief Field MultiplayerSession value: static_cast<uint8_t>(0x7u)
  static ::GlobalNamespace::__ConnectedPlayerManager__InternalMessageType const MultiplayerSession;

  /// @brief Field Party value: static_cast<uint8_t>(0x6u)
  static ::GlobalNamespace::__ConnectedPlayerManager__InternalMessageType const Party;

  /// @brief Field Ping value: static_cast<uint8_t>(0xbu)
  static ::GlobalNamespace::__ConnectedPlayerManager__InternalMessageType const Ping;

  /// @brief Field PlayerAvatarUpdate value: static_cast<uint8_t>(0xau)
  static ::GlobalNamespace::__ConnectedPlayerManager__InternalMessageType const PlayerAvatarUpdate;

  /// @brief Field PlayerConnected value: static_cast<uint8_t>(0x1u)
  static ::GlobalNamespace::__ConnectedPlayerManager__InternalMessageType const PlayerConnected;

  /// @brief Field PlayerDisconnected value: static_cast<uint8_t>(0x4u)
  static ::GlobalNamespace::__ConnectedPlayerManager__InternalMessageType const PlayerDisconnected;

  /// @brief Field PlayerIdentity value: static_cast<uint8_t>(0x2u)
  static ::GlobalNamespace::__ConnectedPlayerManager__InternalMessageType const PlayerIdentity;

  /// @brief Field PlayerLatencyUpdate value: static_cast<uint8_t>(0x3u)
  static ::GlobalNamespace::__ConnectedPlayerManager__InternalMessageType const PlayerLatencyUpdate;

  /// @brief Field PlayerSortOrderUpdate value: static_cast<uint8_t>(0x5u)
  static ::GlobalNamespace::__ConnectedPlayerManager__InternalMessageType const PlayerSortOrderUpdate;

  /// @brief Field PlayerStateUpdate value: static_cast<uint8_t>(0x9u)
  static ::GlobalNamespace::__ConnectedPlayerManager__InternalMessageType const PlayerStateUpdate;

  /// @brief Field Pong value: static_cast<uint8_t>(0xcu)
  static ::GlobalNamespace::__ConnectedPlayerManager__InternalMessageType const Pong;

  /// @brief Field SyncTime value: static_cast<uint8_t>(0x0u)
  static ::GlobalNamespace::__ConnectedPlayerManager__InternalMessageType const SyncTime;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x1 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__ConnectedPlayerManager__InternalMessageType, 0x1>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__InternalMessageType, value__) == 0x0, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::MessageType
// SizeInfo { instance_size: 1, native_size: 1, calculated_instance_size: 1, calculated_native_size: 17, minimum_alignment: 1, natural_alignment: 1, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: true
// CS Name: ::ConnectedPlayerManager::MessageType
struct CORDL_TYPE __ConnectedPlayerManager__MessageType {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = uint8_t;

  /// @brief Nested struct ____ConnectedPlayerManager__MessageType_Unwrapped
  enum struct ____ConnectedPlayerManager__MessageType_Unwrapped : uint8_t {
    __E_Party = static_cast<uint8_t>(0x6u),
    __E_MultiplayerSession = static_cast<uint8_t>(0x7u),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____ConnectedPlayerManager__MessageType_Unwrapped() const noexcept {
    return static_cast<____ConnectedPlayerManager__MessageType_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr operator uint8_t() const noexcept {
    return static_cast<uint8_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __ConnectedPlayerManager__MessageType();

  // Ctor Parameters [CppParam { name: "value__", ty: "uint8_t", modifiers: "", def_value: None }]
  constexpr __ConnectedPlayerManager__MessageType(uint8_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x1, def value: None
  uint8_t value__;

  /// @brief Field MultiplayerSession value: static_cast<uint8_t>(0x7u)
  static ::GlobalNamespace::__ConnectedPlayerManager__MessageType const MultiplayerSession;

  /// @brief Field Party value: static_cast<uint8_t>(0x6u)
  static ::GlobalNamespace::__ConnectedPlayerManager__MessageType const Party;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x1 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__ConnectedPlayerManager__MessageType, 0x1>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__MessageType, value__) == 0x0, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::PlayerConnectedPacket
// SizeInfo { instance_size: 48, native_size: -1, calculated_instance_size: 48, calculated_native_size: 41, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::ConnectedPlayerManager::PlayerConnectedPacket*
class CORDL_TYPE __ConnectedPlayerManager__PlayerConnectedPacket : public ::System::Object {
public:
  // Declarations
  /// @brief Field isConnectionOwner, offset 0x28, size 0x1
  __declspec(property(get = __cordl_internal_get_isConnectionOwner, put = __cordl_internal_set_isConnectionOwner)) bool isConnectionOwner;

  /// @brief Field remoteConnectionId, offset 0x10, size 0x1
  __declspec(property(get = __cordl_internal_get_remoteConnectionId, put = __cordl_internal_set_remoteConnectionId)) uint8_t remoteConnectionId;

  /// @brief Field userId, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_userId, put = __cordl_internal_set_userId))::StringW userId;

  /// @brief Field userName, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_userName, put = __cordl_internal_set_userName))::StringW userName;

  /// @brief Convert operator to "::GlobalNamespace::IPoolablePacket"
  constexpr operator ::GlobalNamespace::IPoolablePacket*() noexcept;

  /// @brief Convert operator to "::LiteNetLib::Utils::INetSerializable"
  constexpr operator ::LiteNetLib::Utils::INetSerializable*() noexcept;

  /// @brief Method Deserialize, addr 0xea2088, size 0x68, virtual true, abstract: false, final true
  inline void Deserialize(::LiteNetLib::Utils::NetDataReader* reader);

  /// @brief Method Init, addr 0xea1dfc, size 0x14, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__ConnectedPlayerManager__PlayerConnectedPacket* Init(uint8_t connectionId, ::StringW userId, ::StringW userName, bool isConnectionOwner);

  static inline ::GlobalNamespace::__ConnectedPlayerManager__PlayerConnectedPacket* New_ctor();

  /// @brief Method Release, addr 0xea0d1c, size 0x54, virtual true, abstract: false, final true
  inline void Release();

  /// @brief Method Serialize, addr 0xea2028, size 0x60, virtual true, abstract: false, final true
  inline void Serialize(::LiteNetLib::Utils::NetDataWriter* writer);

  constexpr bool const& __cordl_internal_get_isConnectionOwner() const;

  constexpr bool& __cordl_internal_get_isConnectionOwner();

  constexpr uint8_t const& __cordl_internal_get_remoteConnectionId() const;

  constexpr uint8_t& __cordl_internal_get_remoteConnectionId();

  constexpr ::StringW const& __cordl_internal_get_userId() const;

  constexpr ::StringW& __cordl_internal_get_userId();

  constexpr ::StringW const& __cordl_internal_get_userName() const;

  constexpr ::StringW& __cordl_internal_get_userName();

  constexpr void __cordl_internal_set_isConnectionOwner(bool value);

  constexpr void __cordl_internal_set_remoteConnectionId(uint8_t value);

  constexpr void __cordl_internal_set_userId(::StringW value);

  constexpr void __cordl_internal_set_userName(::StringW value);

  /// @brief Method .ctor, addr 0xea20f0, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_pool, addr 0xe9ea5c, size 0x40, virtual false, abstract: false, final false
  static inline ::GlobalNamespace::PacketPool_1<::GlobalNamespace::__ConnectedPlayerManager__PlayerConnectedPacket*>* get_pool();

  /// @brief Convert to "::GlobalNamespace::IPoolablePacket"
  constexpr ::GlobalNamespace::IPoolablePacket* i___GlobalNamespace__IPoolablePacket() noexcept;

  /// @brief Convert to "::LiteNetLib::Utils::INetSerializable"
  constexpr ::LiteNetLib::Utils::INetSerializable* i___LiteNetLib__Utils__INetSerializable() noexcept;

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __ConnectedPlayerManager__PlayerConnectedPacket();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__ConnectedPlayerManager__PlayerConnectedPacket", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __ConnectedPlayerManager__PlayerConnectedPacket(__ConnectedPlayerManager__PlayerConnectedPacket&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__ConnectedPlayerManager__PlayerConnectedPacket", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __ConnectedPlayerManager__PlayerConnectedPacket(__ConnectedPlayerManager__PlayerConnectedPacket const&) = delete;

  /// @brief Field remoteConnectionId, offset: 0x10, size: 0x1, def value: None
  uint8_t ___remoteConnectionId;

  /// @brief Field userId, offset: 0x18, size: 0x8, def value: None
  ::StringW ___userId;

  /// @brief Field userName, offset: 0x20, size: 0x8, def value: None
  ::StringW ___userName;

  /// @brief Field isConnectionOwner, offset: 0x28, size: 0x1, def value: None
  bool ___isConnectionOwner;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__ConnectedPlayerManager__PlayerConnectedPacket, 0x30>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__PlayerConnectedPacket, ___remoteConnectionId) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__PlayerConnectedPacket, ___userId) == 0x18, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__PlayerConnectedPacket, ___userName) == 0x20, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__PlayerConnectedPacket, ___isConnectionOwner) == 0x28, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::PlayerIdentityPacket
// SizeInfo { instance_size: 72, native_size: -1, calculated_instance_size: 72, calculated_native_size: 72, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::ConnectedPlayerManager::PlayerIdentityPacket*
class CORDL_TYPE __ConnectedPlayerManager__PlayerIdentityPacket : public ::System::Object {
public:
  // Declarations
  /// @brief Field playerAvatar, offset 0x20, size 0x18
  __declspec(property(get = __cordl_internal_get_playerAvatar, put = __cordl_internal_set_playerAvatar))::GlobalNamespace::MultiplayerAvatarsData playerAvatar;

  /// @brief Field playerState, offset 0x10, size 0x10
  __declspec(property(get = __cordl_internal_get_playerState, put = __cordl_internal_set_playerState))::GlobalNamespace::PlayerStateHash playerState;

  /// @brief Field publicEncryptionKey, offset 0x40, size 0x8
  __declspec(property(get = __cordl_internal_get_publicEncryptionKey, put = __cordl_internal_set_publicEncryptionKey))::GlobalNamespace::ByteArrayNetSerializable* publicEncryptionKey;

  /// @brief Field random, offset 0x38, size 0x8
  __declspec(property(get = __cordl_internal_get_random, put = __cordl_internal_set_random))::GlobalNamespace::ByteArrayNetSerializable* random;

  /// @brief Convert operator to "::GlobalNamespace::IPoolablePacket"
  constexpr operator ::GlobalNamespace::IPoolablePacket*() noexcept;

  /// @brief Convert operator to "::LiteNetLib::Utils::INetSerializable"
  constexpr operator ::LiteNetLib::Utils::INetSerializable*() noexcept;

  /// @brief Method Deserialize, addr 0xea2150, size 0x80, virtual true, abstract: false, final true
  inline void Deserialize(::LiteNetLib::Utils::NetDataReader* reader);

  /// @brief Method Init, addr 0xea1e10, size 0x58, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__ConnectedPlayerManager__PlayerIdentityPacket* Init(::GlobalNamespace::PlayerStateHash states, ::GlobalNamespace::MultiplayerAvatarsData avatar,
                                                                                 ::ArrayW<uint8_t, ::Array<uint8_t>*> random, ::ArrayW<uint8_t, ::Array<uint8_t>*> publicEncryptionKey);

  static inline ::GlobalNamespace::__ConnectedPlayerManager__PlayerIdentityPacket* New_ctor();

  /// @brief Method Release, addr 0xea21d0, size 0x6c, virtual true, abstract: false, final true
  inline void Release();

  /// @brief Method Serialize, addr 0xea20f8, size 0x58, virtual true, abstract: false, final true
  inline void Serialize(::LiteNetLib::Utils::NetDataWriter* writer);

  constexpr ::GlobalNamespace::MultiplayerAvatarsData const& __cordl_internal_get_playerAvatar() const;

  constexpr ::GlobalNamespace::MultiplayerAvatarsData& __cordl_internal_get_playerAvatar();

  constexpr ::GlobalNamespace::PlayerStateHash const& __cordl_internal_get_playerState() const;

  constexpr ::GlobalNamespace::PlayerStateHash& __cordl_internal_get_playerState();

  constexpr ::GlobalNamespace::ByteArrayNetSerializable*& __cordl_internal_get_publicEncryptionKey();

  constexpr ::cordl_internals::to_const_pointer<::GlobalNamespace::ByteArrayNetSerializable*> const& __cordl_internal_get_publicEncryptionKey() const;

  constexpr ::GlobalNamespace::ByteArrayNetSerializable*& __cordl_internal_get_random();

  constexpr ::cordl_internals::to_const_pointer<::GlobalNamespace::ByteArrayNetSerializable*> const& __cordl_internal_get_random() const;

  constexpr void __cordl_internal_set_playerAvatar(::GlobalNamespace::MultiplayerAvatarsData value);

  constexpr void __cordl_internal_set_playerState(::GlobalNamespace::PlayerStateHash value);

  constexpr void __cordl_internal_set_publicEncryptionKey(::GlobalNamespace::ByteArrayNetSerializable* value);

  constexpr void __cordl_internal_set_random(::GlobalNamespace::ByteArrayNetSerializable* value);

  /// @brief Method .ctor, addr 0xea223c, size 0xec, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_pool, addr 0xe9ea9c, size 0x40, virtual false, abstract: false, final false
  static inline ::GlobalNamespace::PacketPool_1<::GlobalNamespace::__ConnectedPlayerManager__PlayerIdentityPacket*>* get_pool();

  /// @brief Convert to "::GlobalNamespace::IPoolablePacket"
  constexpr ::GlobalNamespace::IPoolablePacket* i___GlobalNamespace__IPoolablePacket() noexcept;

  /// @brief Convert to "::LiteNetLib::Utils::INetSerializable"
  constexpr ::LiteNetLib::Utils::INetSerializable* i___LiteNetLib__Utils__INetSerializable() noexcept;

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __ConnectedPlayerManager__PlayerIdentityPacket();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__ConnectedPlayerManager__PlayerIdentityPacket", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __ConnectedPlayerManager__PlayerIdentityPacket(__ConnectedPlayerManager__PlayerIdentityPacket&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__ConnectedPlayerManager__PlayerIdentityPacket", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __ConnectedPlayerManager__PlayerIdentityPacket(__ConnectedPlayerManager__PlayerIdentityPacket const&) = delete;

  /// @brief Field playerState, offset: 0x10, size: 0x10, def value: None
  ::GlobalNamespace::PlayerStateHash ___playerState;

  /// @brief Field playerAvatar, offset: 0x20, size: 0x18, def value: None
  ::GlobalNamespace::MultiplayerAvatarsData ___playerAvatar;

  /// @brief Field random, offset: 0x38, size: 0x8, def value: None
  ::GlobalNamespace::ByteArrayNetSerializable* ___random;

  /// @brief Field publicEncryptionKey, offset: 0x40, size: 0x8, def value: None
  ::GlobalNamespace::ByteArrayNetSerializable* ___publicEncryptionKey;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__ConnectedPlayerManager__PlayerIdentityPacket, 0x48>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__PlayerIdentityPacket, ___playerState) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__PlayerIdentityPacket, ___playerAvatar) == 0x20, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__PlayerIdentityPacket, ___random) == 0x38, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__PlayerIdentityPacket, ___publicEncryptionKey) == 0x40, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::PlayerAvatarPacket
// SizeInfo { instance_size: 40, native_size: -1, calculated_instance_size: 40, calculated_native_size: 40, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::ConnectedPlayerManager::PlayerAvatarPacket*
class CORDL_TYPE __ConnectedPlayerManager__PlayerAvatarPacket : public ::System::Object {
public:
  // Declarations
  /// @brief Field playerAvatar, offset 0x10, size 0x18
  __declspec(property(get = __cordl_internal_get_playerAvatar, put = __cordl_internal_set_playerAvatar))::GlobalNamespace::MultiplayerAvatarsData playerAvatar;

  /// @brief Convert operator to "::GlobalNamespace::IPoolablePacket"
  constexpr operator ::GlobalNamespace::IPoolablePacket*() noexcept;

  /// @brief Convert operator to "::LiteNetLib::Utils::INetSerializable"
  constexpr operator ::LiteNetLib::Utils::INetSerializable*() noexcept;

  /// @brief Method Deserialize, addr 0xea2334, size 0x40, virtual true, abstract: false, final true
  inline void Deserialize(::LiteNetLib::Utils::NetDataReader* reader);

  /// @brief Method Init, addr 0xea1e70, size 0x14, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__ConnectedPlayerManager__PlayerAvatarPacket* Init(::GlobalNamespace::MultiplayerAvatarsData avatar);

  static inline ::GlobalNamespace::__ConnectedPlayerManager__PlayerAvatarPacket* New_ctor();

  /// @brief Method Release, addr 0xea2374, size 0x54, virtual true, abstract: false, final true
  inline void Release();

  /// @brief Method Serialize, addr 0xea2328, size 0xc, virtual true, abstract: false, final true
  inline void Serialize(::LiteNetLib::Utils::NetDataWriter* writer);

  constexpr ::GlobalNamespace::MultiplayerAvatarsData const& __cordl_internal_get_playerAvatar() const;

  constexpr ::GlobalNamespace::MultiplayerAvatarsData& __cordl_internal_get_playerAvatar();

  constexpr void __cordl_internal_set_playerAvatar(::GlobalNamespace::MultiplayerAvatarsData value);

  /// @brief Method .ctor, addr 0xea23c8, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_pool, addr 0xe9ebdc, size 0x40, virtual false, abstract: false, final false
  static inline ::GlobalNamespace::PacketPool_1<::GlobalNamespace::__ConnectedPlayerManager__PlayerAvatarPacket*>* get_pool();

  /// @brief Convert to "::GlobalNamespace::IPoolablePacket"
  constexpr ::GlobalNamespace::IPoolablePacket* i___GlobalNamespace__IPoolablePacket() noexcept;

  /// @brief Convert to "::LiteNetLib::Utils::INetSerializable"
  constexpr ::LiteNetLib::Utils::INetSerializable* i___LiteNetLib__Utils__INetSerializable() noexcept;

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __ConnectedPlayerManager__PlayerAvatarPacket();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__ConnectedPlayerManager__PlayerAvatarPacket", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __ConnectedPlayerManager__PlayerAvatarPacket(__ConnectedPlayerManager__PlayerAvatarPacket&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__ConnectedPlayerManager__PlayerAvatarPacket", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __ConnectedPlayerManager__PlayerAvatarPacket(__ConnectedPlayerManager__PlayerAvatarPacket const&) = delete;

  /// @brief Field playerAvatar, offset: 0x10, size: 0x18, def value: None
  ::GlobalNamespace::MultiplayerAvatarsData ___playerAvatar;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__ConnectedPlayerManager__PlayerAvatarPacket, 0x28>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__PlayerAvatarPacket, ___playerAvatar) == 0x10, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::PlayerStatePacket
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::ConnectedPlayerManager::PlayerStatePacket*
class CORDL_TYPE __ConnectedPlayerManager__PlayerStatePacket : public ::System::Object {
public:
  // Declarations
  /// @brief Field playerState, offset 0x10, size 0x10
  __declspec(property(get = __cordl_internal_get_playerState, put = __cordl_internal_set_playerState))::GlobalNamespace::PlayerStateHash playerState;

  /// @brief Convert operator to "::GlobalNamespace::IPoolablePacket"
  constexpr operator ::GlobalNamespace::IPoolablePacket*() noexcept;

  /// @brief Convert operator to "::LiteNetLib::Utils::INetSerializable"
  constexpr operator ::LiteNetLib::Utils::INetSerializable*() noexcept;

  /// @brief Method Deserialize, addr 0xea23dc, size 0x20, virtual true, abstract: false, final true
  inline void Deserialize(::LiteNetLib::Utils::NetDataReader* reader);

  /// @brief Method Init, addr 0xea1e68, size 0x8, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__ConnectedPlayerManager__PlayerStatePacket* Init(::GlobalNamespace::PlayerStateHash states);

  static inline ::GlobalNamespace::__ConnectedPlayerManager__PlayerStatePacket* New_ctor();

  /// @brief Method Release, addr 0xea23fc, size 0x54, virtual true, abstract: false, final true
  inline void Release();

  /// @brief Method Serialize, addr 0xea23d0, size 0xc, virtual true, abstract: false, final true
  inline void Serialize(::LiteNetLib::Utils::NetDataWriter* writer);

  constexpr ::GlobalNamespace::PlayerStateHash const& __cordl_internal_get_playerState() const;

  constexpr ::GlobalNamespace::PlayerStateHash& __cordl_internal_get_playerState();

  constexpr void __cordl_internal_set_playerState(::GlobalNamespace::PlayerStateHash value);

  /// @brief Method .ctor, addr 0xea2450, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_pool, addr 0xe9ec1c, size 0x40, virtual false, abstract: false, final false
  static inline ::GlobalNamespace::PacketPool_1<::GlobalNamespace::__ConnectedPlayerManager__PlayerStatePacket*>* get_pool();

  /// @brief Convert to "::GlobalNamespace::IPoolablePacket"
  constexpr ::GlobalNamespace::IPoolablePacket* i___GlobalNamespace__IPoolablePacket() noexcept;

  /// @brief Convert to "::LiteNetLib::Utils::INetSerializable"
  constexpr ::LiteNetLib::Utils::INetSerializable* i___LiteNetLib__Utils__INetSerializable() noexcept;

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __ConnectedPlayerManager__PlayerStatePacket();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__ConnectedPlayerManager__PlayerStatePacket", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __ConnectedPlayerManager__PlayerStatePacket(__ConnectedPlayerManager__PlayerStatePacket&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__ConnectedPlayerManager__PlayerStatePacket", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __ConnectedPlayerManager__PlayerStatePacket(__ConnectedPlayerManager__PlayerStatePacket const&) = delete;

  /// @brief Field playerState, offset: 0x10, size: 0x10, def value: None
  ::GlobalNamespace::PlayerStateHash ___playerState;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__ConnectedPlayerManager__PlayerStatePacket, 0x20>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__ConnectedPlayerManager__PlayerStatePacket, ___playerState) == 0x10, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::PlayerSortOrderPacket
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 28, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::ConnectedPlayerManager::PlayerSortOrderPacket*
class CORDL_TYPE __ConnectedPlayerManager__PlayerSortOrderPacket : public ::System::Object {
public:
  // Declarations
  /// @brief Field sortIndex, offset 0x18, size 0x4
  __declspec(property(get = __cordl_internal_get_sortIndex, put = __cordl_internal_set_sortIndex)) int32_t sortIndex;

  /// @brief Field userId, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_userId, put = __cordl_internal_set_userId))::StringW userId;

  /// @brief Convert operator to "::GlobalNamespace::IPoolablePacket"
  constexpr operator ::GlobalNamespace::IPoolablePacket*() noexcept;

  /// @brief Convert operator to "::LiteNetLib::Utils::INetSerializable"
  constexpr operator ::LiteNetLib::Utils::INetSerializable*() noexcept;

  /// @brief Method Deserialize, addr 0xea2498, size 0x44, virtual true, abstract: false, final true
  inline void Deserialize(::LiteNetLib::Utils::NetDataReader* reader);

  /// @brief Method Init, addr 0xea1e84, size 0xc, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__ConnectedPlayerManager__PlayerSortOrderPacket* Init(::StringW userId, int32_t sortIndex);

  static inline ::GlobalNamespace::__ConnectedPlayerManager__PlayerSortOrderPacket* New_ctor();

  /// @brief Method Release, addr 0xea14cc, size 0x54, virtual true, abstract: false, final true
  inline void Release();

  /// @brief Method Serialize, addr 0xea2458, size 0x40, virtual true, abstract: false, final true
  inline void Serialize(::LiteNetLib::Utils::NetDataWriter* writer);

  constexpr int32_t const& __cordl_internal_get_sortIndex() const;

  constexpr int32_t& __cordl_internal_get_sortIndex();

  constexpr ::StringW const& __cordl_internal_get_userId() const;

  constexpr ::StringW& __cordl_internal_get_userId();

  constexpr void __cordl_internal_set_sortIndex(int32_t value);

  constexpr void __cordl_internal_set_userId(::StringW value);

  /// @brief Method .ctor, addr 0xea24dc, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

