#pragma once
// IWYU pragma private; include "GlobalNamespace/GameScenesManager.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "GlobalNamespace/zzzz__GameScenesManager_def.hpp"
#include "System/Collections/Generic/zzzz__List_1_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "UnityEngine/ResourceManagement/AsyncOperations/zzzz__AsyncOperationHandle_1_def.hpp"
#include "UnityEngine/ResourceManagement/ResourceProviders/zzzz__SceneInstance_def.hpp"
#include "UnityEngine/zzzz__MonoBehaviour_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cmath>
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(GameScenesManager)
namespace GlobalNamespace {
class SceneInfo;
}
namespace GlobalNamespace {
class ScenesTransitionSetupDataSO;
}
namespace GlobalNamespace {
struct __GameScenesManager__SceneDismissType;
}
namespace GlobalNamespace {
struct __GameScenesManager__ScenePresentType;
}
namespace GlobalNamespace {
struct __GameScenesManager__SceneTransitionType;
}
namespace GlobalNamespace {
class __GameScenesManager__ScenesStackData;
}
namespace GlobalNamespace {
class __GameScenesManager___LoadOneScene_d__50;
}
namespace GlobalNamespace {
class __GameScenesManager___ScenesTransitionCoroutine_d__52;
}
namespace GlobalNamespace {
class __GameScenesManager___UnloadOneScene_d__51;
}
namespace GlobalNamespace {

struct __GameScenesManager__ScenePresentType;
}
namespace GlobalNamespace {
struct __GameScenesManager__SceneTransitionType;
}
namespace GlobalNamespace {
class GameScenesManager;
}
namespace GlobalNamespace {
class __GameScenesManager__ScenesStackData;
}
namespace GlobalNamespace {
class __GameScenesManager___LoadOneScene_d__50;
}
namespace GlobalNamespace {
class __GameScenesManager___ScenesTransitionCoroutine_d__52;
}
namespace GlobalNamespace {
class __GameScenesManager___UnloadOneScene_d__51;
}
namespace GlobalNamespace {
class __GameScenesManager___WaitUntilTaskCompleted_d__54;
}
namespace GlobalNamespace {
class __GameScenesManager____c__DisplayClass40_0;
}
namespace GlobalNamespace {
class __GameScenesManager____c__DisplayClass41_0;
}
namespace GlobalNamespace {
class __GameScenesManager____c__DisplayClass42_0;
}
namespace GlobalNamespace {
class __GameScenesManager____c__DisplayClass43_0;
}
namespace GlobalNamespace {
class __GameScenesManager____c__DisplayClass44_0;
}
namespace GlobalNamespace {
class __GameScenesManager____c__DisplayClass45_0;
}
namespace GlobalNamespace {
class __GameScenesManager____c__DisplayClass46_0;
}
namespace GlobalNamespace {
class __GameScenesManager____c__DisplayClass47_0;
}
namespace GlobalNamespace {
class __GameScenesManager____c__DisplayClass54_0;
}
// Write type traits
MARK_VAL_T(::GlobalNamespace::__GameScenesManager__SceneDismissType);
MARK_VAL_T(::GlobalNamespace::__GameScenesManager__ScenePresentType);
MARK_VAL_T(::GlobalNamespace::__GameScenesManager__SceneTransitionType);
MARK_REF_PTR_T(::GlobalNamespace::GameScenesManager);
MARK_REF_PTR_T(::GlobalNamespace::__GameScenesManager__ScenesStackData);
MARK_REF_PTR_T(::GlobalNamespace::__GameScenesManager___LoadOneScene_d__50);
MARK_REF_PTR_T(::GlobalNamespace::__GameScenesManager___ScenesTransitionCoroutine_d__52);
MARK_REF_PTR_T(::GlobalNamespace::__GameScenesManager___UnloadOneScene_d__51);
MARK_REF_PTR_T(::GlobalNamespace::__GameScenesManager___WaitUntilTaskCompleted_d__54);
MARK_REF_PTR_T(::GlobalNamespace::__GameScenesManager____c__DisplayClass40_0);
MARK_REF_PTR_T(::GlobalNamespace::__GameScenesManager____c__DisplayClass41_0);
MARK_REF_PTR_T(::GlobalNamespace::__GameScenesManager____c__DisplayClass42_0);
MARK_REF_PTR_T(::GlobalNamespace::__GameScenesManager____c__DisplayClass43_0);
MARK_REF_PTR_T(::GlobalNamespace::__GameScenesManager____c__DisplayClass44_0);
MARK_REF_PTR_T(::GlobalNamespace::__GameScenesManager____c__DisplayClass45_0);
MARK_REF_PTR_T(::GlobalNamespace::__GameScenesManager____c__DisplayClass46_0);
MARK_REF_PTR_T(::GlobalNamespace::__GameScenesManager____c__DisplayClass47_0);
MARK_REF_PTR_T(::GlobalNamespace::__GameScenesManager____c__DisplayClass54_0);
// Type: ::SceneTransitionType
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: true
// CS Name: ::GameScenesManager::SceneTransitionType
struct CORDL_TYPE __GameScenesManager__SceneTransitionType {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____GameScenesManager__SceneTransitionType_Unwrapped
  enum struct ____GameScenesManager__SceneTransitionType_Unwrapped : int32_t {
    __E_None = static_cast<int32_t>(0x0),
    __E_Push = static_cast<int32_t>(0x1),
    __E_Pop = static_cast<int32_t>(0x2),
    __E_Replace = static_cast<int32_t>(0x3),
    __E_ClearAndOpen = static_cast<int32_t>(0x4),
    __E_Append = static_cast<int32_t>(0x5),
    __E_Activate = static_cast<int32_t>(0x6),
    __E_Remove = static_cast<int32_t>(0x7),
    __E_Deactivate = static_cast<int32_t>(0x8),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____GameScenesManager__SceneTransitionType_Unwrapped() const noexcept {
    return static_cast<____GameScenesManager__SceneTransitionType_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __GameScenesManager__SceneTransitionType();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __GameScenesManager__SceneTransitionType(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field Activate value: static_cast<int32_t>(0x6)
  static ::GlobalNamespace::__GameScenesManager__SceneTransitionType const Activate;

  /// @brief Field Append value: static_cast<int32_t>(0x5)
  static ::GlobalNamespace::__GameScenesManager__SceneTransitionType const Append;

  /// @brief Field ClearAndOpen value: static_cast<int32_t>(0x4)
  static ::GlobalNamespace::__GameScenesManager__SceneTransitionType const ClearAndOpen;

  /// @brief Field Deactivate value: static_cast<int32_t>(0x8)
  static ::GlobalNamespace::__GameScenesManager__SceneTransitionType const Deactivate;

  /// @brief Field None value: static_cast<int32_t>(0x0)
  static ::GlobalNamespace::__GameScenesManager__SceneTransitionType const None;

  /// @brief Field Pop value: static_cast<int32_t>(0x2)
  static ::GlobalNamespace::__GameScenesManager__SceneTransitionType const Pop;

  /// @brief Field Push value: static_cast<int32_t>(0x1)
  static ::GlobalNamespace::__GameScenesManager__SceneTransitionType const Push;

  /// @brief Field Remove value: static_cast<int32_t>(0x7)
  static ::GlobalNamespace::__GameScenesManager__SceneTransitionType const Remove;

  /// @brief Field Replace value: static_cast<int32_t>(0x3)
  static ::GlobalNamespace::__GameScenesManager__SceneTransitionType const Replace;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17552 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__GameScenesManager__SceneTransitionType, 0x4>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager__SceneTransitionType, value__) == 0x0, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::ScenesStackData
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::GameScenesManager::ScenesStackData*
class CORDL_TYPE __GameScenesManager__ScenesStackData : public ::System::Object {
public:
  // Declarations
  /// @brief Field <container>k__BackingField, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get__container_k__BackingField, put = __cordl_internal_set__container_k__BackingField)) ::Zenject::DiContainer* _container_k__BackingField;

  /// @brief Field <sceneNames>k__BackingField, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get__sceneNames_k__BackingField,
                      put = __cordl_internal_set__sceneNames_k__BackingField)) ::System::Collections::Generic::List_1<::StringW>* _sceneNames_k__BackingField;

  __declspec(property(get = get_container, put = set_container)) ::Zenject::DiContainer* container;

  __declspec(property(get = get_sceneNames, put = set_sceneNames)) ::System::Collections::Generic::List_1<::StringW>* sceneNames;

  static inline ::GlobalNamespace::__GameScenesManager__ScenesStackData* New_ctor(::System::Collections::Generic::List_1<::StringW>* sceneNames);

  /// @brief Method SetDiContainer, addr 0x2259f70, size 0x8, virtual false, abstract: false, final false
  inline void SetDiContainer(::Zenject::DiContainer* container);

  constexpr ::Zenject::DiContainer*& __cordl_internal_get__container_k__BackingField();

  constexpr ::cordl_internals::to_const_pointer<::Zenject::DiContainer*> const& __cordl_internal_get__container_k__BackingField() const;

  constexpr ::System::Collections::Generic::List_1<::StringW>*& __cordl_internal_get__sceneNames_k__BackingField();

  constexpr ::cordl_internals::to_const_pointer<::System::Collections::Generic::List_1<::StringW>*> const& __cordl_internal_get__sceneNames_k__BackingField() const;

  constexpr void __cordl_internal_set__container_k__BackingField(::Zenject::DiContainer* value);

  constexpr void __cordl_internal_set__sceneNames_k__BackingField(::System::Collections::Generic::List_1<::StringW>* value);

  /// @brief Method .ctor, addr 0x2256f8c, size 0x28, virtual false, abstract: false, final false
  inline void _ctor(::System::Collections::Generic::List_1<::StringW>* sceneNames);

  /// @brief Method get_container, addr 0x2259f60, size 0x8, virtual false, abstract: false, final false
  inline ::Zenject::DiContainer* get_container();

  /// @brief Method get_sceneNames, addr 0x2259f50, size 0x8, virtual false, abstract: false, final false
  inline ::System::Collections::Generic::List_1<::StringW>* get_sceneNames();

  /// @brief Method set_container, addr 0x2259f68, size 0x8, virtual false, abstract: false, final false
  inline void set_container(::Zenject::DiContainer* value);

  /// @brief Method set_sceneNames, addr 0x2259f58, size 0x8, virtual false, abstract: false, final false
  inline void set_sceneNames(::System::Collections::Generic::List_1<::StringW>* value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __GameScenesManager__ScenesStackData();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__GameScenesManager__ScenesStackData", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __GameScenesManager__ScenesStackData(__GameScenesManager__ScenesStackData&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__GameScenesManager__ScenesStackData", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __GameScenesManager__ScenesStackData(__GameScenesManager__ScenesStackData const&) = delete;

  /// @brief Field <sceneNames>k__BackingField, offset: 0x10, size: 0x8, def value: None
  ::System::Collections::Generic::List_1<::StringW>* ____sceneNames_k__BackingField;

  /// @brief Field <container>k__BackingField, offset: 0x18, size: 0x8, def value: None
  ::Zenject::DiContainer* ____container_k__BackingField;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17553 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__GameScenesManager__ScenesStackData, 0x20>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager__ScenesStackData, ____sceneNames_k__BackingField) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager__ScenesStackData, ____container_k__BackingField) == 0x18, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::ScenePresentType
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: true
// CS Name: ::GameScenesManager::ScenePresentType
struct CORDL_TYPE __GameScenesManager__ScenePresentType {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____GameScenesManager__ScenePresentType_Unwrapped
  enum struct ____GameScenesManager__ScenePresentType_Unwrapped : int32_t {
    __E_DoNotLoad = static_cast<int32_t>(0x0),
    __E_Load = static_cast<int32_t>(0x1),
    __E_LoadAndDoNotActivate = static_cast<int32_t>(0x2),
    __E_Activate = static_cast<int32_t>(0x3),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____GameScenesManager__ScenePresentType_Unwrapped() const noexcept {
    return static_cast<____GameScenesManager__ScenePresentType_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __GameScenesManager__ScenePresentType();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __GameScenesManager__ScenePresentType(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field Activate value: static_cast<int32_t>(0x3)
  static ::GlobalNamespace::__GameScenesManager__ScenePresentType const Activate;

  /// @brief Field DoNotLoad value: static_cast<int32_t>(0x0)
  static ::GlobalNamespace::__GameScenesManager__ScenePresentType const DoNotLoad;

  /// @brief Field Load value: static_cast<int32_t>(0x1)
  static ::GlobalNamespace::__GameScenesManager__ScenePresentType const Load;

  /// @brief Field LoadAndDoNotActivate value: static_cast<int32_t>(0x2)
  static ::GlobalNamespace::__GameScenesManager__ScenePresentType const LoadAndDoNotActivate;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17554 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__GameScenesManager__ScenePresentType, 0x4>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager__ScenePresentType, value__) == 0x0, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::SceneDismissType
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: true
// CS Name: ::GameScenesManager::SceneDismissType
struct CORDL_TYPE __GameScenesManager__SceneDismissType {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____GameScenesManager__SceneDismissType_Unwrapped
  enum struct ____GameScenesManager__SceneDismissType_Unwrapped : int32_t {
    __E_DoNotUnload = static_cast<int32_t>(0x0),
    __E_Unload = static_cast<int32_t>(0x1),
    __E_Deactivate = static_cast<int32_t>(0x2),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____GameScenesManager__SceneDismissType_Unwrapped() const noexcept {
    return static_cast<____GameScenesManager__SceneDismissType_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __GameScenesManager__SceneDismissType();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __GameScenesManager__SceneDismissType(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field Deactivate value: static_cast<int32_t>(0x2)
  static ::GlobalNamespace::__GameScenesManager__SceneDismissType const Deactivate;

  /// @brief Field DoNotUnload value: static_cast<int32_t>(0x0)
  static ::GlobalNamespace::__GameScenesManager__SceneDismissType const DoNotUnload;

  /// @brief Field Unload value: static_cast<int32_t>(0x1)
  static ::GlobalNamespace::__GameScenesManager__SceneDismissType const Unload;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17555 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__GameScenesManager__SceneDismissType, 0x4>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager__SceneDismissType, value__) == 0x0, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::<>c__DisplayClass40_0
// SizeInfo { instance_size: 48, native_size: -1, calculated_instance_size: 48, calculated_native_size: 48, minimum_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::GameScenesManager::<>c__DisplayClass40_0*
class CORDL_TYPE __GameScenesManager____c__DisplayClass40_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityW<::GlobalNamespace::GameScenesManager> __4__this;

  /// @brief Field finishCallback, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_finishCallback, put = __cordl_internal_set_finishCallback)) ::System::Action_1<::Zenject::DiContainer*>* finishCallback;

  /// @brief Field scenesStackData, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_scenesStackData, put = __cordl_internal_set_scenesStackData)) ::GlobalNamespace::__GameScenesManager__ScenesStackData* scenesStackData;

  /// @brief Field scenesTransitionSetupData, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_scenesTransitionSetupData, put = __cordl_internal_set_scenesTransitionSetupData)) ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO>
      scenesTransitionSetupData;

  static inline ::GlobalNamespace::__GameScenesManager____c__DisplayClass40_0* New_ctor();

  /// @brief Method <PushScenes>b__0, addr 0x2259f78, size 0x6c, virtual false, abstract: false, final false
  inline void _PushScenes_b__0(::Zenject::DiContainer* container);

  /// @brief Method <PushScenes>b__1, addr 0x225a110, size 0x7c, virtual false, abstract: false, final false
  inline void _PushScenes_b__1(::Zenject::DiContainer* container);

  constexpr ::UnityW<::GlobalNamespace::GameScenesManager> const& __cordl_internal_get___4__this() const;

  constexpr ::UnityW<::GlobalNamespace::GameScenesManager>& __cordl_internal_get___4__this();

  constexpr ::System::Action_1<::Zenject::DiContainer*>*& __cordl_internal_get_finishCallback();

  constexpr ::cordl_internals::to_const_pointer<::System::Action_1<::Zenject::DiContainer*>*> const& __cordl_internal_get_finishCallback() const;

  constexpr ::GlobalNamespace::__GameScenesManager__ScenesStackData*& __cordl_internal_get_scenesStackData();

  constexpr ::cordl_internals::to_const_pointer<::GlobalNamespace::__GameScenesManager__ScenesStackData*> const& __cordl_internal_get_scenesStackData() const;

  constexpr ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO> const& __cordl_internal_get_scenesTransitionSetupData() const;

  constexpr ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO>& __cordl_internal_get_scenesTransitionSetupData();

  constexpr void __cordl_internal_set___4__this(::UnityW<::GlobalNamespace::GameScenesManager> value);

  constexpr void __cordl_internal_set_finishCallback(::System::Action_1<::Zenject::DiContainer*>* value);

  constexpr void __cordl_internal_set_scenesStackData(::GlobalNamespace::__GameScenesManager__ScenesStackData* value);

  constexpr void __cordl_internal_set_scenesTransitionSetupData(::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO> value);

  /// @brief Method .ctor, addr 0x22576ac, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __GameScenesManager____c__DisplayClass40_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__GameScenesManager____c__DisplayClass40_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __GameScenesManager____c__DisplayClass40_0(__GameScenesManager____c__DisplayClass40_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__GameScenesManager____c__DisplayClass40_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __GameScenesManager____c__DisplayClass40_0(__GameScenesManager____c__DisplayClass40_0 const&) = delete;

  /// @brief Field scenesStackData, offset: 0x10, size: 0x8, def value: None
  ::GlobalNamespace::__GameScenesManager__ScenesStackData* ___scenesStackData;

  /// @brief Field scenesTransitionSetupData, offset: 0x18, size: 0x8, def value: None
  ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO> ___scenesTransitionSetupData;

  /// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
  ::UnityW<::GlobalNamespace::GameScenesManager> _____4__this;

  /// @brief Field finishCallback, offset: 0x28, size: 0x8, def value: None
  ::System::Action_1<::Zenject::DiContainer*>* ___finishCallback;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17556 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__GameScenesManager____c__DisplayClass40_0, 0x30>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass40_0, ___scenesStackData) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass40_0, ___scenesTransitionSetupData) == 0x18, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass40_0, _____4__this) == 0x20, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass40_0, ___finishCallback) == 0x28, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::<>c__DisplayClass41_0
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::GameScenesManager::<>c__DisplayClass41_0*
class CORDL_TYPE __GameScenesManager____c__DisplayClass41_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityW<::GlobalNamespace::GameScenesManager> __4__this;

  /// @brief Field finishCallback, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_finishCallback, put = __cordl_internal_set_finishCallback)) ::System::Action_1<::Zenject::DiContainer*>* finishCallback;

  static inline ::GlobalNamespace::__GameScenesManager____c__DisplayClass41_0* New_ctor();

  /// @brief Method <PopScenes>b__0, addr 0x225a18c, size 0xac, virtual false, abstract: false, final false
  inline void _PopScenes_b__0(::Zenject::DiContainer* container);

  constexpr ::UnityW<::GlobalNamespace::GameScenesManager> const& __cordl_internal_get___4__this() const;

  constexpr ::UnityW<::GlobalNamespace::GameScenesManager>& __cordl_internal_get___4__this();

  constexpr ::System::Action_1<::Zenject::DiContainer*>*& __cordl_internal_get_finishCallback();

  constexpr ::cordl_internals::to_const_pointer<::System::Action_1<::Zenject::DiContainer*>*> const& __cordl_internal_get_finishCallback() const;

  constexpr void __cordl_internal_set___4__this(::UnityW<::GlobalNamespace::GameScenesManager> value);

  constexpr void __cordl_internal_set_finishCallback(::System::Action_1<::Zenject::DiContainer*>* value);

  /// @brief Method .ctor, addr 0x2257a98, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __GameScenesManager____c__DisplayClass41_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__GameScenesManager____c__DisplayClass41_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __GameScenesManager____c__DisplayClass41_0(__GameScenesManager____c__DisplayClass41_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__GameScenesManager____c__DisplayClass41_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __GameScenesManager____c__DisplayClass41_0(__GameScenesManager____c__DisplayClass41_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityW<::GlobalNamespace::GameScenesManager> _____4__this;

  /// @brief Field finishCallback, offset: 0x18, size: 0x8, def value: None
  ::System::Action_1<::Zenject::DiContainer*>* ___finishCallback;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17557 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__GameScenesManager____c__DisplayClass41_0, 0x20>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass41_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass41_0, ___finishCallback) == 0x18, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::<>c__DisplayClass42_0
// SizeInfo { instance_size: 80, native_size: -1, calculated_instance_size: 80, calculated_native_size: 80, minimum_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::GameScenesManager::<>c__DisplayClass42_0*
class CORDL_TYPE __GameScenesManager____c__DisplayClass42_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityW<::GlobalNamespace::GameScenesManager> __4__this;

  /// @brief Field <>9__1, offset 0x40, size 0x8
  __declspec(property(get = __cordl_internal_get___9__1, put = __cordl_internal_set___9__1)) ::System::Action_1<::Zenject::DiContainer*>* __9__1;

  /// @brief Field <>9__2, offset 0x48, size 0x8
  __declspec(property(get = __cordl_internal_get___9__2, put = __cordl_internal_set___9__2)) ::System::Action_1<::Zenject::DiContainer*>* __9__2;

  /// @brief Field emptyTransitionSceneNameList, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_emptyTransitionSceneNameList,
                      put = __cordl_internal_set_emptyTransitionSceneNameList)) ::System::Collections::Generic::List_1<::StringW>* emptyTransitionSceneNameList;

  /// @brief Field finishCallback, offset 0x38, size 0x8
  __declspec(property(get = __cordl_internal_get_finishCallback, put = __cordl_internal_set_finishCallback)) ::System::Action_1<::Zenject::DiContainer*>* finishCallback;

  /// @brief Field newSceneNames, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_newSceneNames, put = __cordl_internal_set_newSceneNames)) ::System::Collections::Generic::List_1<::StringW>* newSceneNames;

  /// @brief Field scenesStackData, offset 0x30, size 0x8
  __declspec(property(get = __cordl_internal_get_scenesStackData, put = __cordl_internal_set_scenesStackData)) ::GlobalNamespace::__GameScenesManager__ScenesStackData* scenesStackData;

  /// @brief Field scenesTransitionSetupData, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_scenesTransitionSetupData, put = __cordl_internal_set_scenesTransitionSetupData)) ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO>
      scenesTransitionSetupData;

  static inline ::GlobalNamespace::__GameScenesManager____c__DisplayClass42_0* New_ctor();

  /// @brief Method <ReplaceScenes>b__0, addr 0x225a238, size 0x120, virtual false, abstract: false, final false
  inline void _ReplaceScenes_b__0(::Zenject::DiContainer* emptySceneContainer);

  /// @brief Method <ReplaceScenes>b__1, addr 0x225a358, size 0x6c, virtual false, abstract: false, final false
  inline void _ReplaceScenes_b__1(::Zenject::DiContainer* container);

  /// @brief Method <ReplaceScenes>b__2, addr 0x225a3c4, size 0x7c, virtual false, abstract: false, final false
  inline void _ReplaceScenes_b__2(::Zenject::DiContainer* container);

  constexpr ::UnityW<::GlobalNamespace::GameScenesManager> const& __cordl_internal_get___4__this() const;

  constexpr ::UnityW<::GlobalNamespace::GameScenesManager>& __cordl_internal_get___4__this();

  constexpr ::System::Action_1<::Zenject::DiContainer*>*& __cordl_internal_get___9__1();

  constexpr ::cordl_internals::to_const_pointer<::System::Action_1<::Zenject::DiContainer*>*> const& __cordl_internal_get___9__1() const;

  constexpr ::System::Action_1<::Zenject::DiContainer*>*& __cordl_internal_get___9__2();

  constexpr ::cordl_internals::to_const_pointer<::System::Action_1<::Zenject::DiContainer*>*> const& __cordl_internal_get___9__2() const;

  constexpr ::System::Collections::Generic::List_1<::StringW>*& __cordl_internal_get_emptyTransitionSceneNameList();

  constexpr ::cordl_internals::to_const_pointer<::System::Collections::Generic::List_1<::StringW>*> const& __cordl_internal_get_emptyTransitionSceneNameList() const;

  constexpr ::System::Action_1<::Zenject::DiContainer*>*& __cordl_internal_get_finishCallback();

  constexpr ::cordl_internals::to_const_pointer<::System::Action_1<::Zenject::DiContainer*>*> const& __cordl_internal_get_finishCallback() const;

  constexpr ::System::Collections::Generic::List_1<::StringW>*& __cordl_internal_get_newSceneNames();

  constexpr ::cordl_internals::to_const_pointer<::System::Collections::Generic::List_1<::StringW>*> const& __cordl_internal_get_newSceneNames() const;

  constexpr ::GlobalNamespace::__GameScenesManager__ScenesStackData*& __cordl_internal_get_scenesStackData();

  constexpr ::cordl_internals::to_const_pointer<::GlobalNamespace::__GameScenesManager__ScenesStackData*> const& __cordl_internal_get_scenesStackData() const;

  constexpr ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO> const& __cordl_internal_get_scenesTransitionSetupData() const;

  constexpr ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO>& __cordl_internal_get_scenesTransitionSetupData();

  constexpr void __cordl_internal_set___4__this(::UnityW<::GlobalNamespace::GameScenesManager> value);

  constexpr void __cordl_internal_set___9__1(::System::Action_1<::Zenject::DiContainer*>* value);

  constexpr void __cordl_internal_set___9__2(::System::Action_1<::Zenject::DiContainer*>* value);

  constexpr void __cordl_internal_set_emptyTransitionSceneNameList(::System::Collections::Generic::List_1<::StringW>* value);

  constexpr void __cordl_internal_set_finishCallback(::System::Action_1<::Zenject::DiContainer*>* value);

  constexpr void __cordl_internal_set_newSceneNames(::System::Collections::Generic::List_1<::StringW>* value);

  constexpr void __cordl_internal_set_scenesStackData(::GlobalNamespace::__GameScenesManager__ScenesStackData* value);

  constexpr void __cordl_internal_set_scenesTransitionSetupData(::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO> value);

  /// @brief Method .ctor, addr 0x2257dec, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __GameScenesManager____c__DisplayClass42_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__GameScenesManager____c__DisplayClass42_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __GameScenesManager____c__DisplayClass42_0(__GameScenesManager____c__DisplayClass42_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__GameScenesManager____c__DisplayClass42_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __GameScenesManager____c__DisplayClass42_0(__GameScenesManager____c__DisplayClass42_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityW<::GlobalNamespace::GameScenesManager> _____4__this;

  /// @brief Field scenesTransitionSetupData, offset: 0x18, size: 0x8, def value: None
  ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO> ___scenesTransitionSetupData;

  /// @brief Field newSceneNames, offset: 0x20, size: 0x8, def value: None
  ::System::Collections::Generic::List_1<::StringW>* ___newSceneNames;

  /// @brief Field emptyTransitionSceneNameList, offset: 0x28, size: 0x8, def value: None
  ::System::Collections::Generic::List_1<::StringW>* ___emptyTransitionSceneNameList;

  /// @brief Field scenesStackData, offset: 0x30, size: 0x8, def value: None
  ::GlobalNamespace::__GameScenesManager__ScenesStackData* ___scenesStackData;

  /// @brief Field finishCallback, offset: 0x38, size: 0x8, def value: None
  ::System::Action_1<::Zenject::DiContainer*>* ___finishCallback;

  /// @brief Field <>9__1, offset: 0x40, size: 0x8, def value: None
  ::System::Action_1<::Zenject::DiContainer*>* _____9__1;

  /// @brief Field <>9__2, offset: 0x48, size: 0x8, def value: None
  ::System::Action_1<::Zenject::DiContainer*>* _____9__2;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17558 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__GameScenesManager____c__DisplayClass42_0, 0x50>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass42_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass42_0, ___scenesTransitionSetupData) == 0x18, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass42_0, ___newSceneNames) == 0x20, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass42_0, ___emptyTransitionSceneNameList) == 0x28, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass42_0, ___scenesStackData) == 0x30, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass42_0, ___finishCallback) == 0x38, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass42_0, _____9__1) == 0x40, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass42_0, _____9__2) == 0x48, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::<>c__DisplayClass43_0
// SizeInfo { instance_size: 80, native_size: -1, calculated_instance_size: 80, calculated_native_size: 80, minimum_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::GameScenesManager::<>c__DisplayClass43_0*
class CORDL_TYPE __GameScenesManager____c__DisplayClass43_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityW<::GlobalNamespace::GameScenesManager> __4__this;

  /// @brief Field <>9__1, offset 0x40, size 0x8
  __declspec(property(get = __cordl_internal_get___9__1, put = __cordl_internal_set___9__1)) ::System::Action_1<::Zenject::DiContainer*>* __9__1;

  /// @brief Field <>9__2, offset 0x48, size 0x8
  __declspec(property(get = __cordl_internal_get___9__2, put = __cordl_internal_set___9__2)) ::System::Action_1<::Zenject::DiContainer*>* __9__2;

  /// @brief Field emptyTransitionSceneNameList, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_emptyTransitionSceneNameList,
                      put = __cordl_internal_set_emptyTransitionSceneNameList)) ::System::Collections::Generic::List_1<::StringW>* emptyTransitionSceneNameList;

  /// @brief Field finishCallback, offset 0x38, size 0x8
  __declspec(property(get = __cordl_internal_get_finishCallback, put = __cordl_internal_set_finishCallback)) ::System::Action_1<::Zenject::DiContainer*>* finishCallback;

  /// @brief Field newSceneNames, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_newSceneNames, put = __cordl_internal_set_newSceneNames)) ::System::Collections::Generic::List_1<::StringW>* newSceneNames;

  /// @brief Field scenesStackData, offset 0x30, size 0x8
  __declspec(property(get = __cordl_internal_get_scenesStackData, put = __cordl_internal_set_scenesStackData)) ::GlobalNamespace::__GameScenesManager__ScenesStackData* scenesStackData;

  /// @brief Field scenesTransitionSetupData, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_scenesTransitionSetupData, put = __cordl_internal_set_scenesTransitionSetupData)) ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO>
      scenesTransitionSetupData;

  static inline ::GlobalNamespace::__GameScenesManager____c__DisplayClass43_0* New_ctor();

  /// @brief Method <ClearAndOpenScenes>b__0, addr 0x225a440, size 0x120, virtual false, abstract: false, final false
  inline void _ClearAndOpenScenes_b__0(::Zenject::DiContainer* emptySceneContainer);

  /// @brief Method <ClearAndOpenScenes>b__1, addr 0x225a560, size 0x6c, virtual false, abstract: false, final false
  inline void _ClearAndOpenScenes_b__1(::Zenject::DiContainer* container);

  /// @brief Method <ClearAndOpenScenes>b__2, addr 0x225a5cc, size 0x7c, virtual false, abstract: false, final false
  inline void _ClearAndOpenScenes_b__2(::Zenject::DiContainer* container);

  constexpr ::UnityW<::GlobalNamespace::GameScenesManager> const& __cordl_internal_get___4__this() const;

  constexpr ::UnityW<::GlobalNamespace::GameScenesManager>& __cordl_internal_get___4__this();

  constexpr ::System::Action_1<::Zenject::DiContainer*>*& __cordl_internal_get___9__1();

  constexpr ::cordl_internals::to_const_pointer<::System::Action_1<::Zenject::DiContainer*>*> const& __cordl_internal_get___9__1() const;

  constexpr ::System::Action_1<::Zenject::DiContainer*>*& __cordl_internal_get___9__2();

  constexpr ::cordl_internals::to_const_pointer<::System::Action_1<::Zenject::DiContainer*>*> const& __cordl_internal_get___9__2() const;

  constexpr ::System::Collections::Generic::List_1<::StringW>*& __cordl_internal_get_emptyTransitionSceneNameList();

  constexpr ::cordl_internals::to_const_pointer<::System::Collections::Generic::List_1<::StringW>*> const& __cordl_internal_get_emptyTransitionSceneNameList() const;

  constexpr ::System::Action_1<::Zenject::DiContainer*>*& __cordl_internal_get_finishCallback();

  constexpr ::cordl_internals::to_const_pointer<::System::Action_1<::Zenject::DiContainer*>*> const& __cordl_internal_get_finishCallback() const;

  constexpr ::System::Collections::Generic::List_1<::StringW>*& __cordl_internal_get_newSceneNames();

  constexpr ::cordl_internals::to_const_pointer<::System::Collections::Generic::List_1<::StringW>*> const& __cordl_internal_get_newSceneNames() const;

  constexpr ::GlobalNamespace::__GameScenesManager__ScenesStackData*& __cordl_internal_get_scenesStackData();

  constexpr ::cordl_internals::to_const_pointer<::GlobalNamespace::__GameScenesManager__ScenesStackData*> const& __cordl_internal_get_scenesStackData() const;

  constexpr ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO> const& __cordl_internal_get_scenesTransitionSetupData() const;

  constexpr ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO>& __cordl_internal_get_scenesTransitionSetupData();

  constexpr void __cordl_internal_set___4__this(::UnityW<::GlobalNamespace::GameScenesManager> value);

  constexpr void __cordl_internal_set___9__1(::System::Action_1<::Zenject::DiContainer*>* value);

  constexpr void __cordl_internal_set___9__2(::System::Action_1<::Zenject::DiContainer*>* value);

  constexpr void __cordl_internal_set_emptyTransitionSceneNameList(::System::Collections::Generic::List_1<::StringW>* value);

  constexpr void __cordl_internal_set_finishCallback(::System::Action_1<::Zenject::DiContainer*>* value);

  constexpr void __cordl_internal_set_newSceneNames(::System::Collections::Generic::List_1<::StringW>* value);

  constexpr void __cordl_internal_set_scenesStackData(::GlobalNamespace::__GameScenesManager__ScenesStackData* value);

  constexpr void __cordl_internal_set_scenesTransitionSetupData(::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO> value);

  /// @brief Method .ctor, addr 0x2258434, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __GameScenesManager____c__DisplayClass43_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__GameScenesManager____c__DisplayClass43_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __GameScenesManager____c__DisplayClass43_0(__GameScenesManager____c__DisplayClass43_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__GameScenesManager____c__DisplayClass43_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __GameScenesManager____c__DisplayClass43_0(__GameScenesManager____c__DisplayClass43_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityW<::GlobalNamespace::GameScenesManager> _____4__this;

  /// @brief Field scenesTransitionSetupData, offset: 0x18, size: 0x8, def value: None
  ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO> ___scenesTransitionSetupData;

  /// @brief Field newSceneNames, offset: 0x20, size: 0x8, def value: None
  ::System::Collections::Generic::List_1<::StringW>* ___newSceneNames;

  /// @brief Field emptyTransitionSceneNameList, offset: 0x28, size: 0x8, def value: None
  ::System::Collections::Generic::List_1<::StringW>* ___emptyTransitionSceneNameList;

  /// @brief Field scenesStackData, offset: 0x30, size: 0x8, def value: None
  ::GlobalNamespace::__GameScenesManager__ScenesStackData* ___scenesStackData;

  /// @brief Field finishCallback, offset: 0x38, size: 0x8, def value: None
  ::System::Action_1<::Zenject::DiContainer*>* ___finishCallback;

  /// @brief Field <>9__1, offset: 0x40, size: 0x8, def value: None
  ::System::Action_1<::Zenject::DiContainer*>* _____9__1;

  /// @brief Field <>9__2, offset: 0x48, size: 0x8, def value: None
  ::System::Action_1<::Zenject::DiContainer*>* _____9__2;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17559 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__GameScenesManager____c__DisplayClass43_0, 0x50>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass43_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass43_0, ___scenesTransitionSetupData) == 0x18, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass43_0, ___newSceneNames) == 0x20, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass43_0, ___emptyTransitionSceneNameList) == 0x28, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass43_0, ___scenesStackData) == 0x30, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass43_0, ___finishCallback) == 0x38, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass43_0, _____9__1) == 0x40, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass43_0, _____9__2) == 0x48, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::<>c__DisplayClass44_0
// SizeInfo { instance_size: 48, native_size: -1, calculated_instance_size: 48, calculated_native_size: 48, minimum_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::GameScenesManager::<>c__DisplayClass44_0*
class CORDL_TYPE __GameScenesManager____c__DisplayClass44_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityW<::GlobalNamespace::GameScenesManager> __4__this;

  /// @brief Field finishCallback, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_finishCallback, put = __cordl_internal_set_finishCallback)) ::System::Action_1<::Zenject::DiContainer*>* finishCallback;

  /// @brief Field scenesStackData, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_scenesStackData, put = __cordl_internal_set_scenesStackData)) ::GlobalNamespace::__GameScenesManager__ScenesStackData* scenesStackData;

  /// @brief Field scenesTransitionSetupData, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_scenesTransitionSetupData, put = __cordl_internal_set_scenesTransitionSetupData)) ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO>
      scenesTransitionSetupData;

  static inline ::GlobalNamespace::__GameScenesManager____c__DisplayClass44_0* New_ctor();

  /// @brief Method <AppendScenes>b__0, addr 0x225a648, size 0x6c, virtual false, abstract: false, final false
  inline void _AppendScenes_b__0(::Zenject::DiContainer* container);

  /// @brief Method <AppendScenes>b__1, addr 0x225a6b4, size 0x7c, virtual false, abstract: false, final false
  inline void _AppendScenes_b__1(::Zenject::DiContainer* container);

  constexpr ::UnityW<::GlobalNamespace::GameScenesManager> const& __cordl_internal_get___4__this() const;

  constexpr ::UnityW<::GlobalNamespace::GameScenesManager>& __cordl_internal_get___4__this();

  constexpr ::System::Action_1<::Zenject::DiContainer*>*& __cordl_internal_get_finishCallback();

  constexpr ::cordl_internals::to_const_pointer<::System::Action_1<::Zenject::DiContainer*>*> const& __cordl_internal_get_finishCallback() const;

  constexpr ::GlobalNamespace::__GameScenesManager__ScenesStackData*& __cordl_internal_get_scenesStackData();

  constexpr ::cordl_internals::to_const_pointer<::GlobalNamespace::__GameScenesManager__ScenesStackData*> const& __cordl_internal_get_scenesStackData() const;

  constexpr ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO> const& __cordl_internal_get_scenesTransitionSetupData() const;

  constexpr ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO>& __cordl_internal_get_scenesTransitionSetupData();

  constexpr void __cordl_internal_set___4__this(::UnityW<::GlobalNamespace::GameScenesManager> value);

  constexpr void __cordl_internal_set_finishCallback(::System::Action_1<::Zenject::DiContainer*>* value);

  constexpr void __cordl_internal_set_scenesStackData(::GlobalNamespace::__GameScenesManager__ScenesStackData* value);

  constexpr void __cordl_internal_set_scenesTransitionSetupData(::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO> value);

  /// @brief Method .ctor, addr 0x22587fc, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __GameScenesManager____c__DisplayClass44_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__GameScenesManager____c__DisplayClass44_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __GameScenesManager____c__DisplayClass44_0(__GameScenesManager____c__DisplayClass44_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__GameScenesManager____c__DisplayClass44_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __GameScenesManager____c__DisplayClass44_0(__GameScenesManager____c__DisplayClass44_0 const&) = delete;

  /// @brief Field scenesStackData, offset: 0x10, size: 0x8, def value: None
  ::GlobalNamespace::__GameScenesManager__ScenesStackData* ___scenesStackData;

  /// @brief Field scenesTransitionSetupData, offset: 0x18, size: 0x8, def value: None
  ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO> ___scenesTransitionSetupData;

  /// @brief Field <>4__this, offset: 0x20, size: 0x8, def value: None
  ::UnityW<::GlobalNamespace::GameScenesManager> _____4__this;

  /// @brief Field finishCallback, offset: 0x28, size: 0x8, def value: None
  ::System::Action_1<::Zenject::DiContainer*>* ___finishCallback;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17560 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__GameScenesManager____c__DisplayClass44_0, 0x30>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass44_0, ___scenesStackData) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass44_0, ___scenesTransitionSetupData) == 0x18, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass44_0, _____4__this) == 0x20, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass44_0, ___finishCallback) == 0x28, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::<>c__DisplayClass45_0
// SizeInfo { instance_size: 40, native_size: -1, calculated_instance_size: 40, calculated_native_size: 40, minimum_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::GameScenesManager::<>c__DisplayClass45_0*
class CORDL_TYPE __GameScenesManager____c__DisplayClass45_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityW<::GlobalNamespace::GameScenesManager> __4__this;

  /// @brief Field finishCallback, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_finishCallback, put = __cordl_internal_set_finishCallback)) ::System::Action_1<::Zenject::DiContainer*>* finishCallback;

  /// @brief Field sceneNamesToRemove, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_sceneNamesToRemove, put = __cordl_internal_set_sceneNamesToRemove)) ::System::Collections::Generic::List_1<::StringW>* sceneNamesToRemove;

  static inline ::GlobalNamespace::__GameScenesManager____c__DisplayClass45_0* New_ctor();

  /// @brief Method <RemoveScenes>b__0, addr 0x225a730, size 0xac, virtual false, abstract: false, final false
  inline void _RemoveScenes_b__0(::Zenject::DiContainer* container);

  /// @brief Method <RemoveScenes>b__1, addr 0x225a7dc, size 0x64, virtual false, abstract: false, final false
  inline bool _RemoveScenes_b__1(::StringW scene);

  constexpr ::UnityW<::GlobalNamespace::GameScenesManager> const& __cordl_internal_get___4__this() const;

  constexpr ::UnityW<::GlobalNamespace::GameScenesManager>& __cordl_internal_get___4__this();

  constexpr ::System::Action_1<::Zenject::DiContainer*>*& __cordl_internal_get_finishCallback();

  constexpr ::cordl_internals::to_const_pointer<::System::Action_1<::Zenject::DiContainer*>*> const& __cordl_internal_get_finishCallback() const;

  constexpr ::System::Collections::Generic::List_1<::StringW>*& __cordl_internal_get_sceneNamesToRemove();

  constexpr ::cordl_internals::to_const_pointer<::System::Collections::Generic::List_1<::StringW>*> const& __cordl_internal_get_sceneNamesToRemove() const;

  constexpr void __cordl_internal_set___4__this(::UnityW<::GlobalNamespace::GameScenesManager> value);

  constexpr void __cordl_internal_set_finishCallback(::System::Action_1<::Zenject::DiContainer*>* value);

  constexpr void __cordl_internal_set_sceneNamesToRemove(::System::Collections::Generic::List_1<::StringW>* value);

  /// @brief Method .ctor, addr 0x2258b94, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __GameScenesManager____c__DisplayClass45_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__GameScenesManager____c__DisplayClass45_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __GameScenesManager____c__DisplayClass45_0(__GameScenesManager____c__DisplayClass45_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__GameScenesManager____c__DisplayClass45_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __GameScenesManager____c__DisplayClass45_0(__GameScenesManager____c__DisplayClass45_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityW<::GlobalNamespace::GameScenesManager> _____4__this;

  /// @brief Field finishCallback, offset: 0x18, size: 0x8, def value: None
  ::System::Action_1<::Zenject::DiContainer*>* ___finishCallback;

  /// @brief Field sceneNamesToRemove, offset: 0x20, size: 0x8, def value: None
  ::System::Collections::Generic::List_1<::StringW>* ___sceneNamesToRemove;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17561 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__GameScenesManager____c__DisplayClass45_0, 0x28>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass45_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass45_0, ___finishCallback) == 0x18, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__GameScenesManager____c__DisplayClass45_0, ___sceneNamesToRemove) == 0x20, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::<>c__DisplayClass46_0
// SizeInfo { instance_size: 40, native_size: -1, calculated_instance_size: 40, calculated_native_size: 40, minimum_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::GameScenesManager::<>c__DisplayClass46_0*
class CORDL_TYPE __GameScenesManager____c__DisplayClass46_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityW<::GlobalNamespace::GameScenesManager> __4__this;

  /// @brief Field finishCallback, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_finishCallback, put = __cordl_internal_set_finishCallback)) ::System::Action_1<::Zenject::DiContainer*>* finishCallback;

  /// @brief Field scenesTransitionSetupData, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_scenesTransitionSetupData, put = __cordl_internal_set_scenesTransitionSetupData)) ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO>
      scenesTransitionSetupData;

  static inline ::GlobalNamespace::__GameScenesManager____c__DisplayClass46_0* New_ctor();

  /// @brief Method <ActivateScenes>b__0, addr 0x225a840, size 0x74, virtual false, abstract: false, final false
  inline void _ActivateScenes_b__0(::Zenject::DiContainer* container);

  constexpr ::UnityW<::GlobalNamespace::GameScenesManager> const& __cordl_internal_get___4__this() const;

  constexpr ::UnityW<::GlobalNamespace::GameScenesManager>& __cordl_internal_get___4__this();

  constexpr ::System::Action_1<::Zenject::DiContainer*>*& __cordl_internal_get_finishCallback();

  constexpr ::cordl_internals::to_const_pointer<::System::Action_1<::Zenject::DiContainer*>*> const& __cordl_internal_get_finishCallback() const;

  constexpr ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO> const& __cordl_internal_get_scenesTransitionSetupData() const;

  constexpr ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO>& __cordl_internal_get_scenesTransitionSetupData();

  constexpr void __cordl_internal_set___4__this(::UnityW<::GlobalNamespace::GameScenesManager> value);

  constexpr void __cordl_internal_set_finishCallback(::System::Action_1<::Zenject::DiContainer*>* value);

  constexpr void __cordl_internal_set_scenesTransitionSetupData(::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO> value);

  /// @brief Method .ctor, addr 0x2258d4c, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __GameScenesManager____c__DisplayClass46_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__GameScenesManager____c__DisplayClass46_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __GameScenesManager____c__DisplayClass46_0(__GameScenesManager____c__DisplayClass46_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__GameScenesManager____c__DisplayClass46_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __GameScenesManager____c__DisplayClass46_0(__GameScenesManager____c__DisplayClass46_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityW<::GlobalNamespace::GameScenesManager> _____4__this;

  /// @brief Field scenesTransitionSetupData, offset: 0x18, size: 0x8, def value: None
  ::UnityW<::GlobalNamespace::ScenesTransitionSetupDataSO> ___scenesTransitionSetupData;

  /// @brief Field finishCallback, offset: 0x20, size: 0x8, def value: None
  ::System::Action_1<::Zenject::DiContainer*>* ___finishCallback;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17562 };

