#pragma once
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "RootMotion/FinalIK/zzzz__IKSolverVR_def.hpp"
#include "RootMotion/FinalIK/zzzz__IKSolver_def.hpp"
#include "RootMotion/zzzz__InterpolationMode_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "UnityEngine/zzzz__LayerMask_def.hpp"
#include "UnityEngine/zzzz__Quaternion_def.hpp"
#include "UnityEngine/zzzz__Vector3_def.hpp"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cmath>
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(IKSolverVR)
namespace GlobalNamespace {
struct __IKSolverVR__Arm__ShoulderRotationMode;
}
namespace RootMotion::FinalIK {
class __IKSolverVR__Arm;
}
namespace RootMotion::FinalIK {
class __IKSolverVR__BodyPart;
}
namespace RootMotion::FinalIK {
class __IKSolverVR__Footstep;
}
namespace RootMotion::FinalIK {
class __IKSolverVR__Leg;
}
namespace RootMotion::FinalIK {
class __IKSolverVR__Locomotion;
}
namespace RootMotion::FinalIK {
struct __IKSolverVR__PositionOffset;
}
namespace RootMotion::FinalIK {
struct __IKSolverVR__RotationOffset;
}
namespace RootMotion::FinalIK {
class __IKSolverVR__Spine;
}
namespace RootMotion::FinalIK {
class __IKSolverVR__VirtualBone;
}
namespace RootMotion::FinalIK {
class __IKSolver__Point;
}
namespace RootMotion::FinalIK {
class __VRIK__References;
}
namespace RootMotion {
struct InterpolationMode;
}
namespace UnityEngine::Events {
class UnityEvent;
}
namespace UnityEngine {
class AnimationCurve;
}
namespace UnityEngine {
struct Color;
}
namespace UnityEngine {
struct Keyframe;
}
namespace UnityEngine {
struct Quaternion;
}
namespace UnityEngine {
class Transform;
}
namespace UnityEngine {
struct Vector3;
}
// Forward declare root types
namespace GlobalNamespace {
struct __IKSolverVR__Arm__ShoulderRotationMode;
}
namespace RootMotion::FinalIK {
struct __IKSolverVR__PositionOffset;
}
namespace RootMotion::FinalIK {
struct __IKSolverVR__RotationOffset;
}
namespace RootMotion::FinalIK {
class IKSolverVR;
}
namespace RootMotion::FinalIK {
class __IKSolverVR__Arm;
}
namespace RootMotion::FinalIK {
class __IKSolverVR__BodyPart;
}
namespace RootMotion::FinalIK {
class __IKSolverVR__Footstep;
}
namespace RootMotion::FinalIK {
class __IKSolverVR__Leg;
}
namespace RootMotion::FinalIK {
class __IKSolverVR__Locomotion;
}
namespace RootMotion::FinalIK {
class __IKSolverVR__Spine;
}
namespace RootMotion::FinalIK {
class __IKSolverVR__VirtualBone;
}
// Write type traits
MARK_VAL_T(::GlobalNamespace::__IKSolverVR__Arm__ShoulderRotationMode);
MARK_VAL_T(::RootMotion::FinalIK::__IKSolverVR__PositionOffset);
MARK_VAL_T(::RootMotion::FinalIK::__IKSolverVR__RotationOffset);
MARK_REF_PTR_T(::RootMotion::FinalIK::IKSolverVR);
MARK_REF_PTR_T(::RootMotion::FinalIK::__IKSolverVR__Arm);
MARK_REF_PTR_T(::RootMotion::FinalIK::__IKSolverVR__BodyPart);
MARK_REF_PTR_T(::RootMotion::FinalIK::__IKSolverVR__Footstep);
MARK_REF_PTR_T(::RootMotion::FinalIK::__IKSolverVR__Leg);
MARK_REF_PTR_T(::RootMotion::FinalIK::__IKSolverVR__Locomotion);
MARK_REF_PTR_T(::RootMotion::FinalIK::__IKSolverVR__Spine);
MARK_REF_PTR_T(::RootMotion::FinalIK::__IKSolverVR__VirtualBone);
// Type: ::ShoulderRotationMode
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: true
// CS Name: ::IKSolverVR::Arm::ShoulderRotationMode
struct CORDL_TYPE __IKSolverVR__Arm__ShoulderRotationMode {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____IKSolverVR__Arm__ShoulderRotationMode_Unwrapped
  enum struct ____IKSolverVR__Arm__ShoulderRotationMode_Unwrapped : int32_t {
    __E_YawPitch = static_cast<int32_t>(0x0),
    __E_FromTo = static_cast<int32_t>(0x1),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____IKSolverVR__Arm__ShoulderRotationMode_Unwrapped() const noexcept {
    return static_cast<____IKSolverVR__Arm__ShoulderRotationMode_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __IKSolverVR__Arm__ShoulderRotationMode();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __IKSolverVR__Arm__ShoulderRotationMode(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field FromTo value: static_cast<int32_t>(0x1)
  static ::GlobalNamespace::__IKSolverVR__Arm__ShoulderRotationMode const FromTo;

  /// @brief Field YawPitch value: static_cast<int32_t>(0x0)
  static ::GlobalNamespace::__IKSolverVR__Arm__ShoulderRotationMode const YawPitch;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__IKSolverVR__Arm__ShoulderRotationMode, 0x4>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__IKSolverVR__Arm__ShoulderRotationMode, value__) == 0x0, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::BodyPart
// SizeInfo { instance_size: 72, native_size: -1, calculated_instance_size: 72, calculated_native_size: 72, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace RootMotion::FinalIK {
// Is value type: false
// CS Name: ::IKSolverVR::BodyPart*
class CORDL_TYPE __IKSolverVR__BodyPart : public ::System::Object {
public:
  // Declarations
  /// @brief Field LOD, offset 0x44, size 0x4
  __declspec(property(get = __cordl_internal_get_LOD, put = __cordl_internal_set_LOD)) int32_t LOD;

  /// @brief Field <mag>k__BackingField, offset 0x14, size 0x4
  __declspec(property(get = __cordl_internal_get__mag_k__BackingField, put = __cordl_internal_set__mag_k__BackingField)) float_t _mag_k__BackingField;

  /// @brief Field <sqrMag>k__BackingField, offset 0x10, size 0x4
  __declspec(property(get = __cordl_internal_get__sqrMag_k__BackingField, put = __cordl_internal_set__sqrMag_k__BackingField)) float_t _sqrMag_k__BackingField;

  /// @brief Field bones, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_bones,
                      put = __cordl_internal_set_bones))::ArrayW<::RootMotion::FinalIK::__IKSolverVR__VirtualBone*, ::Array<::RootMotion::FinalIK::__IKSolverVR__VirtualBone*>*> bones;

  /// @brief Field index, offset 0x40, size 0x4
  __declspec(property(get = __cordl_internal_get_index, put = __cordl_internal_set_index)) int32_t index;

  /// @brief Field initiated, offset 0x20, size 0x1
  __declspec(property(get = __cordl_internal_get_initiated, put = __cordl_internal_set_initiated)) bool initiated;

  __declspec(property(get = get_mag, put = set_mag)) float_t mag;

  /// @brief Field rootPosition, offset 0x24, size 0xc
  __declspec(property(get = __cordl_internal_get_rootPosition, put = __cordl_internal_set_rootPosition))::UnityEngine::Vector3 rootPosition;

  /// @brief Field rootRotation, offset 0x30, size 0x10
  __declspec(property(get = __cordl_internal_get_rootRotation, put = __cordl_internal_set_rootRotation))::UnityEngine::Quaternion rootRotation;

  __declspec(property(get = get_sqrMag, put = set_sqrMag)) float_t sqrMag;

  /// @brief Method ApplyOffsets, addr 0x0, size 0xffffffffffffffff, virtual true, abstract: true, final false
  inline void ApplyOffsets();

  /// @brief Method MovePosition, addr 0x1355390, size 0x88, virtual false, abstract: false, final false
  inline void MovePosition(::UnityEngine::Vector3 position);

  /// @brief Method MoveRotation, addr 0x1355418, size 0x98, virtual false, abstract: false, final false
  inline void MoveRotation(::UnityEngine::Quaternion rotation);

  static inline ::RootMotion::FinalIK::__IKSolverVR__BodyPart* New_ctor();

  /// @brief Method OnRead, addr 0x0, size 0xffffffffffffffff, virtual true, abstract: true, final false
  inline void OnRead(::ArrayW<::UnityEngine::Vector3, ::Array<::UnityEngine::Vector3>*> positions, ::ArrayW<::UnityEngine::Quaternion, ::Array<::UnityEngine::Quaternion>*> rotations, bool hasChest,
                     bool hasNeck, bool hasShoulders, bool hasToes, bool hasLegs, int32_t rootIndex, int32_t index);

  /// @brief Method PreSolve, addr 0x0, size 0xffffffffffffffff, virtual true, abstract: true, final false
  inline void PreSolve();

  /// @brief Method Read, addr 0x1346788, size 0xc0, virtual false, abstract: false, final false
  inline void Read(::ArrayW<::UnityEngine::Vector3, ::Array<::UnityEngine::Vector3>*> positions, ::ArrayW<::UnityEngine::Quaternion, ::Array<::UnityEngine::Quaternion>*> rotations, bool hasChest,
                   bool hasNeck, bool hasShoulders, bool hasToes, bool hasLegs, int32_t rootIndex, int32_t index);

  /// @brief Method ResetOffsets, addr 0x0, size 0xffffffffffffffff, virtual true, abstract: true, final false
  inline void ResetOffsets();

  /// @brief Method RotateTo, addr 0x1354dec, size 0x168, virtual false, abstract: false, final false
  inline void RotateTo(::RootMotion::FinalIK::__IKSolverVR__VirtualBone* bone, ::UnityEngine::Quaternion rotation, float_t weight);

  /// @brief Method SetLOD, addr 0x1355388, size 0x8, virtual false, abstract: false, final false
  inline void SetLOD(int32_t LOD);

  /// @brief Method Translate, addr 0x13554b0, size 0x48, virtual false, abstract: false, final false
  inline void Translate(::UnityEngine::Vector3 position, ::UnityEngine::Quaternion rotation);

  /// @brief Method TranslateRoot, addr 0x1351658, size 0x128, virtual false, abstract: false, final false
  inline void TranslateRoot(::UnityEngine::Vector3 newRootPos, ::UnityEngine::Quaternion newRootRot);

  /// @brief Method Visualize, addr 0x135561c, size 0x14, virtual false, abstract: false, final false
  inline void Visualize();

  /// @brief Method Visualize, addr 0x13554f8, size 0x124, virtual false, abstract: false, final false
  inline void Visualize(::UnityEngine::Color color);

  /// @brief Method Write, addr 0x0, size 0xffffffffffffffff, virtual true, abstract: true, final false
  inline void Write(ByRef<::ArrayW<::UnityEngine::Vector3, ::Array<::UnityEngine::Vector3>*>> solvedPositions,
                    ByRef<::ArrayW<::UnityEngine::Quaternion, ::Array<::UnityEngine::Quaternion>*>> solvedRotations);

  constexpr int32_t const& __cordl_internal_get_LOD() const;

  constexpr int32_t& __cordl_internal_get_LOD();

  constexpr float_t const& __cordl_internal_get__mag_k__BackingField() const;

  constexpr float_t& __cordl_internal_get__mag_k__BackingField();

  constexpr float_t const& __cordl_internal_get__sqrMag_k__BackingField() const;

  constexpr float_t& __cordl_internal_get__sqrMag_k__BackingField();

  constexpr ::ArrayW<::RootMotion::FinalIK::__IKSolverVR__VirtualBone*, ::Array<::RootMotion::FinalIK::__IKSolverVR__VirtualBone*>*> const& __cordl_internal_get_bones() const;

  constexpr ::ArrayW<::RootMotion::FinalIK::__IKSolverVR__VirtualBone*, ::Array<::RootMotion::FinalIK::__IKSolverVR__VirtualBone*>*>& __cordl_internal_get_bones();

  constexpr int32_t const& __cordl_internal_get_index() const;

  constexpr int32_t& __cordl_internal_get_index();

  constexpr bool const& __cordl_internal_get_initiated() const;

  constexpr bool& __cordl_internal_get_initiated();

  constexpr ::UnityEngine::Vector3 const& __cordl_internal_get_rootPosition() const;

  constexpr ::UnityEngine::Vector3& __cordl_internal_get_rootPosition();

  constexpr ::UnityEngine::Quaternion const& __cordl_internal_get_rootRotation() const;

  constexpr ::UnityEngine::Quaternion& __cordl_internal_get_rootRotation();

  constexpr void __cordl_internal_set_LOD(int32_t value);

  constexpr void __cordl_internal_set__mag_k__BackingField(float_t value);

  constexpr void __cordl_internal_set__sqrMag_k__BackingField(float_t value);

  constexpr void __cordl_internal_set_bones(::ArrayW<::RootMotion::FinalIK::__IKSolverVR__VirtualBone*, ::Array<::RootMotion::FinalIK::__IKSolverVR__VirtualBone*>*> value);

  constexpr void __cordl_internal_set_index(int32_t value);

  constexpr void __cordl_internal_set_initiated(bool value);

  constexpr void __cordl_internal_set_rootPosition(::UnityEngine::Vector3 value);

  constexpr void __cordl_internal_set_rootRotation(::UnityEngine::Quaternion value);

  /// @brief Method .ctor, addr 0x13552d0, size 0x98, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_mag, addr 0x1355378, size 0x8, virtual false, abstract: false, final false
  inline float_t get_mag();

  /// @brief Method get_sqrMag, addr 0x1355368, size 0x8, virtual false, abstract: false, final false
  inline float_t get_sqrMag();

  /// @brief Method set_mag, addr 0x1355380, size 0x8, virtual false, abstract: false, final false
  inline void set_mag(float_t value);

  /// @brief Method set_sqrMag, addr 0x1355370, size 0x8, virtual false, abstract: false, final false
  inline void set_sqrMag(float_t value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __IKSolverVR__BodyPart();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__IKSolverVR__BodyPart", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __IKSolverVR__BodyPart(__IKSolverVR__BodyPart&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__IKSolverVR__BodyPart", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __IKSolverVR__BodyPart(__IKSolverVR__BodyPart const&) = delete;

  /// @brief Field <sqrMag>k__BackingField, offset: 0x10, size: 0x4, def value: None
  float_t ____sqrMag_k__BackingField;

  /// @brief Field <mag>k__BackingField, offset: 0x14, size: 0x4, def value: None
  float_t ____mag_k__BackingField;

  /// @brief Field bones, offset: 0x18, size: 0x8, def value: None
  ::ArrayW<::RootMotion::FinalIK::__IKSolverVR__VirtualBone*, ::Array<::RootMotion::FinalIK::__IKSolverVR__VirtualBone*>*> ___bones;

  /// @brief Field initiated, offset: 0x20, size: 0x1, def value: None
  bool ___initiated;

  /// @brief Field rootPosition, offset: 0x24, size: 0xc, def value: None
  ::UnityEngine::Vector3 ___rootPosition;

  /// @brief Field rootRotation, offset: 0x30, size: 0x10, def value: None
  ::UnityEngine::Quaternion ___rootRotation;

  /// @brief Field index, offset: 0x40, size: 0x4, def value: None
  int32_t ___index;

  /// @brief Field LOD, offset: 0x44, size: 0x4, def value: None
  int32_t ___LOD;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::RootMotion::FinalIK::__IKSolverVR__BodyPart, 0x48>, "Size mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__BodyPart, ____sqrMag_k__BackingField) == 0x10, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__BodyPart, ____mag_k__BackingField) == 0x14, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__BodyPart, ___bones) == 0x18, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__BodyPart, ___initiated) == 0x20, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__BodyPart, ___rootPosition) == 0x24, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__BodyPart, ___rootRotation) == 0x30, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__BodyPart, ___index) == 0x40, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__BodyPart, ___LOD) == 0x44, "Offset mismatch!");

} // namespace RootMotion::FinalIK
// Type: ::Arm
// SizeInfo { instance_size: 328, native_size: -1, calculated_instance_size: 328, calculated_native_size: 328, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace RootMotion::FinalIK {
// Is value type: false
// CS Name: ::IKSolverVR::Arm*
class CORDL_TYPE __IKSolverVR__Arm : public ::RootMotion::FinalIK::__IKSolverVR__BodyPart {
public:
  // Declarations
  using ShoulderRotationMode = ::GlobalNamespace::__IKSolverVR__Arm__ShoulderRotationMode;

  /// @brief Field IKPosition, offset 0x98, size 0xc
  __declspec(property(get = __cordl_internal_get_IKPosition, put = __cordl_internal_set_IKPosition))::UnityEngine::Vector3 IKPosition;

  /// @brief Field IKRotation, offset 0xa4, size 0x10
  __declspec(property(get = __cordl_internal_get_IKRotation, put = __cordl_internal_set_IKRotation))::UnityEngine::Quaternion IKRotation;

  /// @brief Field <position>k__BackingField, offset 0xcc, size 0xc
  __declspec(property(get = __cordl_internal_get__position_k__BackingField, put = __cordl_internal_set__position_k__BackingField))::UnityEngine::Vector3 _position_k__BackingField;

  /// @brief Field <rotation>k__BackingField, offset 0xd8, size 0x10
  __declspec(property(get = __cordl_internal_get__rotation_k__BackingField, put = __cordl_internal_set__rotation_k__BackingField))::UnityEngine::Quaternion _rotation_k__BackingField;

  /// @brief Field armLengthMlp, offset 0x8c, size 0x4
  __declspec(property(get = __cordl_internal_get_armLengthMlp, put = __cordl_internal_set_armLengthMlp)) float_t armLengthMlp;

  /// @brief Field bendDirection, offset 0xb4, size 0xc
  __declspec(property(get = __cordl_internal_get_bendDirection, put = __cordl_internal_set_bendDirection))::UnityEngine::Vector3 bendDirection;

  /// @brief Field bendGoal, offset 0x50, size 0x8
  __declspec(property(get = __cordl_internal_get_bendGoal, put = __cordl_internal_set_bendGoal))::UnityW<::UnityEngine::Transform> bendGoal;

  /// @brief Field bendGoalWeight, offset 0x6c, size 0x4
  __declspec(property(get = __cordl_internal_get_bendGoalWeight, put = __cordl_internal_set_bendGoalWeight)) float_t bendGoalWeight;

  /// @brief Field chestForward, offset 0x114, size 0xc
  __declspec(property(get = __cordl_internal_get_chestForward, put = __cordl_internal_set_chestForward))::UnityEngine::Vector3 chestForward;

  /// @brief Field chestForwardAxis, offset 0xec, size 0xc
  __declspec(property(get = __cordl_internal_get_chestForwardAxis, put = __cordl_internal_set_chestForwardAxis))::UnityEngine::Vector3 chestForwardAxis;

  /// @brief Field chestRotation, offset 0x104, size 0x10
  __declspec(property(get = __cordl_internal_get_chestRotation, put = __cordl_internal_set_chestRotation))::UnityEngine::Quaternion chestRotation;

  /// @brief Field chestUp, offset 0x120, size 0xc
  __declspec(property(get = __cordl_internal_get_chestUp, put = __cordl_internal_set_chestUp))::UnityEngine::Vector3 chestUp;

  /// @brief Field chestUpAxis, offset 0xf8, size 0xc
  __declspec(property(get = __cordl_internal_get_chestUpAxis, put = __cordl_internal_set_chestUpAxis))::UnityEngine::Vector3 chestUpAxis;

  __declspec(property(get = get_forearm))::RootMotion::FinalIK::__IKSolverVR__VirtualBone* forearm;

  /// @brief Field forearmRelToUpperArm, offset 0x12c, size 0x10
  __declspec(property(get = __cordl_internal_get_forearmRelToUpperArm, put = __cordl_internal_set_forearmRelToUpperArm))::UnityEngine::Quaternion forearmRelToUpperArm;

  __declspec(property(get = get_hand))::RootMotion::FinalIK::__IKSolverVR__VirtualBone* hand;

  /// @brief Field handPositionOffset, offset 0xc0, size 0xc
  __declspec(property(get = __cordl_internal_get_handPositionOffset, put = __cordl_internal_set_handPositionOffset))::UnityEngine::Vector3 handPositionOffset;

  /// @brief Field hasShoulder, offset 0xe8, size 0x1
  __declspec(property(get = __cordl_internal_get_hasShoulder, put = __cordl_internal_set_hasShoulder)) bool hasShoulder;

  /// @brief Field palmToThumbAxis, offset 0x80, size 0xc
  __declspec(property(get = __cordl_internal_get_palmToThumbAxis, put = __cordl_internal_set_palmToThumbAxis))::UnityEngine::Vector3 palmToThumbAxis;

  __declspec(property(get = get_position, put = set_position))::UnityEngine::Vector3 position;

  /// @brief Field positionWeight, offset 0x58, size 0x4
  __declspec(property(get = __cordl_internal_get_positionWeight, put = __cordl_internal_set_positionWeight)) float_t positionWeight;

  __declspec(property(get = get_rotation, put = set_rotation))::UnityEngine::Quaternion rotation;

  /// @brief Field rotationWeight, offset 0x5c, size 0x4
  __declspec(property(get = __cordl_internal_get_rotationWeight, put = __cordl_internal_set_rotationWeight)) float_t rotationWeight;

  __declspec(property(get = get_shoulder))::RootMotion::FinalIK::__IKSolverVR__VirtualBone* shoulder;

  /// @brief Field shoulderRotationMode, offset 0x60, size 0x4
  __declspec(property(get = __cordl_internal_get_shoulderRotationMode, put = __cordl_internal_set_shoulderRotationMode))::GlobalNamespace::__IKSolverVR__Arm__ShoulderRotationMode shoulderRotationMode;

  /// @brief Field shoulderRotationWeight, offset 0x64, size 0x4
  __declspec(property(get = __cordl_internal_get_shoulderRotationWeight, put = __cordl_internal_set_shoulderRotationWeight)) float_t shoulderRotationWeight;

  /// @brief Field shoulderTwistWeight, offset 0x68, size 0x4
  __declspec(property(get = __cordl_internal_get_shoulderTwistWeight, put = __cordl_internal_set_shoulderTwistWeight)) float_t shoulderTwistWeight;

  /// @brief Field stretchCurve, offset 0x90, size 0x8
  __declspec(property(get = __cordl_internal_get_stretchCurve, put = __cordl_internal_set_stretchCurve))::UnityEngine::AnimationCurve* stretchCurve;

  /// @brief Field swivelOffset, offset 0x70, size 0x4
  __declspec(property(get = __cordl_internal_get_swivelOffset, put = __cordl_internal_set_swivelOffset)) float_t swivelOffset;

  /// @brief Field target, offset 0x48, size 0x8
  __declspec(property(get = __cordl_internal_get_target, put = __cordl_internal_set_target))::UnityW<::UnityEngine::Transform> target;

  __declspec(property(get = get_upperArm))::RootMotion::FinalIK::__IKSolverVR__VirtualBone* upperArm;

  /// @brief Field upperArmBendAxis, offset 0x13c, size 0xc
  __declspec(property(get = __cordl_internal_get_upperArmBendAxis, put = __cordl_internal_set_upperArmBendAxis))::UnityEngine::Vector3 upperArmBendAxis;

  /// @brief Field wristToPalmAxis, offset 0x74, size 0xc
  __declspec(property(get = __cordl_internal_get_wristToPalmAxis, put = __cordl_internal_set_wristToPalmAxis))::UnityEngine::Vector3 wristToPalmAxis;

  /// @brief Method ApplyOffsets, addr 0x13544fc, size 0x24, virtual true, abstract: false, final false
  inline void ApplyOffsets();

  /// @brief Method DamperValue, addr 0x1354870, size 0x80, virtual false, abstract: false, final false
  inline float_t DamperValue(float_t value, float_t min, float_t max, float_t weight);

  /// @brief Method GetBendNormal, addr 0x13548f0, size 0x4fc, virtual false, abstract: false, final false
  inline ::UnityEngine::Vector3 GetBendNormal(::UnityEngine::Vector3 dir);

  static inline ::RootMotion::FinalIK::__IKSolverVR__Arm* New_ctor();

  /// @brief Method OnRead, addr 0x1353a0c, size 0x844, virtual true, abstract: false, final false
  inline void OnRead(::ArrayW<::UnityEngine::Vector3, ::Array<::UnityEngine::Vector3>*> positions, ::ArrayW<::UnityEngine::Quaternion, ::Array<::UnityEngine::Quaternion>*> rotations, bool hasChest,
                     bool hasNeck, bool hasShoulders, bool hasToes, bool hasLegs, int32_t rootIndex, int32_t index);

  /// @brief Method PreSolve, addr 0x1354250, size 0x2ac, virtual true, abstract: false, final false
  inline void PreSolve();

  /// @brief Method ResetOffsets, addr 0x1354f54, size 0x58, virtual true, abstract: false, final false
  inline void ResetOffsets();

  /// @brief Method Solve, addr 0x1351780, size 0x15e4, virtual false, abstract: false, final false
  inline void Solve(bool isLeft);

  /// @brief Method Stretching, addr 0x1354520, size 0x350, virtual false, abstract: false, final false
  inline void Stretching();

  /// @brief Method Visualize, addr 0x13551b8, size 0x118, virtual false, abstract: false, final false
  inline void Visualize(::RootMotion::FinalIK::__IKSolverVR__VirtualBone* bone1, ::RootMotion::FinalIK::__IKSolverVR__VirtualBone* bone2, ::RootMotion::FinalIK::__IKSolverVR__VirtualBone* bone3,
                        ::UnityEngine::Color color);

  /// @brief Method Write, addr 0x1354fac, size 0x20c, virtual true, abstract: false, final false
  inline void Write(ByRef<::ArrayW<::UnityEngine::Vector3, ::Array<::UnityEngine::Vector3>*>> solvedPositions,
                    ByRef<::ArrayW<::UnityEngine::Quaternion, ::Array<::UnityEngine::Quaternion>*>> solvedRotations);

  constexpr ::UnityEngine::Vector3 const& __cordl_internal_get_IKPosition() const;

  constexpr ::UnityEngine::Vector3& __cordl_internal_get_IKPosition();

  constexpr ::UnityEngine::Quaternion const& __cordl_internal_get_IKRotation() const;

  constexpr ::UnityEngine::Quaternion& __cordl_internal_get_IKRotation();

  constexpr ::UnityEngine::Vector3 const& __cordl_internal_get__position_k__BackingField() const;

  constexpr ::UnityEngine::Vector3& __cordl_internal_get__position_k__BackingField();

  constexpr ::UnityEngine::Quaternion const& __cordl_internal_get__rotation_k__BackingField() const;

  constexpr ::UnityEngine::Quaternion& __cordl_internal_get__rotation_k__BackingField();

  constexpr float_t const& __cordl_internal_get_armLengthMlp() const;

  constexpr float_t& __cordl_internal_get_armLengthMlp();

  constexpr ::UnityEngine::Vector3 const& __cordl_internal_get_bendDirection() const;

  constexpr ::UnityEngine::Vector3& __cordl_internal_get_bendDirection();

  constexpr ::UnityW<::UnityEngine::Transform> const& __cordl_internal_get_bendGoal() const;

  constexpr ::UnityW<::UnityEngine::Transform>& __cordl_internal_get_bendGoal();

  constexpr float_t const& __cordl_internal_get_bendGoalWeight() const;

  constexpr float_t& __cordl_internal_get_bendGoalWeight();

  constexpr ::UnityEngine::Vector3 const& __cordl_internal_get_chestForward() const;

  constexpr ::UnityEngine::Vector3& __cordl_internal_get_chestForward();

  constexpr ::UnityEngine::Vector3 const& __cordl_internal_get_chestForwardAxis() const;

  constexpr ::UnityEngine::Vector3& __cordl_internal_get_chestForwardAxis();

  constexpr ::UnityEngine::Quaternion const& __cordl_internal_get_chestRotation() const;

  constexpr ::UnityEngine::Quaternion& __cordl_internal_get_chestRotation();

  constexpr ::UnityEngine::Vector3 const& __cordl_internal_get_chestUp() const;

  constexpr ::UnityEngine::Vector3& __cordl_internal_get_chestUp();

  constexpr ::UnityEngine::Vector3 const& __cordl_internal_get_chestUpAxis() const;

  constexpr ::UnityEngine::Vector3& __cordl_internal_get_chestUpAxis();

  constexpr ::UnityEngine::Quaternion const& __cordl_internal_get_forearmRelToUpperArm() const;

  constexpr ::UnityEngine::Quaternion& __cordl_internal_get_forearmRelToUpperArm();

  constexpr ::UnityEngine::Vector3 const& __cordl_internal_get_handPositionOffset() const;

  constexpr ::UnityEngine::Vector3& __cordl_internal_get_handPositionOffset();

  constexpr bool const& __cordl_internal_get_hasShoulder() const;

  constexpr bool& __cordl_internal_get_hasShoulder();

  constexpr ::UnityEngine::Vector3 const& __cordl_internal_get_palmToThumbAxis() const;

  constexpr ::UnityEngine::Vector3& __cordl_internal_get_palmToThumbAxis();

  constexpr float_t const& __cordl_internal_get_positionWeight() const;

  constexpr float_t& __cordl_internal_get_positionWeight();

  constexpr float_t const& __cordl_internal_get_rotationWeight() const;

  constexpr float_t& __cordl_internal_get_rotationWeight();

  constexpr ::GlobalNamespace::__IKSolverVR__Arm__ShoulderRotationMode const& __cordl_internal_get_shoulderRotationMode() const;

  constexpr ::GlobalNamespace::__IKSolverVR__Arm__ShoulderRotationMode& __cordl_internal_get_shoulderRotationMode();

  constexpr float_t const& __cordl_internal_get_shoulderRotationWeight() const;

  constexpr float_t& __cordl_internal_get_shoulderRotationWeight();

  constexpr float_t const& __cordl_internal_get_shoulderTwistWeight() const;

  constexpr float_t& __cordl_internal_get_shoulderTwistWeight();

  constexpr ::UnityEngine::AnimationCurve*& __cordl_internal_get_stretchCurve();

  constexpr ::cordl_internals::to_const_pointer<::UnityEngine::AnimationCurve*> const& __cordl_internal_get_stretchCurve() const;

  constexpr float_t const& __cordl_internal_get_swivelOffset() const;

  constexpr float_t& __cordl_internal_get_swivelOffset();

  constexpr ::UnityW<::UnityEngine::Transform> const& __cordl_internal_get_target() const;

  constexpr ::UnityW<::UnityEngine::Transform>& __cordl_internal_get_target();

  constexpr ::UnityEngine::Vector3 const& __cordl_internal_get_upperArmBendAxis() const;

  constexpr ::UnityEngine::Vector3& __cordl_internal_get_upperArmBendAxis();

  constexpr ::UnityEngine::Vector3 const& __cordl_internal_get_wristToPalmAxis() const;

  constexpr ::UnityEngine::Vector3& __cordl_internal_get_wristToPalmAxis();

  constexpr void __cordl_internal_set_IKPosition(::UnityEngine::Vector3 value);

  constexpr void __cordl_internal_set_IKRotation(::UnityEngine::Quaternion value);

  constexpr void __cordl_internal_set__position_k__BackingField(::UnityEngine::Vector3 value);

  constexpr void __cordl_internal_set__rotation_k__BackingField(::UnityEngine::Quaternion value);

  constexpr void __cordl_internal_set_armLengthMlp(float_t value);

  constexpr void __cordl_internal_set_bendDirection(::UnityEngine::Vector3 value);

  constexpr void __cordl_internal_set_bendGoal(::UnityW<::UnityEngine::Transform> value);

  constexpr void __cordl_internal_set_bendGoalWeight(float_t value);

  constexpr void __cordl_internal_set_chestForward(::UnityEngine::Vector3 value);

  constexpr void __cordl_internal_set_chestForwardAxis(::UnityEngine::Vector3 value);

  constexpr void __cordl_internal_set_chestRotation(::UnityEngine::Quaternion value);

  constexpr void __cordl_internal_set_chestUp(::UnityEngine::Vector3 value);

  constexpr void __cordl_internal_set_chestUpAxis(::UnityEngine::Vector3 value);

  constexpr void __cordl_internal_set_forearmRelToUpperArm(::UnityEngine::Quaternion value);

  constexpr void __cordl_internal_set_handPositionOffset(::UnityEngine::Vector3 value);

  constexpr void __cordl_internal_set_hasShoulder(bool value);

  constexpr void __cordl_internal_set_palmToThumbAxis(::UnityEngine::Vector3 value);

  constexpr void __cordl_internal_set_positionWeight(float_t value);

  constexpr void __cordl_internal_set_rotationWeight(float_t value);

  constexpr void __cordl_internal_set_shoulderRotationMode(::GlobalNamespace::__IKSolverVR__Arm__ShoulderRotationMode value);

  constexpr void __cordl_internal_set_shoulderRotationWeight(float_t value);

  constexpr void __cordl_internal_set_shoulderTwistWeight(float_t value);

  constexpr void __cordl_internal_set_stretchCurve(::UnityEngine::AnimationCurve* value);

  constexpr void __cordl_internal_set_swivelOffset(float_t value);

  constexpr void __cordl_internal_set_target(::UnityW<::UnityEngine::Transform> value);

  constexpr void __cordl_internal_set_upperArmBendAxis(::UnityEngine::Vector3 value);

  constexpr void __cordl_internal_set_wristToPalmAxis(::UnityEngine::Vector3 value);

  /// @brief Method .ctor, addr 0x1353688, size 0x18c, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_forearm, addr 0x135398c, size 0x40, virtual false, abstract: false, final false
  inline ::RootMotion::FinalIK::__IKSolverVR__VirtualBone* get_forearm();

  /// @brief Method get_hand, addr 0x13539cc, size 0x40, virtual false, abstract: false, final false
  inline ::RootMotion::FinalIK::__IKSolverVR__VirtualBone* get_hand();

  /// @brief Method get_position, addr 0x1353900, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::Vector3 get_position();

  /// @brief Method get_rotation, addr 0x1353918, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::Quaternion get_rotation();

  /// @brief Method get_shoulder, addr 0x1353930, size 0x28, virtual false, abstract: false, final false
  inline ::RootMotion::FinalIK::__IKSolverVR__VirtualBone* get_shoulder();

  /// @brief Method get_upperArm, addr 0x1353958, size 0x34, virtual false, abstract: false, final false
  inline ::RootMotion::FinalIK::__IKSolverVR__VirtualBone* get_upperArm();

  /// @brief Method set_position, addr 0x135390c, size 0xc, virtual false, abstract: false, final false
  inline void set_position(::UnityEngine::Vector3 value);

  /// @brief Method set_rotation, addr 0x1353924, size 0xc, virtual false, abstract: false, final false
  inline void set_rotation(::UnityEngine::Quaternion value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __IKSolverVR__Arm();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__IKSolverVR__Arm", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __IKSolverVR__Arm(__IKSolverVR__Arm&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__IKSolverVR__Arm", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __IKSolverVR__Arm(__IKSolverVR__Arm const&) = delete;

  /// @brief Field target, offset: 0x48, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Transform> ___target;

  /// @brief Field bendGoal, offset: 0x50, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Transform> ___bendGoal;

  /// @brief Field positionWeight, offset: 0x58, size: 0x4, def value: None
  float_t ___positionWeight;

  /// @brief Field rotationWeight, offset: 0x5c, size: 0x4, def value: None
  float_t ___rotationWeight;

  /// @brief Field shoulderRotationMode, offset: 0x60, size: 0x4, def value: None
  ::GlobalNamespace::__IKSolverVR__Arm__ShoulderRotationMode ___shoulderRotationMode;

  /// @brief Field shoulderRotationWeight, offset: 0x64, size: 0x4, def value: None
  float_t ___shoulderRotationWeight;

  /// @brief Field shoulderTwistWeight, offset: 0x68, size: 0x4, def value: None
  float_t ___shoulderTwistWeight;

  /// @brief Field bendGoalWeight, offset: 0x6c, size: 0x4, def value: None
  float_t ___bendGoalWeight;

  /// @brief Field swivelOffset, offset: 0x70, size: 0x4, def value: None
  float_t ___swivelOffset;

  /// @brief Field wristToPalmAxis, offset: 0x74, size: 0xc, def value: None
  ::UnityEngine::Vector3 ___wristToPalmAxis;

  /// @brief Field palmToThumbAxis, offset: 0x80, size: 0xc, def value: None
  ::UnityEngine::Vector3 ___palmToThumbAxis;

  /// @brief Field armLengthMlp, offset: 0x8c, size: 0x4, def value: None
  float_t ___armLengthMlp;

  /// @brief Field stretchCurve, offset: 0x90, size: 0x8, def value: None
  ::UnityEngine::AnimationCurve* ___stretchCurve;

  /// @brief Field IKPosition, offset: 0x98, size: 0xc, def value: None
  ::UnityEngine::Vector3 ___IKPosition;

  /// @brief Field IKRotation, offset: 0xa4, size: 0x10, def value: None
  ::UnityEngine::Quaternion ___IKRotation;

  /// @brief Field bendDirection, offset: 0xb4, size: 0xc, def value: None
  ::UnityEngine::Vector3 ___bendDirection;

  /// @brief Field handPositionOffset, offset: 0xc0, size: 0xc, def value: None
  ::UnityEngine::Vector3 ___handPositionOffset;

  /// @brief Field <position>k__BackingField, offset: 0xcc, size: 0xc, def value: None
  ::UnityEngine::Vector3 ____position_k__BackingField;

  /// @brief Field <rotation>k__BackingField, offset: 0xd8, size: 0x10, def value: None
  ::UnityEngine::Quaternion ____rotation_k__BackingField;

  /// @brief Field hasShoulder, offset: 0xe8, size: 0x1, def value: None
  bool ___hasShoulder;

  /// @brief Field chestForwardAxis, offset: 0xec, size: 0xc, def value: None
  ::UnityEngine::Vector3 ___chestForwardAxis;

  /// @brief Field chestUpAxis, offset: 0xf8, size: 0xc, def value: None
  ::UnityEngine::Vector3 ___chestUpAxis;

  /// @brief Field chestRotation, offset: 0x104, size: 0x10, def value: None
  ::UnityEngine::Quaternion ___chestRotation;

  /// @brief Field chestForward, offset: 0x114, size: 0xc, def value: None
  ::UnityEngine::Vector3 ___chestForward;

  /// @brief Field chestUp, offset: 0x120, size: 0xc, def value: None
  ::UnityEngine::Vector3 ___chestUp;

  /// @brief Field forearmRelToUpperArm, offset: 0x12c, size: 0x10, def value: None
  ::UnityEngine::Quaternion ___forearmRelToUpperArm;

  /// @brief Field upperArmBendAxis, offset: 0x13c, size: 0xc, def value: None
  ::UnityEngine::Vector3 ___upperArmBendAxis;

  /// @brief Field pitchOffsetAngle offset 0xffffffff size 0x4
  static constexpr float_t pitchOffsetAngle{ -30.0 };

  /// @brief Field yawOffsetAngle offset 0xffffffff size 0x4
  static constexpr float_t yawOffsetAngle{ 45.0 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::RootMotion::FinalIK::__IKSolverVR__Arm, 0x148>, "Size mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___target) == 0x48, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___bendGoal) == 0x50, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___positionWeight) == 0x58, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___rotationWeight) == 0x5c, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___shoulderRotationMode) == 0x60, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___shoulderRotationWeight) == 0x64, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___shoulderTwistWeight) == 0x68, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___bendGoalWeight) == 0x6c, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___swivelOffset) == 0x70, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___wristToPalmAxis) == 0x74, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___palmToThumbAxis) == 0x80, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___armLengthMlp) == 0x8c, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___stretchCurve) == 0x90, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___IKPosition) == 0x98, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___IKRotation) == 0xa4, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___bendDirection) == 0xb4, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___handPositionOffset) == 0xc0, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ____position_k__BackingField) == 0xcc, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ____rotation_k__BackingField) == 0xd8, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___hasShoulder) == 0xe8, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___chestForwardAxis) == 0xec, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___chestUpAxis) == 0xf8, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___chestRotation) == 0x104, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___chestForward) == 0x114, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___chestUp) == 0x120, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___forearmRelToUpperArm) == 0x12c, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Arm, ___upperArmBendAxis) == 0x13c, "Offset mismatch!");

} // namespace RootMotion::FinalIK
// Type: ::Footstep
// SizeInfo { instance_size: 168, native_size: -1, calculated_instance_size: 168, calculated_native_size: 164, minimum_alignment: 8, natural_alignment: 4, packing: None, specified_packing: None }
namespace RootMotion::FinalIK {
// Is value type: false
// CS Name: ::IKSolverVR::Footstep*
class CORDL_TYPE __IKSolverVR__Footstep : public ::System::Object {
public:
  // Declarations
  /// @brief Field <stepProgress>k__BackingField, offset 0x50, size 0x4
  __declspec(property(get = __cordl_internal_get__stepProgress_k__BackingField, put = __cordl_internal_set__stepProgress_k__BackingField)) float_t _stepProgress_k__BackingField;

  /// @brief Field characterSpaceOffset, offset 0x14, size 0xc
  __declspec(property(get = __cordl_internal_get_characterSpaceOffset, put = __cordl_internal_set_characterSpaceOffset))::UnityEngine::Vector3 characterSpaceOffset;

  /// @brief Field footRelativeToRoot, offset 0x8c, size 0x10
  __declspec(property(get = __cordl_internal_get_footRelativeToRoot, put = __cordl_internal_set_footRelativeToRoot))::UnityEngine::Quaternion footRelativeToRoot;

  __declspec(property(get = get_isStepping)) bool isStepping;

  /// @brief Field isSupportLeg, offset 0x4c, size 0x1
  __declspec(property(get = __cordl_internal_get_isSupportLeg, put = __cordl_internal_set_isSupportLeg)) bool isSupportLeg;

  /// @brief Field position, offset 0x20, size 0xc
  __declspec(property(get = __cordl_internal_get_position, put = __cordl_internal_set_position))::UnityEngine::Vector3 position;

  /// @brief Field rotation, offset 0x2c, size 0x10
  __declspec(property(get = __cordl_internal_get_rotation, put = __cordl_internal_set_rotation))::UnityEngine::Quaternion rotation;

  /// @brief Field stepFrom, offset 0x54, size 0xc
  __declspec(property(get = __cordl_internal_get_stepFrom, put = __cordl_internal_set_stepFrom))::UnityEngine::Vector3 stepFrom;

  /// @brief Field stepFromRot, offset 0x6c, size 0x10
  __declspec(property(get = __cordl_internal_get_stepFromRot, put = __cordl_internal_set_stepFromRot))::UnityEngine::Quaternion stepFromRot;

  __declspec(property(get = get_stepProgress, put = set_stepProgress)) float_t stepProgress;

  /// @brief Field stepSpeed, offset 0x10, size 0x4
  __declspec(property(get = __cordl_internal_get_stepSpeed, put = __cordl_internal_set_stepSpeed)) float_t stepSpeed;

  /// @brief Field stepTo, offset 0x60, size 0xc
  __declspec(property(get = __cordl_internal_get_stepTo, put = __cordl_internal_set_stepTo))::UnityEngine::Vector3 stepTo;

  /// @brief Field stepToRootRot, offset 0x3c, size 0x10
  __declspec(property(get = __cordl_internal_get_stepToRootRot, put = __cordl_internal_set_stepToRootRot))::UnityEngine::Quaternion stepToRootRot;

  /// @brief Field stepToRot, offset 0x7c, size 0x10
  __declspec(property(get = __cordl_internal_get_stepToRot, put = __cordl_internal_set_stepToRot))::UnityEngine::Quaternion stepToRot;

  /// @brief Field supportLegW, offset 0x9c, size 0x4
  __declspec(property(get = __cordl_internal_get_supportLegW, put = __cordl_internal_set_supportLegW)) float_t supportLegW;

  /// @brief Field supportLegWV, offset 0xa0, size 0x4
  __declspec(property(get = __cordl_internal_get_supportLegWV, put = __cordl_internal_set_supportLegWV)) float_t supportLegWV;

  static inline ::RootMotion::FinalIK::__IKSolverVR__Footstep* New_ctor(::UnityEngine::Quaternion rootRotation, ::UnityEngine::Vector3 footPosition, ::UnityEngine::Quaternion footRotation,
                                                                        ::UnityEngine::Vector3 characterSpaceOffset);

  /// @brief Method Reset, addr 0x1355818, size 0x48, virtual false, abstract: false, final false
  inline void Reset(::UnityEngine::Quaternion rootRotation, ::UnityEngine::Vector3 footPosition, ::UnityEngine::Quaternion footRotation);

  /// @brief Method StepTo, addr 0x1355860, size 0x224, virtual false, abstract: false, final false
  inline void StepTo(::UnityEngine::Vector3 p, ::UnityEngine::Quaternion rootRotation, float_t stepThreshold);

  /// @brief Method Update, addr 0x1355e70, size 0x174, virtual false, abstract: false, final false
  inline void Update(::RootMotion::InterpolationMode interpolation, ::UnityEngine::Events::UnityEvent* onStep);

  /// @brief Method UpdateStanding, addr 0x1355c8c, size 0x1e4, virtual false, abstract: false, final false
  inline void UpdateStanding(::UnityEngine::Quaternion rootRotation, float_t minAngle, float_t speed);

  /// @brief Method UpdateStepping, addr 0x1355a84, size 0x208, virtual false, abstract: false, final false
  inline void UpdateStepping(::UnityEngine::Vector3 p, ::UnityEngine::Quaternion rootRotation, float_t speed);

  constexpr float_t const& __cordl_internal_get__stepProgress_k__BackingField() const;

  constexpr float_t& __cordl_internal_get__stepProgress_k__BackingField();

  constexpr ::UnityEngine::Vector3 const& __cordl_internal_get_characterSpaceOffset() const;

  constexpr ::UnityEngine::Vector3& __cordl_internal_get_characterSpaceOffset();

  constexpr ::UnityEngine::Quaternion const& __cordl_internal_get_footRelativeToRoot() const;

  constexpr ::UnityEngine::Quaternion& __cordl_internal_get_footRelativeToRoot();

  constexpr bool const& __cordl_internal_get_isSupportLeg() const;

  constexpr bool& __cordl_internal_get_isSupportLeg();

  constexpr ::UnityEngine::Vector3 const& __cordl_internal_get_position() const;

  constexpr ::UnityEngine::Vector3& __cordl_internal_get_position();

  constexpr ::UnityEngine::Quaternion const& __cordl_internal_get_rotation() const;

  constexpr ::UnityEngine::Quaternion& __cordl_internal_get_rotation();

  constexpr ::UnityEngine::Vector3 const& __cordl_internal_get_stepFrom() const;

  constexpr ::UnityEngine::Vector3& __cordl_internal_get_stepFrom();

  constexpr ::UnityEngine::Quaternion const& __cordl_internal_get_stepFromRot() const;

  constexpr ::UnityEngine::Quaternion& __cordl_internal_get_stepFromRot();

  constexpr float_t const& __cordl_internal_get_stepSpeed() const;

  constexpr float_t& __cordl_internal_get_stepSpeed();

  constexpr ::UnityEngine::Vector3 const& __cordl_internal_get_stepTo() const;

  constexpr ::UnityEngine::Vector3& __cordl_internal_get_stepTo();

  constexpr ::UnityEngine::Quaternion const& __cordl_internal_get_stepToRootRot() const;

  constexpr ::UnityEngine::Quaternion& __cordl_internal_get_stepToRootRot();

  constexpr ::UnityEngine::Quaternion const& __cordl_internal_get_stepToRot() const;

  constexpr ::UnityEngine::Quaternion& __cordl_internal_get_stepToRot();

  constexpr float_t const& __cordl_internal_get_supportLegW() const;

  constexpr float_t& __cordl_internal_get_supportLegW();

  constexpr float_t const& __cordl_internal_get_supportLegWV() const;

  constexpr float_t& __cordl_internal_get_supportLegWV();

  constexpr void __cordl_internal_set__stepProgress_k__BackingField(float_t value);

  constexpr void __cordl_internal_set_characterSpaceOffset(::UnityEngine::Vector3 value);

  constexpr void __cordl_internal_set_footRelativeToRoot(::UnityEngine::Quaternion value);

  constexpr void __cordl_internal_set_isSupportLeg(bool value);

  constexpr void __cordl_internal_set_position(::UnityEngine::Vector3 value);

  constexpr void __cordl_internal_set_rotation(::UnityEngine::Quaternion value);

  constexpr void __cordl_internal_set_stepFrom(::UnityEngine::Vector3 value);

  constexpr void __cordl_internal_set_stepFromRot(::UnityEngine::Quaternion value);

  constexpr void __cordl_internal_set_stepSpeed(float_t value);

  constexpr void __cordl_internal_set_stepTo(::UnityEngine::Vector3 value);

  constexpr void __cordl_internal_set_stepToRootRot(::UnityEngine::Quaternion value);

  constexpr void __cordl_internal_set_stepToRot(::UnityEngine::Quaternion value);

  constexpr void __cordl_internal_set_supportLegW(float_t value);

  constexpr void __cordl_internal_set_supportLegWV(float_t value);

  /// @brief Method .ctor, addr 0x1355654, size 0x1c4, virtual false, abstract: false, final false
  inline void _ctor(::UnityEngine::Quaternion rootRotation, ::UnityEngine::Vector3 footPosition, ::UnityEngine::Quaternion footRotation, ::UnityEngine::Vector3 characterSpaceOffset);

  /// @brief Method get_isStepping, addr 0x1355630, size 0x14, virtual false, abstract: false, final false
  inline bool get_isStepping();

  /// @brief Method get_stepProgress, addr 0x1355644, size 0x8, virtual false, abstract: false, final false
  inline float_t get_stepProgress();

  /// @brief Method set_stepProgress, addr 0x135564c, size 0x8, virtual false, abstract: false, final false
  inline void set_stepProgress(float_t value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __IKSolverVR__Footstep();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__IKSolverVR__Footstep", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __IKSolverVR__Footstep(__IKSolverVR__Footstep&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__IKSolverVR__Footstep", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __IKSolverVR__Footstep(__IKSolverVR__Footstep const&) = delete;

  /// @brief Field stepSpeed, offset: 0x10, size: 0x4, def value: None
  float_t ___stepSpeed;

  /// @brief Field characterSpaceOffset, offset: 0x14, size: 0xc, def value: None
  ::UnityEngine::Vector3 ___characterSpaceOffset;

  /// @brief Field position, offset: 0x20, size: 0xc, def value: None
  ::UnityEngine::Vector3 ___position;

  /// @brief Field rotation, offset: 0x2c, size: 0x10, def value: None
  ::UnityEngine::Quaternion ___rotation;

  /// @brief Field stepToRootRot, offset: 0x3c, size: 0x10, def value: None
  ::UnityEngine::Quaternion ___stepToRootRot;

  /// @brief Field isSupportLeg, offset: 0x4c, size: 0x1, def value: None
  bool ___isSupportLeg;

  /// @brief Field <stepProgress>k__BackingField, offset: 0x50, size: 0x4, def value: None
  float_t ____stepProgress_k__BackingField;

  /// @brief Field stepFrom, offset: 0x54, size: 0xc, def value: None
  ::UnityEngine::Vector3 ___stepFrom;

  /// @brief Field stepTo, offset: 0x60, size: 0xc, def value: None
  ::UnityEngine::Vector3 ___stepTo;

  /// @brief Field stepFromRot, offset: 0x6c, size: 0x10, def value: None
  ::UnityEngine::Quaternion ___stepFromRot;

  /// @brief Field stepToRot, offset: 0x7c, size: 0x10, def value: None
  ::UnityEngine::Quaternion ___stepToRot;

  /// @brief Field footRelativeToRoot, offset: 0x8c, size: 0x10, def value: None
  ::UnityEngine::Quaternion ___footRelativeToRoot;

  /// @brief Field supportLegW, offset: 0x9c, size: 0x4, def value: None
  float_t ___supportLegW;

  /// @brief Field supportLegWV, offset: 0xa0, size: 0x4, def value: None
  float_t ___supportLegWV;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::RootMotion::FinalIK::__IKSolverVR__Footstep, 0xa8>, "Size mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Footstep, ___stepSpeed) == 0x10, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Footstep, ___characterSpaceOffset) == 0x14, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Footstep, ___position) == 0x20, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Footstep, ___rotation) == 0x2c, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Footstep, ___stepToRootRot) == 0x3c, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Footstep, ___isSupportLeg) == 0x4c, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Footstep, ____stepProgress_k__BackingField) == 0x50, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Footstep, ___stepFrom) == 0x54, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Footstep, ___stepTo) == 0x60, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Footstep, ___stepFromRot) == 0x6c, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Footstep, ___stepToRot) == 0x7c, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Footstep, ___footRelativeToRoot) == 0x8c, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Footstep, ___supportLegW) == 0x9c, "Offset mismatch!");

static_assert(offsetof(::RootMotion::FinalIK::__IKSolverVR__Footstep, ___supportLegWV) == 0xa0, "Offset mismatch!");

} // namespace RootMotion::FinalIK
// Type: ::Leg
// SizeInfo { instance_size: 336, native_size: -1, calculated_instance_size: 336, calculated_native_size: 336, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace RootMotion::FinalIK {
// Is value type: false
// CS Name: ::IKSolverVR::Leg*
class CORDL_TYPE __IKSolverVR__Leg : public ::RootMotion::FinalIK::__IKSolverVR__BodyPart {
public:
  // Declarations
  /// @brief Field IKPosition, offset 0x78, size 0xc
  __declspec(property(get = __cordl_internal_get_IKPosition, put = __cordl_internal_set_IKPosition))::UnityEngine::Vector3 IKPosition;

  /// @brief Field IKRotation, offset 0x84, size 0x10
  __declspec(property(get = __cordl_internal_get_IKRotation, put = __cordl_internal_set_IKRotation))::UnityEngine::Quaternion IKRotation;

  /// @brief Field <hasToes>k__BackingField, offset 0xe0, size 0x1
  __declspec(property(get = __cordl_internal_get__hasToes_k__BackingField, put = __cordl_internal_set__hasToes_k__BackingField)) bool _hasToes_k__BackingField;

  /// @brief Field <position>k__BackingField, offset 0xc4, size 0xc
  __declspec(property(get = __cordl_internal_get__position_k__BackingField, put = __cordl_internal_set__position_k__BackingField))::UnityEngine::Vector3 _position_k__BackingField;

  /// @brief Field <rotation>k__BackingField, offset 0xd0, size 0x10
  __declspec(property(get = __cordl_internal_get__rotation_k__BackingField, put = __cordl_internal_set__rotation_k__BackingField))::UnityEngine::Quaternion _rotation_k__BackingField;

  /// @brief Field <thighRelativeToPelvis>k__BackingField, offset 0xe4, size 0xc
  __declspec(property(get = __cordl_internal_get__thighRelativeToPelvis_k__BackingField,
                      put = __cordl_internal_set__thighRelativeToPelvis_k__BackingField))::UnityEngine::Vector3 _thighRelativeToPelvis_k__BackingField;

  /// @brief Field bendGoal, offset 0x50, size 0x8
  __declspec(property(get = __cordl_internal_get_bendGoal, put = __cordl_internal_set_bendGoal))::UnityW<::UnityEngine::Transform> bendGoal;

  /// @brief Field bendGoalWeight, offset 0x60, size 0x4
  __declspec(property(get = __cordl_internal_get_bendGoalWeight, put = __cordl_internal_set_bendGoalWeight)) float_t bendGoalWeight;

  /// @brief Field bendNormal, offset 0x10c, size 0xc
  __declspec(property(get = __cordl_internal_get_bendNormal, put = __cordl_internal_set_bendNormal))::UnityEngine::Vector3 bendNormal;

  /// @brief Field bendNormalRelToPelvis, offset 0x138, size 0xc
  __declspec(property(get = __cordl_internal_get_bendNormalRelToPelvis, put = __cordl_internal_set_bendNormalRelToPelvis))::UnityEngine::Vector3 bendNormalRelToPelvis;

  /// @brief Field bendNormalRelToTarget, offset 0x144, size 0xc
  __declspec(property(get = __cordl_internal_get_bendNormalRelToTarget, put = __cordl_internal_set_bendNormalRelToTarget))::UnityEngine::Vector3 bendNormalRelToTarget;

  /// @brief Field bendToTargetWeight, offset 0x68, size 0x4
  __declspec(property(get = __cordl_internal_get_bendToTargetWeight, put = __cordl_internal_set_bendToTargetWeight)) float_t bendToTargetWeight;

  __declspec(property(get = get_calf))::RootMotion::FinalIK::__IKSolverVR__VirtualBone* calf;

  /// @brief Field calfRelToThigh, offset 0x118, size 0x10
  __declspec(property(get = __cordl_internal_get_calfRelToThigh, put = __cordl_internal_set_calfRelToThigh))::UnityEngine::Quaternion calfRelToThigh;

  /// @brief Field currentMag, offset 0xbc, size 0x4
  __declspec(property(get = __cordl_internal_get_currentMag, put = __cordl_internal_set_currentMag)) float_t currentMag;

  __declspec(property(get = get_foot))::RootMotion::FinalIK::__IKSolverVR__VirtualBone* foot;

  /// @brief Field footPosition, offset 0xf0, size 0xc
  __declspec(property(get = __cordl_internal_get_footPosition, put = __cordl_internal_set_footPosition))::UnityEngine::Vector3 footPosition;

  /// @brief Field footPositionOffset, offset 0x94, size 0xc
  __declspec(property(get = __cordl_internal_get_footPositionOffset, put = __cordl_internal_set_footPositionOffset))::UnityEngine::Vector3 footPositionOffset;

  /// @brief Field footRotation, offset 0xfc, size 0x10
  __declspec(property(get = __cordl_internal_get_footRotation, put = __cordl_internal_set_footRotation))::UnityEngine::Quaternion footRotation;

  /// @brief Field footRotationOffset, offset 0xac, size 0x10
  __declspec(property(get = __cordl_internal_get_footRotationOffset, put = __cordl_internal_set_footRotationOffset))::UnityEngine::Quaternion footRotationOffset;

  __declspec(property(get = get_hasToes, put = set_hasToes)) bool hasToes;

  /// @brief Field heelPositionOffset, offset 0xa0, size 0xc
  __declspec(property(get = __cordl_internal_get_heelPositionOffset, put = __cordl_internal_set_heelPositionOffset))::UnityEngine::Vector3 heelPositionOffset;

  __declspec(property(get = get_lastBone))::RootMotion::FinalIK::__IKSolverVR__VirtualBone* lastBone;

  /// @brief Field legLengthMlp, offset 0x6c, size 0x4
  __declspec(property(get = __cordl_internal_get_legLengthMlp, put = __cordl_internal_set_legLengthMlp)) float_t legLengthMlp;

  __declspec(property(get = get_position, put = set_position))::UnityEngine::Vector3 position;

  /// @brief Field positionWeight, offset 0x58, size 0x4
  __declspec(property(get = __cordl_internal_get_positionWeight, put = __cordl_internal_set_positionWeight)) float_t positionWeight;

  __declspec(property(get = get_rotation, put = set_rotation))::UnityEngine::Quaternion rotation;

  /// @brief Field rotationWeight, offset 0x5c, size 0x4
  __declspec(property(get = __cordl_internal_get_rotationWeight, put = __cordl_internal_set_rotationWeight)) float_t rotationWeight;

  /// @brief Field stretchCurve, offset 0x70, size 0x8
  __declspec(property(get = __cordl_internal_get_stretchCurve, put = __cordl_internal_set_stretchCurve))::UnityEngine::AnimationCurve* stretchCurve;

  /// @brief Field swivelOffset, offset 0x64, size 0x4
  __declspec(property(get = __cordl_internal_get_swivelOffset, put = __cordl_internal_set_swivelOffset)) float_t swivelOffset;

  /// @brief Field target, offset 0x48, size 0x8
  __declspec(property(get = __cordl_internal_get_target, put = __cordl_internal_set_target))::UnityW<::UnityEngine::Transform> target;

  __declspec(property(get = get_thigh))::RootMotion::FinalIK::__IKSolverVR__VirtualBone* thigh;

  /// @brief Field thighRelToFoot, offset 0x128, size 0x10
  __declspec(property(get = __cordl_internal_get_thighRelToFoot, put = __cordl_internal_set_thighRelToFoot))::UnityEngine::Quaternion thighRelToFoot;

  __declspec(property(get = get_thighRelativeToPelvis, put = set_thighRelativeToPelvis))::UnityEngine::Vector3 thighRelativeToPelvis;

