#pragma once
// IWYU pragma private; include "UnityEngine/AddressableAssets/AddressablesImpl.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__Object_def.hpp"
#include "UnityEngine/AddressableAssets/zzzz__Addressables_def.hpp"
#include "UnityEngine/ResourceManagement/AsyncOperations/zzzz__AsyncOperationBase_1_def.hpp"
#include "UnityEngine/ResourceManagement/AsyncOperations/zzzz__AsyncOperationHandle_1_def.hpp"
#include "UnityEngine/ResourceManagement/ResourceProviders/zzzz__InstantiationParameters_def.hpp"
#include "UnityEngine/ResourceManagement/ResourceProviders/zzzz__SceneReleaseMode_def.hpp"
#include "UnityEngine/SceneManagement/zzzz__LoadSceneParameters_def.hpp"
#include "UnityEngine/SceneManagement/zzzz__UnloadSceneOptions_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cstdint>
CORDL_MODULE_EXPORT(AddressablesImpl)
namespace System::Collections::Generic {
template <typename TKey, typename TValue> class Dictionary_2;
}
namespace System::Collections::Generic {
template <typename T> class HashSet_1;
}
namespace System::Collections::Generic {
template <typename T> class IEnumerable_1;
}
namespace System::Collections::Generic {
template <typename T> class IEqualityComparer_1;
}
namespace System::Collections::Generic {
template <typename T> class IList_1;
}
namespace System::Collections::Generic {
template <typename T> class List_1;
}

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl* const& __cordl_internal_get_m_Addressables() const;

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get_m_Addressables();

  constexpr ::System::Object* const& __cordl_internal_get_m_Keys() const;

  constexpr ::System::Object*& __cordl_internal_get_m_Keys();

  constexpr ::System::Type* const& __cordl_internal_get_m_ResourceType() const;

  constexpr ::System::Type*& __cordl_internal_get_m_ResourceType();

  constexpr ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* const& __cordl_internal_get_m_locations() const;

  constexpr ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>*& __cordl_internal_get_m_locations();

  constexpr void __cordl_internal_set_m_Addressables(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_m_Keys(::System::Object* value);

  constexpr void __cordl_internal_set_m_ResourceType(::System::Type* value);

  constexpr void __cordl_internal_set_m_locations(::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* value);

  /// @brief Method .ctor, addr 0x623bf50, size 0x4c, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_DebugName, addr 0x6240f98, size 0x1c, virtual true, abstract: false, final false
  inline ::StringW get_DebugName();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr AddressablesImpl_LoadResourceLocationKeyOp();

public:
  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl_LoadResourceLocationKeyOp", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  AddressablesImpl_LoadResourceLocationKeyOp(AddressablesImpl_LoadResourceLocationKeyOp&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl_LoadResourceLocationKeyOp", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  AddressablesImpl_LoadResourceLocationKeyOp(AddressablesImpl_LoadResourceLocationKeyOp const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 19475 };

  /// @brief Field m_Keys, offset: 0x98, size: 0x8, def value: None
  ::System::Object* ___m_Keys;

  /// @brief Field m_locations, offset: 0xa0, size: 0x8, def value: None
  ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* ___m_locations;

  /// @brief Field m_Addressables, offset: 0xa8, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* ___m_Addressables;

  /// @brief Field m_ResourceType, offset: 0xb0, size: 0x8, def value: None
  ::System::Type* ___m_ResourceType;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl_LoadResourceLocationKeyOp, ___m_Keys) == 0x98, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl_LoadResourceLocationKeyOp, ___m_locations) == 0xa0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl_LoadResourceLocationKeyOp, ___m_Addressables) == 0xa8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl_LoadResourceLocationKeyOp, ___m_ResourceType) == 0xb0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::AddressablesImpl_LoadResourceLocationKeyOp, 0xb8>, "Size mismatch!");

} // namespace UnityEngine::AddressableAssets
// Dependencies UnityEngine.AddressableAssets.Addressables::MergeMode, UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationBase`1<TObject>
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: UnityEngine.AddressableAssets.AddressablesImpl/LoadResourceLocationKeysOp
class CORDL_TYPE AddressablesImpl_LoadResourceLocationKeysOp : public ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationBase_1<
                                                                   ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>*> {
public:
  // Declarations
  __declspec(property(get = get_DebugName)) ::StringW DebugName;

  /// @brief Field m_Addressables, offset 0xb0, size 0x8
  __declspec(property(get = __cordl_internal_get_m_Addressables, put = __cordl_internal_set_m_Addressables)) ::UnityEngine::AddressableAssets::AddressablesImpl* m_Addressables;

  /// @brief Field m_Key, offset 0x98, size 0x8
  __declspec(property(get = __cordl_internal_get_m_Key, put = __cordl_internal_set_m_Key)) ::System::Collections::IEnumerable* m_Key;

  /// @brief Field m_MergeMode, offset 0xa0, size 0x4
  __declspec(property(get = __cordl_internal_get_m_MergeMode, put = __cordl_internal_set_m_MergeMode)) ::UnityEngine::AddressableAssets::Addressables_MergeMode m_MergeMode;

  /// @brief Field m_ResourceType, offset 0xb8, size 0x8
  __declspec(property(get = __cordl_internal_get_m_ResourceType, put = __cordl_internal_set_m_ResourceType)) ::System::Type* m_ResourceType;

  /// @brief Field m_locations, offset 0xa8, size 0x8
  __declspec(property(get = __cordl_internal_get_m_locations,
                      put = __cordl_internal_set_m_locations)) ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* m_locations;

  /// @brief Method Execute, addr 0x6241168, size 0xe4, virtual true, abstract: false, final false
  inline void Execute();

  /// @brief Method Init, addr 0x623bdc8, size 0x10, virtual false, abstract: false, final false
  inline void Init(::UnityEngine::AddressableAssets::AddressablesImpl* aa, ::System::Type* t, ::System::Collections::IEnumerable* key,
                   ::UnityEngine::AddressableAssets::Addressables_MergeMode mergeMode);

  /// @brief Method InvokeWaitForCompletion, addr 0x624124c, size 0x90, virtual true, abstract: false, final false
  inline bool InvokeWaitForCompletion();

  static inline ::UnityEngine::AddressableAssets::AddressablesImpl_LoadResourceLocationKeysOp* New_ctor();

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl* const& __cordl_internal_get_m_Addressables() const;

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get_m_Addressables();

  constexpr ::System::Collections::IEnumerable* const& __cordl_internal_get_m_Key() const;

  constexpr ::System::Collections::IEnumerable*& __cordl_internal_get_m_Key();

  constexpr ::UnityEngine::AddressableAssets::Addressables_MergeMode const& __cordl_internal_get_m_MergeMode() const;

  constexpr ::UnityEngine::AddressableAssets::Addressables_MergeMode& __cordl_internal_get_m_MergeMode();

  constexpr ::System::Type* const& __cordl_internal_get_m_ResourceType() const;

  constexpr ::System::Type*& __cordl_internal_get_m_ResourceType();

  constexpr ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* const& __cordl_internal_get_m_locations() const;

  constexpr ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>*& __cordl_internal_get_m_locations();

  constexpr void __cordl_internal_set_m_Addressables(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_m_Key(::System::Collections::IEnumerable* value);

  constexpr void __cordl_internal_set_m_MergeMode(::UnityEngine::AddressableAssets::Addressables_MergeMode value);

  constexpr void __cordl_internal_set_m_ResourceType(::System::Type* value);

  constexpr void __cordl_internal_set_m_locations(::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* value);

  /// @brief Method .ctor, addr 0x623bd7c, size 0x4c, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_DebugName, addr 0x6241124, size 0x44, virtual true, abstract: false, final false
  inline ::StringW get_DebugName();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr AddressablesImpl_LoadResourceLocationKeysOp();

public:
  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl_LoadResourceLocationKeysOp", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  AddressablesImpl_LoadResourceLocationKeysOp(AddressablesImpl_LoadResourceLocationKeysOp&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl_LoadResourceLocationKeysOp", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  AddressablesImpl_LoadResourceLocationKeysOp(AddressablesImpl_LoadResourceLocationKeysOp const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 19476 };

  /// @brief Field m_Key, offset: 0x98, size: 0x8, def value: None
  ::System::Collections::IEnumerable* ___m_Key;

  /// @brief Field m_MergeMode, offset: 0xa0, size: 0x4, def value: None
  ::UnityEngine::AddressableAssets::Addressables_MergeMode ___m_MergeMode;

  /// @brief Field m_locations, offset: 0xa8, size: 0x8, def value: None
  ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* ___m_locations;

  /// @brief Field m_Addressables, offset: 0xb0, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* ___m_Addressables;

  /// @brief Field m_ResourceType, offset: 0xb8, size: 0x8, def value: None
  ::System::Type* ___m_ResourceType;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl_LoadResourceLocationKeysOp, ___m_Key) == 0x98, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl_LoadResourceLocationKeysOp, ___m_MergeMode) == 0xa0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl_LoadResourceLocationKeysOp, ___m_locations) == 0xa8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl_LoadResourceLocationKeysOp, ___m_Addressables) == 0xb0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl_LoadResourceLocationKeysOp, ___m_ResourceType) == 0xb8, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::AddressablesImpl_LoadResourceLocationKeysOp, 0xc0>, "Size mismatch!");

} // namespace UnityEngine::AddressableAssets
// Dependencies System.Object
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: UnityEngine.AddressableAssets.AddressablesImpl/<>c
class CORDL_TYPE AddressablesImpl___c : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>9, offset 0xffffffff, size 0x8
  __declspec(property(get = getStaticF___9, put = setStaticF___9)) ::UnityEngine::AddressableAssets::AddressablesImpl___c* __9;

  /// @brief Field <>9__143_0, offset 0xffffffff, size 0x8
  __declspec(property(get = getStaticF___9__143_0, put = setStaticF___9__143_0)) ::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, bool>* __9__143_0;

  /// @brief Field <>9__143_1, offset 0xffffffff, size 0x8
  __declspec(property(get = getStaticF___9__143_1, put = setStaticF___9__143_1)) ::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::StringW>* __9__143_1;

  /// @brief Field <>9__147_0, offset 0xffffffff, size 0x8
  __declspec(property(get = getStaticF___9__147_0, put = setStaticF___9__147_0)) ::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::StringW>* __9__147_0;

  /// @brief Field <>9__59_0, offset 0xffffffff, size 0x8
  __declspec(property(
      get = getStaticF___9__59_0,
      put = setStaticF___9__59_0)) ::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::UnityEngine::AddressableAssets::ResourceLocators::IResourceLocator*>* __9__59_0;

  static inline ::UnityEngine::AddressableAssets::AddressablesImpl___c* New_ctor();

  /// @brief Method <CleanBundleCache>b__147_0, addr 0x6241404, size 0xa8, virtual false, abstract: false, final false
  inline ::StringW _CleanBundleCache_b__147_0(::UnityEngine::AddressableAssets::ResourceLocatorInfo* s);

  /// @brief Method .ctor, addr 0x6241330, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method <get_CatalogsWithAvailableUpdates>b__143_0, addr 0x6241348, size 0x14, virtual false, abstract: false, final false
  inline bool _get_CatalogsWithAvailableUpdates_b__143_0(::UnityEngine::AddressableAssets::ResourceLocatorInfo* s);

  /// @brief Method <get_CatalogsWithAvailableUpdates>b__143_1, addr 0x624135c, size 0xa8, virtual false, abstract: false, final false
  inline ::StringW _get_CatalogsWithAvailableUpdates_b__143_1(::UnityEngine::AddressableAssets::ResourceLocatorInfo* s);

  /// @brief Method <get_ResourceLocators>b__59_0, addr 0x6241334, size 0x14, virtual false, abstract: false, final false
  inline ::UnityEngine::AddressableAssets::ResourceLocators::IResourceLocator* _get_ResourceLocators_b__59_0(::UnityEngine::AddressableAssets::ResourceLocatorInfo* l);

  static inline ::UnityEngine::AddressableAssets::AddressablesImpl___c* getStaticF___9();

  static inline ::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, bool>* getStaticF___9__143_0();

  static inline ::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::StringW>* getStaticF___9__143_1();

  static inline ::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::StringW>* getStaticF___9__147_0();

  static inline ::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::UnityEngine::AddressableAssets::ResourceLocators::IResourceLocator*>* getStaticF___9__59_0();

  static inline void setStaticF___9(::UnityEngine::AddressableAssets::AddressablesImpl___c* value);

  static inline void setStaticF___9__143_0(::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, bool>* value);

  static inline void setStaticF___9__143_1(::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::StringW>* value);

  static inline void setStaticF___9__147_0(::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::StringW>* value);

  static inline void setStaticF___9__59_0(::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::UnityEngine::AddressableAssets::ResourceLocators::IResourceLocator*>* value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr AddressablesImpl___c();

public:
  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  AddressablesImpl___c(AddressablesImpl___c&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  AddressablesImpl___c(AddressablesImpl___c const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 19477 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::AddressablesImpl___c, 0x10>, "Size mismatch!");

} // namespace UnityEngine::AddressableAssets
// Dependencies System.Object
namespace UnityEngine::AddressableAssets {
// cpp template
template <typename TObject>
// Is value type: false
// CS Name: UnityEngine.AddressableAssets.AddressablesImpl/<>c__115`1<TObject>
class CORDL_TYPE AddressablesImpl___c__115_1 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>9, offset 0xffffffff, size 0x8
  __declspec(property(get = getStaticF___9, put = setStaticF___9)) ::UnityEngine::AddressableAssets::AddressablesImpl___c__115_1<TObject>* __9;

  /// @brief Field <>9__115_0, offset 0xffffffff, size 0x8
  __declspec(property(get = getStaticF___9__115_0, put = setStaticF___9__115_0)) ::System::Action_1<::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle>* __9__115_0;

  static inline ::UnityEngine::AddressableAssets::AddressablesImpl___c__115_1<TObject>* New_ctor();

  /// @brief Method <AutoReleaseHandleOnTypelessCompletion>b__115_0, addr 0x0, size 0xffffffffffffffff, virtual false, abstract: false, final false
  inline void _AutoReleaseHandleOnTypelessCompletion_b__115_0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  /// @brief Method .ctor, addr 0x0, size 0xffffffffffffffff, virtual false, abstract: false, final false
  inline void _ctor();

  static inline ::UnityEngine::AddressableAssets::AddressablesImpl___c__115_1<TObject>* getStaticF___9();

  static inline ::System::Action_1<::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle>* getStaticF___9__115_0();

  static inline void setStaticF___9(::UnityEngine::AddressableAssets::AddressablesImpl___c__115_1<TObject>* value);

  static inline void setStaticF___9__115_0(::System::Action_1<::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle>* value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr AddressablesImpl___c__115_1();

public:
  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__115_1", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  AddressablesImpl___c__115_1(AddressablesImpl___c__115_1&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__115_1", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  AddressablesImpl___c__115_1(AddressablesImpl___c__115_1 const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 19478 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
} // namespace UnityEngine::AddressableAssets
// Dependencies System.Object
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: UnityEngine.AddressableAssets.AddressablesImpl/<>c__DisplayClass100_0
class CORDL_TYPE AddressablesImpl___c__DisplayClass100_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field catalogLoc, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_catalogLoc, put = __cordl_internal_set_catalogLoc)) ::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* catalogLoc;

  static inline ::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass100_0* New_ctor();

  /// @brief Method <ComputeCatalogSizeWithChain>b__0, addr 0x62414ac, size 0x20c, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<int64_t>
  _ComputeCatalogSizeWithChain_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl* const& __cordl_internal_get___4__this() const;

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* const& __cordl_internal_get_catalogLoc() const;

  constexpr ::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*& __cordl_internal_get_catalogLoc();

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_catalogLoc(::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* value);

  /// @brief Method .ctor, addr 0x623c7cc, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr AddressablesImpl___c__DisplayClass100_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass100_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  AddressablesImpl___c__DisplayClass100_0(AddressablesImpl___c__DisplayClass100_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass100_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  AddressablesImpl___c__DisplayClass100_0(AddressablesImpl___c__DisplayClass100_0 const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 19479 };

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field catalogLoc, offset: 0x18, size: 0x8, def value: None
  ::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* ___catalogLoc;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass100_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass100_0, ___catalogLoc) == 0x18, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass100_0, 0x20>, "Size mismatch!");

} // namespace UnityEngine::AddressableAssets
// Dependencies System.Object
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: UnityEngine.AddressableAssets.AddressablesImpl/<>c__DisplayClass103_0
class CORDL_TYPE AddressablesImpl___c__DisplayClass103_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field keys, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_keys, put = __cordl_internal_set_keys)) ::System::Collections::IEnumerable* keys;

  static inline ::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass103_0* New_ctor();

  /// @brief Method <GetDownloadSizeWithChain>b__0, addr 0x62416b8, size 0x44, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<int64_t>
  _GetDownloadSizeWithChain_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl* const& __cordl_internal_get___4__this() const;

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::System::Collections::IEnumerable* const& __cordl_internal_get_keys() const;

  constexpr ::System::Collections::IEnumerable*& __cordl_internal_get_keys();

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_keys(::System::Collections::IEnumerable* value);

  /// @brief Method .ctor, addr 0x623d208, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr AddressablesImpl___c__DisplayClass103_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass103_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  AddressablesImpl___c__DisplayClass103_0(AddressablesImpl___c__DisplayClass103_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass103_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  AddressablesImpl___c__DisplayClass103_0(AddressablesImpl___c__DisplayClass103_0 const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 19480 };

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field keys, offset: 0x18, size: 0x8, def value: None
  ::System::Collections::IEnumerable* ___keys;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass103_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass103_0, ___keys) == 0x18, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass103_0, 0x20>, "Size mismatch!");

} // namespace UnityEngine::AddressableAssets
// Dependencies System.Object
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: UnityEngine.AddressableAssets.AddressablesImpl/<>c__DisplayClass106_0
class CORDL_TYPE AddressablesImpl___c__DisplayClass106_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field key, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_key, put = __cordl_internal_set_key)) ::System::Object* key;

  static inline ::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass106_0* New_ctor();

  /// @brief Method <DownloadDependenciesAsyncWithChain>b__0, addr 0x62416fc, size 0x9c, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<
      ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceProviders::IAssetBundleResource*>*>
  _DownloadDependenciesAsyncWithChain_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl* const& __cordl_internal_get___4__this() const;

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::System::Object* const& __cordl_internal_get_key() const;

  constexpr ::System::Object*& __cordl_internal_get_key();

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_key(::System::Object* value);

  /// @brief Method .ctor, addr 0x623d3c4, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr AddressablesImpl___c__DisplayClass106_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass106_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  AddressablesImpl___c__DisplayClass106_0(AddressablesImpl___c__DisplayClass106_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass106_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  AddressablesImpl___c__DisplayClass106_0(AddressablesImpl___c__DisplayClass106_0 const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 19481 };

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field key, offset: 0x18, size: 0x8, def value: None
  ::System::Object* ___key;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass106_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass106_0, ___key) == 0x18, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass106_0, 0x20>, "Size mismatch!");

} // namespace UnityEngine::AddressableAssets
// Dependencies System.Object
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: UnityEngine.AddressableAssets.AddressablesImpl/<>c__DisplayClass110_0
class CORDL_TYPE AddressablesImpl___c__DisplayClass110_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field locations, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_locations,
                      put = __cordl_internal_set_locations)) ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* locations;

  static inline ::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass110_0* New_ctor();

  /// @brief Method <DownloadDependenciesAsyncWithChain>b__0, addr 0x6241798, size 0x9c, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<
      ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceProviders::IAssetBundleResource*>*>
  _DownloadDependenciesAsyncWithChain_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl* const& __cordl_internal_get___4__this() const;

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* const& __cordl_internal_get_locations() const;

  constexpr ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>*& __cordl_internal_get_locations();

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_locations(::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* value);

  /// @brief Method .ctor, addr 0x623df00, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr AddressablesImpl___c__DisplayClass110_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass110_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  AddressablesImpl___c__DisplayClass110_0(AddressablesImpl___c__DisplayClass110_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass110_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  AddressablesImpl___c__DisplayClass110_0(AddressablesImpl___c__DisplayClass110_0 const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 19482 };

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field locations, offset: 0x18, size: 0x8, def value: None
  ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* ___locations;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass110_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass110_0, ___locations) == 0x18, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass110_0, 0x20>, "Size mismatch!");

} // namespace UnityEngine::AddressableAssets
// Dependencies System.Object, UnityEngine.AddressableAssets.Addressables::MergeMode
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: UnityEngine.AddressableAssets.AddressablesImpl/<>c__DisplayClass112_0
class CORDL_TYPE AddressablesImpl___c__DisplayClass112_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field keys, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_keys, put = __cordl_internal_set_keys)) ::System::Collections::IEnumerable* keys;

  /// @brief Field mode, offset 0x20, size 0x4
  __declspec(property(get = __cordl_internal_get_mode, put = __cordl_internal_set_mode)) ::UnityEngine::AddressableAssets::Addressables_MergeMode mode;

  static inline ::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass112_0* New_ctor();

  /// @brief Method <DownloadDependenciesAsyncWithChain>b__0, addr 0x6241834, size 0xa0, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<
      ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceProviders::IAssetBundleResource*>*>
  _DownloadDependenciesAsyncWithChain_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl* const& __cordl_internal_get___4__this() const;

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::System::Collections::IEnumerable* const& __cordl_internal_get_keys() const;

  constexpr ::System::Collections::IEnumerable*& __cordl_internal_get_keys();

  constexpr ::UnityEngine::AddressableAssets::Addressables_MergeMode const& __cordl_internal_get_mode() const;

  constexpr ::UnityEngine::AddressableAssets::Addressables_MergeMode& __cordl_internal_get_mode();

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_keys(::System::Collections::IEnumerable* value);

  constexpr void __cordl_internal_set_mode(::UnityEngine::AddressableAssets::Addressables_MergeMode value);

  /// @brief Method .ctor, addr 0x623e0cc, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr AddressablesImpl___c__DisplayClass112_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass112_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  AddressablesImpl___c__DisplayClass112_0(AddressablesImpl___c__DisplayClass112_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass112_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  AddressablesImpl___c__DisplayClass112_0(AddressablesImpl___c__DisplayClass112_0 const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 19483 };

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field keys, offset: 0x18, size: 0x8, def value: None
  ::System::Collections::IEnumerable* ___keys;

  /// @brief Field mode, offset: 0x20, size: 0x4, def value: None
  ::UnityEngine::AddressableAssets::Addressables_MergeMode ___mode;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass112_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass112_0, ___keys) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass112_0, ___mode) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass112_0, 0x28>, "Size mismatch!");

} // namespace UnityEngine::AddressableAssets
// Dependencies System.Object
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: UnityEngine.AddressableAssets.AddressablesImpl/<>c__DisplayClass116_0
class CORDL_TYPE AddressablesImpl___c__DisplayClass116_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field autoReleaseHandle, offset 0x20, size 0x1
  __declspec(property(get = __cordl_internal_get_autoReleaseHandle, put = __cordl_internal_set_autoReleaseHandle)) bool autoReleaseHandle;

  /// @brief Field key, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_key, put = __cordl_internal_set_key)) ::System::Object* key;

  static inline ::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass116_0* New_ctor();

  /// @brief Method <ClearDependencyCacheAsync>b__0, addr 0x62418d4, size 0x48, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<bool> _ClearDependencyCacheAsync_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl* const& __cordl_internal_get___4__this() const;

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr bool const& __cordl_internal_get_autoReleaseHandle() const;

  constexpr bool& __cordl_internal_get_autoReleaseHandle();

  constexpr ::System::Object* const& __cordl_internal_get_key() const;

  constexpr ::System::Object*& __cordl_internal_get_key();

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_autoReleaseHandle(bool value);

  constexpr void __cordl_internal_set_key(::System::Object* value);

  /// @brief Method .ctor, addr 0x623e7dc, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr AddressablesImpl___c__DisplayClass116_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass116_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  AddressablesImpl___c__DisplayClass116_0(AddressablesImpl___c__DisplayClass116_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass116_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  AddressablesImpl___c__DisplayClass116_0(AddressablesImpl___c__DisplayClass116_0 const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 19484 };

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field key, offset: 0x18, size: 0x8, def value: None
  ::System::Object* ___key;

  /// @brief Field autoReleaseHandle, offset: 0x20, size: 0x1, def value: None
  bool ___autoReleaseHandle;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass116_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass116_0, ___key) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass116_0, ___autoReleaseHandle) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass116_0, 0x28>, "Size mismatch!");

} // namespace UnityEngine::AddressableAssets
// Dependencies System.Object
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: UnityEngine.AddressableAssets.AddressablesImpl/<>c__DisplayClass117_0
class CORDL_TYPE AddressablesImpl___c__DisplayClass117_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field autoReleaseHandle, offset 0x20, size 0x1
  __declspec(property(get = __cordl_internal_get_autoReleaseHandle, put = __cordl_internal_set_autoReleaseHandle)) bool autoReleaseHandle;

  /// @brief Field locations, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_locations,
                      put = __cordl_internal_set_locations)) ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* locations;

  static inline ::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass117_0* New_ctor();

  /// @brief Method <ClearDependencyCacheAsync>b__0, addr 0x624191c, size 0x48, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<bool> _ClearDependencyCacheAsync_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl* const& __cordl_internal_get___4__this() const;

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr bool const& __cordl_internal_get_autoReleaseHandle() const;

  constexpr bool& __cordl_internal_get_autoReleaseHandle();

  constexpr ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* const& __cordl_internal_get_locations() const;

  constexpr ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>*& __cordl_internal_get_locations();

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_autoReleaseHandle(bool value);

  constexpr void __cordl_internal_set_locations(::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* value);

  /// @brief Method .ctor, addr 0x623e7e0, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr AddressablesImpl___c__DisplayClass117_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass117_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  AddressablesImpl___c__DisplayClass117_0(AddressablesImpl___c__DisplayClass117_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass117_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  AddressablesImpl___c__DisplayClass117_0(AddressablesImpl___c__DisplayClass117_0 const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 19485 };

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field locations, offset: 0x18, size: 0x8, def value: None
  ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* ___locations;

  /// @brief Field autoReleaseHandle, offset: 0x20, size: 0x1, def value: None
  bool ___autoReleaseHandle;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass117_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass117_0, ___locations) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass117_0, ___autoReleaseHandle) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass117_0, 0x28>, "Size mismatch!");

} // namespace UnityEngine::AddressableAssets
// Dependencies System.Object
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: UnityEngine.AddressableAssets.AddressablesImpl/<>c__DisplayClass118_0
class CORDL_TYPE AddressablesImpl___c__DisplayClass118_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field autoReleaseHandle, offset 0x20, size 0x1
  __declspec(property(get = __cordl_internal_get_autoReleaseHandle, put = __cordl_internal_set_autoReleaseHandle)) bool autoReleaseHandle;

  /// @brief Field keys, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_keys, put = __cordl_internal_set_keys)) ::System::Collections::IEnumerable* keys;

  static inline ::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass118_0* New_ctor();

  /// @brief Method <ClearDependencyCacheAsync>b__0, addr 0x6241964, size 0x48, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<bool> _ClearDependencyCacheAsync_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl* const& __cordl_internal_get___4__this() const;

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr bool const& __cordl_internal_get_autoReleaseHandle() const;

  constexpr bool& __cordl_internal_get_autoReleaseHandle();

  constexpr ::System::Collections::IEnumerable* const& __cordl_internal_get_keys() const;

  constexpr ::System::Collections::IEnumerable*& __cordl_internal_get_keys();

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_autoReleaseHandle(bool value);

  constexpr void __cordl_internal_set_keys(::System::Collections::IEnumerable* value);

  /// @brief Method .ctor, addr 0x623e7e4, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr AddressablesImpl___c__DisplayClass118_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass118_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  AddressablesImpl___c__DisplayClass118_0(AddressablesImpl___c__DisplayClass118_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass118_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  AddressablesImpl___c__DisplayClass118_0(AddressablesImpl___c__DisplayClass118_0 const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 19486 };

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field keys, offset: 0x18, size: 0x8, def value: None
  ::System::Collections::IEnumerable* ___keys;

  /// @brief Field autoReleaseHandle, offset: 0x20, size: 0x1, def value: None
  bool ___autoReleaseHandle;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass118_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass118_0, ___keys) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass118_0, ___autoReleaseHandle) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass118_0, 0x28>, "Size mismatch!");

} // namespace UnityEngine::AddressableAssets
// Dependencies System.Object, UnityEngine.ResourceManagement.ResourceProviders.InstantiationParameters
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: UnityEngine.AddressableAssets.AddressablesImpl/<>c__DisplayClass123_0
class CORDL_TYPE AddressablesImpl___c__DisplayClass123_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field instantiateParameters, offset 0x20, size 0x30
  __declspec(property(get = __cordl_internal_get_instantiateParameters,
                      put = __cordl_internal_set_instantiateParameters)) ::UnityEngine::ResourceManagement::ResourceProviders::InstantiationParameters instantiateParameters;

  /// @brief Field key, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_key, put = __cordl_internal_set_key)) ::System::Object* key;

  static inline ::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass123_0* New_ctor();

  /// @brief Method <InstantiateWithChain>b__0, addr 0x62419ac, size 0x5c, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<::UnityW<::UnityEngine::GameObject>>
  _InstantiateWithChain_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl* const& __cordl_internal_get___4__this() const;

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::UnityEngine::ResourceManagement::ResourceProviders::InstantiationParameters const& __cordl_internal_get_instantiateParameters() const;

  constexpr ::UnityEngine::ResourceManagement::ResourceProviders::InstantiationParameters& __cordl_internal_get_instantiateParameters();

  constexpr ::System::Object* const& __cordl_internal_get_key() const;

  constexpr ::System::Object*& __cordl_internal_get_key();

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_instantiateParameters(::UnityEngine::ResourceManagement::ResourceProviders::InstantiationParameters value);

  constexpr void __cordl_internal_set_key(::System::Object* value);

  /// @brief Method .ctor, addr 0x623ea24, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr AddressablesImpl___c__DisplayClass123_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass123_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  AddressablesImpl___c__DisplayClass123_0(AddressablesImpl___c__DisplayClass123_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass123_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  AddressablesImpl___c__DisplayClass123_0(AddressablesImpl___c__DisplayClass123_0 const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 19487 };

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field key, offset: 0x18, size: 0x8, def value: None
  ::System::Object* ___key;

  /// @brief Field instantiateParameters, offset: 0x20, size: 0x30, def value: None
  ::UnityEngine::ResourceManagement::ResourceProviders::InstantiationParameters ___instantiateParameters;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass123_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass123_0, ___key) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass123_0, ___instantiateParameters) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass123_0, 0x50>, "Size mismatch!");

} // namespace UnityEngine::AddressableAssets
// Dependencies System.Object, UnityEngine.ResourceManagement.ResourceProviders.InstantiationParameters
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: UnityEngine.AddressableAssets.AddressablesImpl/<>c__DisplayClass125_0
class CORDL_TYPE AddressablesImpl___c__DisplayClass125_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field instantiateParameters, offset 0x20, size 0x30
  __declspec(property(get = __cordl_internal_get_instantiateParameters,
                      put = __cordl_internal_set_instantiateParameters)) ::UnityEngine::ResourceManagement::ResourceProviders::InstantiationParameters instantiateParameters;

  /// @brief Field location, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_location, put = __cordl_internal_set_location)) ::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* location;

  static inline ::UnityEngine::AddressableAssets::AddressablesImpl___c__DisplayClass125_0* New_ctor();

  /// @brief Method <InstantiateWithChain>b__0, addr 0x6241a08, size 0x5c, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<::UnityW<::UnityEngine::GameObject>>
  _InstantiateWithChain_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl* const& __cordl_internal_get___4__this() const;

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::UnityEngine::ResourceManagement::ResourceProviders::InstantiationParameters const& __cordl_internal_get_instantiateParameters() const;

  constexpr ::UnityEngine::ResourceManagement::ResourceProviders::InstantiationParameters& __cordl_internal_get_instantiateParameters();

  constexpr ::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* const& __cordl_internal_get_location() const;

  constexpr ::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*& __cordl_internal_get_location();

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_instantiateParameters(::UnityEngine::ResourceManagement::ResourceProviders::InstantiationParameters value);

  constexpr void __cordl_internal_set_location(::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* value);

  /// @brief Method .ctor, addr 0x623ebe8, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr AddressablesImpl___c__DisplayClass125_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass125_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  AddressablesImpl___c__DisplayClass125_0(AddressablesImpl___c__DisplayClass125_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "AddressablesImpl___c__DisplayClass125_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  AddressablesImpl___c__DisplayClass125_0(AddressablesImpl___c__DisplayClass125_0 const&) = delete;

  /// @brief IL2CPP Metadata Type Index
