#pragma once
// IWYU pragma private; include "UnityEngine/AddressableAssets/AddressablesImpl.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__Object_def.hpp"
#include "UnityEngine/AddressableAssets/zzzz__Addressables_def.hpp"
#include "UnityEngine/ResourceManagement/AsyncOperations/zzzz__AsyncOperationBase_1_def.hpp"
#include "UnityEngine/ResourceManagement/AsyncOperations/zzzz__AsyncOperationHandle_1_def.hpp"
#include "UnityEngine/ResourceManagement/ResourceProviders/zzzz__InstantiationParameters_def.hpp"
#include "UnityEngine/SceneManagement/zzzz__LoadSceneMode_def.hpp"
#include "UnityEngine/SceneManagement/zzzz__LoadSceneParameters_def.hpp"
#include "UnityEngine/SceneManagement/zzzz__UnloadSceneOptions_def.hpp"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cstdint>
CORDL_MODULE_EXPORT(AddressablesImpl)
namespace System::Collections::Generic {
template <typename TKey, typename TValue> class Dictionary_2;
}
namespace System::Collections::Generic {
template <typename T> class HashSet_1;
}
namespace System::Collections::Generic {
template <typename T> class IEnumerable_1;
}
namespace System::Collections::Generic {
template <typename T> class IEqualityComparer_1;
}
namespace System::Collections::Generic {
template <typename T> class IList_1;
}

  constexpr ::cordl_internals::to_const_pointer<::System::Object*> const& __cordl_internal_get_m_Keys() const;

  constexpr ::System::Type*& __cordl_internal_get_m_ResourceType();

  constexpr ::cordl_internals::to_const_pointer<::System::Type*> const& __cordl_internal_get_m_ResourceType() const;

  constexpr ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>*& __cordl_internal_get_m_locations();

  constexpr ::cordl_internals::to_const_pointer<::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>*> const&
  __cordl_internal_get_m_locations() const;

  constexpr void __cordl_internal_set_m_Addressables(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_m_Keys(::System::Object* value);

  constexpr void __cordl_internal_set_m_ResourceType(::System::Type* value);

  constexpr void __cordl_internal_set_m_locations(::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* value);

  /// @brief Method .ctor, addr 0x4474fd8, size 0x48, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_DebugName, addr 0x4479f9c, size 0x20, virtual true, abstract: false, final false
  inline ::StringW get_DebugName();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __AddressablesImpl__LoadResourceLocationKeyOp();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl__LoadResourceLocationKeyOp", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __AddressablesImpl__LoadResourceLocationKeyOp(__AddressablesImpl__LoadResourceLocationKeyOp&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl__LoadResourceLocationKeyOp", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __AddressablesImpl__LoadResourceLocationKeyOp(__AddressablesImpl__LoadResourceLocationKeyOp const&) = delete;

  /// @brief Field m_Keys, offset: 0x98, size: 0x8, def value: None
  ::System::Object* ___m_Keys;

  /// @brief Field m_locations, offset: 0xa0, size: 0x8, def value: None
  ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* ___m_locations;

  /// @brief Field m_Addressables, offset: 0xa8, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* ___m_Addressables;

  /// @brief Field m_ResourceType, offset: 0xb0, size: 0x8, def value: None
  ::System::Type* ___m_ResourceType;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 16098 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::__AddressablesImpl__LoadResourceLocationKeyOp, 0xb8>, "Size mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl__LoadResourceLocationKeyOp, ___m_Keys) == 0x98, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl__LoadResourceLocationKeyOp, ___m_locations) == 0xa0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl__LoadResourceLocationKeyOp, ___m_Addressables) == 0xa8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl__LoadResourceLocationKeyOp, ___m_ResourceType) == 0xb0, "Offset mismatch!");

} // namespace UnityEngine::AddressableAssets
// Type: ::LoadResourceLocationKeysOp
// SizeInfo { instance_size: 192, native_size: -1, calculated_instance_size: 192, calculated_native_size: 192, minimum_alignment: 8, packing: None, specified_packing: None }
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: ::AddressablesImpl::LoadResourceLocationKeysOp*
class CORDL_TYPE __AddressablesImpl__LoadResourceLocationKeysOp : public ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationBase_1<
                                                                      ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>*> {
public:
  // Declarations
  __declspec(property(get = get_DebugName)) ::StringW DebugName;

  /// @brief Field m_Addressables, offset 0xb0, size 0x8
  __declspec(property(get = __cordl_internal_get_m_Addressables, put = __cordl_internal_set_m_Addressables)) ::UnityEngine::AddressableAssets::AddressablesImpl* m_Addressables;

  /// @brief Field m_Key, offset 0x98, size 0x8
  __declspec(property(get = __cordl_internal_get_m_Key, put = __cordl_internal_set_m_Key)) ::System::Collections::IEnumerable* m_Key;

  /// @brief Field m_MergeMode, offset 0xa0, size 0x4
  __declspec(property(get = __cordl_internal_get_m_MergeMode, put = __cordl_internal_set_m_MergeMode)) ::UnityEngine::AddressableAssets::__Addressables__MergeMode m_MergeMode;

  /// @brief Field m_ResourceType, offset 0xb8, size 0x8
  __declspec(property(get = __cordl_internal_get_m_ResourceType, put = __cordl_internal_set_m_ResourceType)) ::System::Type* m_ResourceType;

  /// @brief Field m_locations, offset 0xa8, size 0x8
  __declspec(property(get = __cordl_internal_get_m_locations,
                      put = __cordl_internal_set_m_locations)) ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* m_locations;

  /// @brief Method Execute, addr 0x447a150, size 0xe4, virtual true, abstract: false, final false
  inline void Execute();

  /// @brief Method Init, addr 0x4474e84, size 0x10, virtual false, abstract: false, final false
  inline void Init(::UnityEngine::AddressableAssets::AddressablesImpl* aa, ::System::Type* t, ::System::Collections::IEnumerable* key,
                   ::UnityEngine::AddressableAssets::__Addressables__MergeMode mergeMode);

  /// @brief Method InvokeWaitForCompletion, addr 0x447a234, size 0x74, virtual true, abstract: false, final false
  inline bool InvokeWaitForCompletion();

  static inline ::UnityEngine::AddressableAssets::__AddressablesImpl__LoadResourceLocationKeysOp* New_ctor();

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get_m_Addressables();

  constexpr ::cordl_internals::to_const_pointer<::UnityEngine::AddressableAssets::AddressablesImpl*> const& __cordl_internal_get_m_Addressables() const;

  constexpr ::System::Collections::IEnumerable*& __cordl_internal_get_m_Key();

  constexpr ::cordl_internals::to_const_pointer<::System::Collections::IEnumerable*> const& __cordl_internal_get_m_Key() const;

  constexpr ::UnityEngine::AddressableAssets::__Addressables__MergeMode const& __cordl_internal_get_m_MergeMode() const;

  constexpr ::UnityEngine::AddressableAssets::__Addressables__MergeMode& __cordl_internal_get_m_MergeMode();

  constexpr ::System::Type*& __cordl_internal_get_m_ResourceType();

  constexpr ::cordl_internals::to_const_pointer<::System::Type*> const& __cordl_internal_get_m_ResourceType() const;

  constexpr ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>*& __cordl_internal_get_m_locations();

  constexpr ::cordl_internals::to_const_pointer<::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>*> const&
  __cordl_internal_get_m_locations() const;

  constexpr void __cordl_internal_set_m_Addressables(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_m_Key(::System::Collections::IEnumerable* value);

  constexpr void __cordl_internal_set_m_MergeMode(::UnityEngine::AddressableAssets::__Addressables__MergeMode value);

  constexpr void __cordl_internal_set_m_ResourceType(::System::Type* value);

  constexpr void __cordl_internal_set_m_locations(::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* value);

  /// @brief Method .ctor, addr 0x4474e3c, size 0x48, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_DebugName, addr 0x447a110, size 0x40, virtual true, abstract: false, final false
  inline ::StringW get_DebugName();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __AddressablesImpl__LoadResourceLocationKeysOp();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl__LoadResourceLocationKeysOp", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __AddressablesImpl__LoadResourceLocationKeysOp(__AddressablesImpl__LoadResourceLocationKeysOp&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl__LoadResourceLocationKeysOp", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __AddressablesImpl__LoadResourceLocationKeysOp(__AddressablesImpl__LoadResourceLocationKeysOp const&) = delete;

  /// @brief Field m_Key, offset: 0x98, size: 0x8, def value: None
  ::System::Collections::IEnumerable* ___m_Key;

  /// @brief Field m_MergeMode, offset: 0xa0, size: 0x4, def value: None
  ::UnityEngine::AddressableAssets::__Addressables__MergeMode ___m_MergeMode;

  /// @brief Field m_locations, offset: 0xa8, size: 0x8, def value: None
  ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* ___m_locations;

  /// @brief Field m_Addressables, offset: 0xb0, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* ___m_Addressables;

  /// @brief Field m_ResourceType, offset: 0xb8, size: 0x8, def value: None
  ::System::Type* ___m_ResourceType;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 16099 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::__AddressablesImpl__LoadResourceLocationKeysOp, 0xc0>, "Size mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl__LoadResourceLocationKeysOp, ___m_Key) == 0x98, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl__LoadResourceLocationKeysOp, ___m_MergeMode) == 0xa0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl__LoadResourceLocationKeysOp, ___m_locations) == 0xa8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl__LoadResourceLocationKeysOp, ___m_Addressables) == 0xb0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl__LoadResourceLocationKeysOp, ___m_ResourceType) == 0xb8, "Offset mismatch!");

} // namespace UnityEngine::AddressableAssets
// Type: ::<>c
// SizeInfo { instance_size: 16, native_size: -1, calculated_instance_size: 16, calculated_native_size: 16, minimum_alignment: 8, packing: None, specified_packing: None }
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: ::AddressablesImpl::<>c*
class CORDL_TYPE __AddressablesImpl____c : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>9, offset 0xffffffff, size 0x8
  static __declspec(property(get = getStaticF___9, put = setStaticF___9)) ::UnityEngine::AddressableAssets::__AddressablesImpl____c* __9;

  /// @brief Field <>9__149_0, offset 0xffffffff, size 0x8
  static __declspec(property(get = getStaticF___9__149_0, put = setStaticF___9__149_0)) ::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, bool>* __9__149_0;

  /// @brief Field <>9__149_1, offset 0xffffffff, size 0x8
  static __declspec(property(get = getStaticF___9__149_1, put = setStaticF___9__149_1)) ::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::StringW>* __9__149_1;

  /// @brief Field <>9__153_0, offset 0xffffffff, size 0x8
  static __declspec(property(get = getStaticF___9__153_0, put = setStaticF___9__153_0)) ::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::StringW>* __9__153_0;

  /// @brief Field <>9__59_0, offset 0xffffffff, size 0x8
  static __declspec(property(
      get = getStaticF___9__59_0,
      put = setStaticF___9__59_0)) ::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::UnityEngine::AddressableAssets::ResourceLocators::IResourceLocator*>* __9__59_0;

  static inline ::UnityEngine::AddressableAssets::__AddressablesImpl____c* New_ctor();

  /// @brief Method <CleanBundleCache>b__153_0, addr 0x447a3e0, size 0xa4, virtual false, abstract: false, final false
  inline ::StringW _CleanBundleCache_b__153_0(::UnityEngine::AddressableAssets::ResourceLocatorInfo* s);

  /// @brief Method .ctor, addr 0x447a304, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method <get_CatalogsWithAvailableUpdates>b__149_0, addr 0x447a324, size 0x18, virtual false, abstract: false, final false
  inline bool _get_CatalogsWithAvailableUpdates_b__149_0(::UnityEngine::AddressableAssets::ResourceLocatorInfo* s);

  /// @brief Method <get_CatalogsWithAvailableUpdates>b__149_1, addr 0x447a33c, size 0xa4, virtual false, abstract: false, final false
  inline ::StringW _get_CatalogsWithAvailableUpdates_b__149_1(::UnityEngine::AddressableAssets::ResourceLocatorInfo* s);

  /// @brief Method <get_ResourceLocators>b__59_0, addr 0x447a30c, size 0x18, virtual false, abstract: false, final false
  inline ::UnityEngine::AddressableAssets::ResourceLocators::IResourceLocator* _get_ResourceLocators_b__59_0(::UnityEngine::AddressableAssets::ResourceLocatorInfo* l);

  static inline ::UnityEngine::AddressableAssets::__AddressablesImpl____c* getStaticF___9();

  static inline ::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, bool>* getStaticF___9__149_0();

  static inline ::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::StringW>* getStaticF___9__149_1();

  static inline ::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::StringW>* getStaticF___9__153_0();

  static inline ::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::UnityEngine::AddressableAssets::ResourceLocators::IResourceLocator*>* getStaticF___9__59_0();

  static inline void setStaticF___9(::UnityEngine::AddressableAssets::__AddressablesImpl____c* value);

  static inline void setStaticF___9__149_0(::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, bool>* value);

  static inline void setStaticF___9__149_1(::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::StringW>* value);

  static inline void setStaticF___9__153_0(::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::StringW>* value);

  static inline void setStaticF___9__59_0(::System::Func_2<::UnityEngine::AddressableAssets::ResourceLocatorInfo*, ::UnityEngine::AddressableAssets::ResourceLocators::IResourceLocator*>* value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __AddressablesImpl____c();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __AddressablesImpl____c(__AddressablesImpl____c&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __AddressablesImpl____c(__AddressablesImpl____c const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 16100 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::__AddressablesImpl____c, 0x10>, "Size mismatch!");

} // namespace UnityEngine::AddressableAssets
// Type: ::<>c__DisplayClass100_0
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, packing: None, specified_packing: None }
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: ::AddressablesImpl::<>c__DisplayClass100_0*
class CORDL_TYPE __AddressablesImpl____c__DisplayClass100_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field catalogLoc, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_catalogLoc, put = __cordl_internal_set_catalogLoc)) ::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* catalogLoc;

  static inline ::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass100_0* New_ctor();

  /// @brief Method <ComputeCatalogSizeWithChain>b__0, addr 0x447a484, size 0x1f4, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<int64_t>
  _ComputeCatalogSizeWithChain_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::cordl_internals::to_const_pointer<::UnityEngine::AddressableAssets::AddressablesImpl*> const& __cordl_internal_get___4__this() const;

  constexpr ::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*& __cordl_internal_get_catalogLoc();

  constexpr ::cordl_internals::to_const_pointer<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*> const& __cordl_internal_get_catalogLoc() const;

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_catalogLoc(::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* value);

  /// @brief Method .ctor, addr 0x44757dc, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __AddressablesImpl____c__DisplayClass100_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass100_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __AddressablesImpl____c__DisplayClass100_0(__AddressablesImpl____c__DisplayClass100_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass100_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __AddressablesImpl____c__DisplayClass100_0(__AddressablesImpl____c__DisplayClass100_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field catalogLoc, offset: 0x18, size: 0x8, def value: None
  ::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* ___catalogLoc;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 16101 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass100_0, 0x20>, "Size mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass100_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass100_0, ___catalogLoc) == 0x18, "Offset mismatch!");

} // namespace UnityEngine::AddressableAssets
// Type: ::<>c__DisplayClass103_0
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, packing: None, specified_packing: None }
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: ::AddressablesImpl::<>c__DisplayClass103_0*
class CORDL_TYPE __AddressablesImpl____c__DisplayClass103_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field keys, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_keys, put = __cordl_internal_set_keys)) ::System::Collections::IEnumerable* keys;

  static inline ::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass103_0* New_ctor();

  /// @brief Method <GetDownloadSizeWithChain>b__0, addr 0x447a678, size 0x3c, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<int64_t>
  _GetDownloadSizeWithChain_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::cordl_internals::to_const_pointer<::UnityEngine::AddressableAssets::AddressablesImpl*> const& __cordl_internal_get___4__this() const;

  constexpr ::System::Collections::IEnumerable*& __cordl_internal_get_keys();

  constexpr ::cordl_internals::to_const_pointer<::System::Collections::IEnumerable*> const& __cordl_internal_get_keys() const;

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_keys(::System::Collections::IEnumerable* value);

  /// @brief Method .ctor, addr 0x44761a8, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __AddressablesImpl____c__DisplayClass103_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass103_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __AddressablesImpl____c__DisplayClass103_0(__AddressablesImpl____c__DisplayClass103_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass103_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __AddressablesImpl____c__DisplayClass103_0(__AddressablesImpl____c__DisplayClass103_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field keys, offset: 0x18, size: 0x8, def value: None
  ::System::Collections::IEnumerable* ___keys;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 16102 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass103_0, 0x20>, "Size mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass103_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass103_0, ___keys) == 0x18, "Offset mismatch!");

} // namespace UnityEngine::AddressableAssets
// Type: ::<>c__DisplayClass106_0
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, packing: None, specified_packing: None }
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: ::AddressablesImpl::<>c__DisplayClass106_0*
class CORDL_TYPE __AddressablesImpl____c__DisplayClass106_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field key, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_key, put = __cordl_internal_set_key)) ::System::Object* key;

  static inline ::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass106_0* New_ctor();

  /// @brief Method <DownloadDependenciesAsyncWithChain>b__0, addr 0x447a6b4, size 0x8c, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<
      ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceProviders::IAssetBundleResource*>*>
  _DownloadDependenciesAsyncWithChain_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::cordl_internals::to_const_pointer<::UnityEngine::AddressableAssets::AddressablesImpl*> const& __cordl_internal_get___4__this() const;

  constexpr ::System::Object*& __cordl_internal_get_key();

  constexpr ::cordl_internals::to_const_pointer<::System::Object*> const& __cordl_internal_get_key() const;

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_key(::System::Object* value);

  /// @brief Method .ctor, addr 0x4476354, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __AddressablesImpl____c__DisplayClass106_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass106_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __AddressablesImpl____c__DisplayClass106_0(__AddressablesImpl____c__DisplayClass106_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass106_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __AddressablesImpl____c__DisplayClass106_0(__AddressablesImpl____c__DisplayClass106_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field key, offset: 0x18, size: 0x8, def value: None
  ::System::Object* ___key;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 16103 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass106_0, 0x20>, "Size mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass106_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass106_0, ___key) == 0x18, "Offset mismatch!");

} // namespace UnityEngine::AddressableAssets
// Type: ::<>c__DisplayClass110_0
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, packing: None, specified_packing: None }
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: ::AddressablesImpl::<>c__DisplayClass110_0*
class CORDL_TYPE __AddressablesImpl____c__DisplayClass110_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field locations, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_locations,
                      put = __cordl_internal_set_locations)) ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* locations;

  static inline ::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass110_0* New_ctor();

  /// @brief Method <DownloadDependenciesAsyncWithChain>b__0, addr 0x447a740, size 0x8c, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<
      ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceProviders::IAssetBundleResource*>*>
  _DownloadDependenciesAsyncWithChain_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::cordl_internals::to_const_pointer<::UnityEngine::AddressableAssets::AddressablesImpl*> const& __cordl_internal_get___4__this() const;

  constexpr ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>*& __cordl_internal_get_locations();

  constexpr ::cordl_internals::to_const_pointer<::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>*> const&
  __cordl_internal_get_locations() const;

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_locations(::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* value);

  /// @brief Method .ctor, addr 0x4476eb0, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __AddressablesImpl____c__DisplayClass110_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass110_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __AddressablesImpl____c__DisplayClass110_0(__AddressablesImpl____c__DisplayClass110_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass110_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __AddressablesImpl____c__DisplayClass110_0(__AddressablesImpl____c__DisplayClass110_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field locations, offset: 0x18, size: 0x8, def value: None
  ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* ___locations;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 16104 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass110_0, 0x20>, "Size mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass110_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass110_0, ___locations) == 0x18, "Offset mismatch!");

} // namespace UnityEngine::AddressableAssets
// Type: ::<>c__DisplayClass112_0
// SizeInfo { instance_size: 40, native_size: -1, calculated_instance_size: 40, calculated_native_size: 36, minimum_alignment: 8, packing: None, specified_packing: None }
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: ::AddressablesImpl::<>c__DisplayClass112_0*
class CORDL_TYPE __AddressablesImpl____c__DisplayClass112_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field keys, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_keys, put = __cordl_internal_set_keys)) ::System::Collections::IEnumerable* keys;

  /// @brief Field mode, offset 0x20, size 0x4
  __declspec(property(get = __cordl_internal_get_mode, put = __cordl_internal_set_mode)) ::UnityEngine::AddressableAssets::__Addressables__MergeMode mode;

  static inline ::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass112_0* New_ctor();

  /// @brief Method <DownloadDependenciesAsyncWithChain>b__0, addr 0x447a7cc, size 0x90, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<
      ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceProviders::IAssetBundleResource*>*>
  _DownloadDependenciesAsyncWithChain_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::cordl_internals::to_const_pointer<::UnityEngine::AddressableAssets::AddressablesImpl*> const& __cordl_internal_get___4__this() const;

  constexpr ::System::Collections::IEnumerable*& __cordl_internal_get_keys();

  constexpr ::cordl_internals::to_const_pointer<::System::Collections::IEnumerable*> const& __cordl_internal_get_keys() const;

  constexpr ::UnityEngine::AddressableAssets::__Addressables__MergeMode const& __cordl_internal_get_mode() const;

  constexpr ::UnityEngine::AddressableAssets::__Addressables__MergeMode& __cordl_internal_get_mode();

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_keys(::System::Collections::IEnumerable* value);

  constexpr void __cordl_internal_set_mode(::UnityEngine::AddressableAssets::__Addressables__MergeMode value);

  /// @brief Method .ctor, addr 0x4477064, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __AddressablesImpl____c__DisplayClass112_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass112_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __AddressablesImpl____c__DisplayClass112_0(__AddressablesImpl____c__DisplayClass112_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass112_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __AddressablesImpl____c__DisplayClass112_0(__AddressablesImpl____c__DisplayClass112_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field keys, offset: 0x18, size: 0x8, def value: None
  ::System::Collections::IEnumerable* ___keys;

  /// @brief Field mode, offset: 0x20, size: 0x4, def value: None
  ::UnityEngine::AddressableAssets::__Addressables__MergeMode ___mode;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 16105 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass112_0, 0x28>, "Size mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass112_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass112_0, ___keys) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass112_0, ___mode) == 0x20, "Offset mismatch!");

} // namespace UnityEngine::AddressableAssets
// Type: ::<>c__DisplayClass117_0`1
// SizeInfo { instance_size: 32, native_size: 32, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, packing: None, specified_packing: None }
namespace UnityEngine::AddressableAssets {
// cpp template
template <typename TObject>
// Is value type: false
// CS Name: ::AddressablesImpl::<>c__DisplayClass117_0`1<TObject>*
class CORDL_TYPE __AddressablesImpl____c__DisplayClass117_0_1 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field unloadSceneOpExcludeReleaseCallback, offset 0x10, size 0x1
  __declspec(property(get = __cordl_internal_get_unloadSceneOpExcludeReleaseCallback, put = __cordl_internal_set_unloadSceneOpExcludeReleaseCallback)) bool unloadSceneOpExcludeReleaseCallback;

  static inline ::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass117_0_1<TObject>* New_ctor();

  /// @brief Method <AutoReleaseHandleOnCompletion>b__0, addr 0x0, size 0xffffffffffffffff, virtual false, abstract: false, final false
  inline void _AutoReleaseHandleOnCompletion_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<TObject> op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::cordl_internals::to_const_pointer<::UnityEngine::AddressableAssets::AddressablesImpl*> const& __cordl_internal_get___4__this() const;

  constexpr bool const& __cordl_internal_get_unloadSceneOpExcludeReleaseCallback() const;

  constexpr bool& __cordl_internal_get_unloadSceneOpExcludeReleaseCallback();

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_unloadSceneOpExcludeReleaseCallback(bool value);

  /// @brief Method .ctor, addr 0x0, size 0xffffffffffffffff, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __AddressablesImpl____c__DisplayClass117_0_1();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass117_0_1", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __AddressablesImpl____c__DisplayClass117_0_1(__AddressablesImpl____c__DisplayClass117_0_1&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass117_0_1", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __AddressablesImpl____c__DisplayClass117_0_1(__AddressablesImpl____c__DisplayClass117_0_1 const&) = delete;

  /// @brief Field unloadSceneOpExcludeReleaseCallback, offset: 0x10, size: 0x1, def value: None
  bool ___unloadSceneOpExcludeReleaseCallback;

  /// @brief Field <>4__this, offset: 0x18, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 16106 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
} // namespace UnityEngine::AddressableAssets
// Type: ::<>c__DisplayClass119_0
// SizeInfo { instance_size: 40, native_size: -1, calculated_instance_size: 40, calculated_native_size: 33, minimum_alignment: 8, packing: None, specified_packing: None }
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: ::AddressablesImpl::<>c__DisplayClass119_0*
class CORDL_TYPE __AddressablesImpl____c__DisplayClass119_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field autoReleaseHandle, offset 0x20, size 0x1
  __declspec(property(get = __cordl_internal_get_autoReleaseHandle, put = __cordl_internal_set_autoReleaseHandle)) bool autoReleaseHandle;

  /// @brief Field key, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_key, put = __cordl_internal_set_key)) ::System::Object* key;

  static inline ::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass119_0* New_ctor();

  /// @brief Method <ClearDependencyCacheAsync>b__0, addr 0x447a85c, size 0x40, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<bool> _ClearDependencyCacheAsync_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::cordl_internals::to_const_pointer<::UnityEngine::AddressableAssets::AddressablesImpl*> const& __cordl_internal_get___4__this() const;

  constexpr bool const& __cordl_internal_get_autoReleaseHandle() const;

  constexpr bool& __cordl_internal_get_autoReleaseHandle();

  constexpr ::System::Object*& __cordl_internal_get_key();

  constexpr ::cordl_internals::to_const_pointer<::System::Object*> const& __cordl_internal_get_key() const;

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_autoReleaseHandle(bool value);

  constexpr void __cordl_internal_set_key(::System::Object* value);

  /// @brief Method .ctor, addr 0x4477850, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __AddressablesImpl____c__DisplayClass119_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass119_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __AddressablesImpl____c__DisplayClass119_0(__AddressablesImpl____c__DisplayClass119_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass119_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __AddressablesImpl____c__DisplayClass119_0(__AddressablesImpl____c__DisplayClass119_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field key, offset: 0x18, size: 0x8, def value: None
  ::System::Object* ___key;

  /// @brief Field autoReleaseHandle, offset: 0x20, size: 0x1, def value: None
  bool ___autoReleaseHandle;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 16107 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass119_0, 0x28>, "Size mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass119_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass119_0, ___key) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass119_0, ___autoReleaseHandle) == 0x20, "Offset mismatch!");

} // namespace UnityEngine::AddressableAssets
// Type: ::<>c__DisplayClass120_0
// SizeInfo { instance_size: 40, native_size: -1, calculated_instance_size: 40, calculated_native_size: 33, minimum_alignment: 8, packing: None, specified_packing: None }
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: ::AddressablesImpl::<>c__DisplayClass120_0*
class CORDL_TYPE __AddressablesImpl____c__DisplayClass120_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field autoReleaseHandle, offset 0x20, size 0x1
  __declspec(property(get = __cordl_internal_get_autoReleaseHandle, put = __cordl_internal_set_autoReleaseHandle)) bool autoReleaseHandle;

  /// @brief Field locations, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_locations,
                      put = __cordl_internal_set_locations)) ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* locations;

  static inline ::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass120_0* New_ctor();

  /// @brief Method <ClearDependencyCacheAsync>b__0, addr 0x447a89c, size 0x40, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<bool> _ClearDependencyCacheAsync_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::cordl_internals::to_const_pointer<::UnityEngine::AddressableAssets::AddressablesImpl*> const& __cordl_internal_get___4__this() const;

  constexpr bool const& __cordl_internal_get_autoReleaseHandle() const;

  constexpr bool& __cordl_internal_get_autoReleaseHandle();

  constexpr ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>*& __cordl_internal_get_locations();

  constexpr ::cordl_internals::to_const_pointer<::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>*> const&
  __cordl_internal_get_locations() const;

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_autoReleaseHandle(bool value);

  constexpr void __cordl_internal_set_locations(::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* value);

  /// @brief Method .ctor, addr 0x4477858, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __AddressablesImpl____c__DisplayClass120_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass120_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __AddressablesImpl____c__DisplayClass120_0(__AddressablesImpl____c__DisplayClass120_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass120_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __AddressablesImpl____c__DisplayClass120_0(__AddressablesImpl____c__DisplayClass120_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field locations, offset: 0x18, size: 0x8, def value: None
  ::System::Collections::Generic::IList_1<::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*>* ___locations;

  /// @brief Field autoReleaseHandle, offset: 0x20, size: 0x1, def value: None
  bool ___autoReleaseHandle;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 16108 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass120_0, 0x28>, "Size mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass120_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass120_0, ___locations) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass120_0, ___autoReleaseHandle) == 0x20, "Offset mismatch!");

} // namespace UnityEngine::AddressableAssets
// Type: ::<>c__DisplayClass121_0
// SizeInfo { instance_size: 40, native_size: -1, calculated_instance_size: 40, calculated_native_size: 33, minimum_alignment: 8, packing: None, specified_packing: None }
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: ::AddressablesImpl::<>c__DisplayClass121_0*
class CORDL_TYPE __AddressablesImpl____c__DisplayClass121_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field autoReleaseHandle, offset 0x20, size 0x1
  __declspec(property(get = __cordl_internal_get_autoReleaseHandle, put = __cordl_internal_set_autoReleaseHandle)) bool autoReleaseHandle;

  /// @brief Field keys, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_keys, put = __cordl_internal_set_keys)) ::System::Collections::IEnumerable* keys;

  static inline ::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass121_0* New_ctor();

  /// @brief Method <ClearDependencyCacheAsync>b__0, addr 0x447a8dc, size 0x40, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<bool> _ClearDependencyCacheAsync_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::cordl_internals::to_const_pointer<::UnityEngine::AddressableAssets::AddressablesImpl*> const& __cordl_internal_get___4__this() const;

  constexpr bool const& __cordl_internal_get_autoReleaseHandle() const;

  constexpr bool& __cordl_internal_get_autoReleaseHandle();

  constexpr ::System::Collections::IEnumerable*& __cordl_internal_get_keys();

  constexpr ::cordl_internals::to_const_pointer<::System::Collections::IEnumerable*> const& __cordl_internal_get_keys() const;

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_autoReleaseHandle(bool value);

  constexpr void __cordl_internal_set_keys(::System::Collections::IEnumerable* value);

  /// @brief Method .ctor, addr 0x4477860, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __AddressablesImpl____c__DisplayClass121_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass121_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __AddressablesImpl____c__DisplayClass121_0(__AddressablesImpl____c__DisplayClass121_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass121_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __AddressablesImpl____c__DisplayClass121_0(__AddressablesImpl____c__DisplayClass121_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field keys, offset: 0x18, size: 0x8, def value: None
  ::System::Collections::IEnumerable* ___keys;

  /// @brief Field autoReleaseHandle, offset: 0x20, size: 0x1, def value: None
  bool ___autoReleaseHandle;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 16109 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass121_0, 0x28>, "Size mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass121_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass121_0, ___keys) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass121_0, ___autoReleaseHandle) == 0x20, "Offset mismatch!");

} // namespace UnityEngine::AddressableAssets
// Type: ::<>c__DisplayClass126_0
// SizeInfo { instance_size: 80, native_size: -1, calculated_instance_size: 80, calculated_native_size: 80, minimum_alignment: 8, packing: None, specified_packing: None }
namespace UnityEngine::AddressableAssets {
// Is value type: false
// CS Name: ::AddressablesImpl::<>c__DisplayClass126_0*
class CORDL_TYPE __AddressablesImpl____c__DisplayClass126_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>4__this, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get___4__this, put = __cordl_internal_set___4__this)) ::UnityEngine::AddressableAssets::AddressablesImpl* __4__this;

  /// @brief Field instantiateParameters, offset 0x20, size 0x30
  __declspec(property(get = __cordl_internal_get_instantiateParameters,
                      put = __cordl_internal_set_instantiateParameters)) ::UnityEngine::ResourceManagement::ResourceProviders::InstantiationParameters instantiateParameters;

  /// @brief Field key, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_key, put = __cordl_internal_set_key)) ::System::Object* key;

  static inline ::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass126_0* New_ctor();

  /// @brief Method <InstantiateWithChain>b__0, addr 0x447a91c, size 0x64, virtual false, abstract: false, final false
  inline ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<::UnityW<::UnityEngine::GameObject>>
  _InstantiateWithChain_b__0(::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle op);

  constexpr ::UnityEngine::AddressableAssets::AddressablesImpl*& __cordl_internal_get___4__this();

  constexpr ::cordl_internals::to_const_pointer<::UnityEngine::AddressableAssets::AddressablesImpl*> const& __cordl_internal_get___4__this() const;

  constexpr ::UnityEngine::ResourceManagement::ResourceProviders::InstantiationParameters const& __cordl_internal_get_instantiateParameters() const;

  constexpr ::UnityEngine::ResourceManagement::ResourceProviders::InstantiationParameters& __cordl_internal_get_instantiateParameters();

  constexpr ::System::Object*& __cordl_internal_get_key();

  constexpr ::cordl_internals::to_const_pointer<::System::Object*> const& __cordl_internal_get_key() const;

  constexpr void __cordl_internal_set___4__this(::UnityEngine::AddressableAssets::AddressablesImpl* value);

  constexpr void __cordl_internal_set_instantiateParameters(::UnityEngine::ResourceManagement::ResourceProviders::InstantiationParameters value);

  constexpr void __cordl_internal_set_key(::System::Object* value);

  /// @brief Method .ctor, addr 0x4477a6c, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __AddressablesImpl____c__DisplayClass126_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass126_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __AddressablesImpl____c__DisplayClass126_0(__AddressablesImpl____c__DisplayClass126_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__AddressablesImpl____c__DisplayClass126_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __AddressablesImpl____c__DisplayClass126_0(__AddressablesImpl____c__DisplayClass126_0 const&) = delete;

  /// @brief Field <>4__this, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AddressableAssets::AddressablesImpl* _____4__this;

  /// @brief Field key, offset: 0x18, size: 0x8, def value: None
  ::System::Object* ___key;

  /// @brief Field instantiateParameters, offset: 0x20, size: 0x30, def value: None
  ::UnityEngine::ResourceManagement::ResourceProviders::InstantiationParameters ___instantiateParameters;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 16110 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass126_0, 0x50>, "Size mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass126_0, _____4__this) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass126_0, ___key) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::AddressableAssets::__AddressablesImpl____c__DisplayClass126_0, ___instantiateParameters) == 0x20, "Offset mismatch!");

} // namespace UnityEngine::AddressableAssets
// Type: ::<>c__DisplayClass128_0
// SizeInfo { instance_size: 80, native_size: -1, calculated_instance_size: 80, calculated_native_size: 80, minimum_alignment: 8, packing: None, specified_packing: None }
namespace UnityEngine::AddressableAssets {
// Is value type: false
