#pragma once
// IWYU pragma private; include "Org/BouncyCastle/Math/EC/Rfc8032/Ed25519.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../../../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__Object_def.hpp"
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(Ed25519)
namespace Org::BouncyCastle::Crypto {
class IDigest;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
struct Ed25519_Algorithm;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class Ed25519_PointAccum;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class Ed25519_PointExt;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class Ed25519_PointPrecomp;
}
namespace Org::BouncyCastle::Security {
class SecureRandom;
}
namespace System {
class Object;
}
// Forward declare root types
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
struct Ed25519_Algorithm;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class Ed25519;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class Ed25519_PointAccum;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class Ed25519_PointExt;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class Ed25519_PointPrecomp;
}
// Write type traits
MARK_VAL_T(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_Algorithm);
MARK_REF_PTR_T(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519);
MARK_REF_PTR_T(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointAccum);
MARK_REF_PTR_T(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointExt);
MARK_REF_PTR_T(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointPrecomp);
// Dependencies
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
// Is value type: true
// CS Name: Org.BouncyCastle.Math.EC.Rfc8032.Ed25519/Algorithm
struct CORDL_TYPE Ed25519_Algorithm {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct __Ed25519_Algorithm_Unwrapped
  enum struct __Ed25519_Algorithm_Unwrapped : int32_t {
    __E_Ed25519 = static_cast<int32_t>(0x0),
    __E_Ed25519ctx = static_cast<int32_t>(0x1),
    __E_Ed25519ph = static_cast<int32_t>(0x2),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __Ed25519_Algorithm_Unwrapped() const noexcept {
    return static_cast<__Ed25519_Algorithm_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr Ed25519_Algorithm();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr Ed25519_Algorithm(int32_t value__) noexcept;

  /// @brief Field Ed25519 value: I32(0)
  static ::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_Algorithm const Ed25519;

  /// @brief Field Ed25519ctx value: I32(1)
  static ::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_Algorithm const Ed25519ctx;

  /// @brief Field Ed25519ph value: I32(2)
  static ::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_Algorithm const Ed25519ph;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 1556 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_Algorithm, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_Algorithm, 0x4>, "Size mismatch!");

} // namespace Org::BouncyCastle::Math::EC::Rfc8032
// Dependencies System.Object
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
// Is value type: false
// CS Name: Org.BouncyCastle.Math.EC.Rfc8032.Ed25519/PointAccum
class CORDL_TYPE Ed25519_PointAccum : public ::System::Object {
public:
  // Declarations
  /// @brief Field u, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_u, put = __cordl_internal_set_u)) ::ArrayW<int32_t, ::Array<int32_t>*> u;

  /// @brief Field v, offset 0x30, size 0x8
  __declspec(property(get = __cordl_internal_get_v, put = __cordl_internal_set_v)) ::ArrayW<int32_t, ::Array<int32_t>*> v;

  /// @brief Field x, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_x, put = __cordl_internal_set_x)) ::ArrayW<int32_t, ::Array<int32_t>*> x;

  /// @brief Field y, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_y, put = __cordl_internal_set_y)) ::ArrayW<int32_t, ::Array<int32_t>*> y;

  /// @brief Field z, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_z, put = __cordl_internal_set_z)) ::ArrayW<int32_t, ::Array<int32_t>*> z;

  static inline ::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointAccum* New_ctor();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __cordl_internal_get_u() const;

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __cordl_internal_get_u();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __cordl_internal_get_v() const;

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __cordl_internal_get_v();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __cordl_internal_get_x() const;

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __cordl_internal_get_x();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __cordl_internal_get_y() const;

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __cordl_internal_get_y();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __cordl_internal_get_z() const;

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __cordl_internal_get_z();

  constexpr void __cordl_internal_set_u(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr void __cordl_internal_set_v(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr void __cordl_internal_set_x(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr void __cordl_internal_set_y(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr void __cordl_internal_set_z(::ArrayW<int32_t, ::Array<int32_t>*> value);

  /// @brief Method .ctor, addr 0x24cb3b0, size 0x94, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr Ed25519_PointAccum();

public:
  // Ctor Parameters [CppParam { name: "", ty: "Ed25519_PointAccum", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  Ed25519_PointAccum(Ed25519_PointAccum&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "Ed25519_PointAccum", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  Ed25519_PointAccum(Ed25519_PointAccum const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 1557 };

  /// @brief Field x, offset: 0x10, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___x;

  /// @brief Field y, offset: 0x18, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___y;

  /// @brief Field z, offset: 0x20, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___z;

  /// @brief Field u, offset: 0x28, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___u;

  /// @brief Field v, offset: 0x30, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___v;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointAccum, ___x) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointAccum, ___y) == 0x18, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointAccum, ___z) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointAccum, ___u) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointAccum, ___v) == 0x30, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointAccum, 0x38>, "Size mismatch!");

} // namespace Org::BouncyCastle::Math::EC::Rfc8032
// Dependencies System.Object
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
// Is value type: false
// CS Name: Org.BouncyCastle.Math.EC.Rfc8032.Ed25519/PointExt
class CORDL_TYPE Ed25519_PointExt : public ::System::Object {
public:
  // Declarations
  /// @brief Field t, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_t, put = __cordl_internal_set_t)) ::ArrayW<int32_t, ::Array<int32_t>*> t;

  /// @brief Field x, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_x, put = __cordl_internal_set_x)) ::ArrayW<int32_t, ::Array<int32_t>*> x;

  /// @brief Field y, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_y, put = __cordl_internal_set_y)) ::ArrayW<int32_t, ::Array<int32_t>*> y;

  /// @brief Field z, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_z, put = __cordl_internal_set_z)) ::ArrayW<int32_t, ::Array<int32_t>*> z;

  static inline ::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointExt* New_ctor();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __cordl_internal_get_t() const;

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __cordl_internal_get_t();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __cordl_internal_get_x() const;

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __cordl_internal_get_x();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __cordl_internal_get_y() const;

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __cordl_internal_get_y();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __cordl_internal_get_z() const;

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __cordl_internal_get_z();

  constexpr void __cordl_internal_set_t(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr void __cordl_internal_set_x(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr void __cordl_internal_set_y(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr void __cordl_internal_set_z(::ArrayW<int32_t, ::Array<int32_t>*> value);

  /// @brief Method .ctor, addr 0x24cb444, size 0x88, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr Ed25519_PointExt();

public:
  // Ctor Parameters [CppParam { name: "", ty: "Ed25519_PointExt", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  Ed25519_PointExt(Ed25519_PointExt&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "Ed25519_PointExt", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  Ed25519_PointExt(Ed25519_PointExt const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 1558 };

  /// @brief Field x, offset: 0x10, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___x;

  /// @brief Field y, offset: 0x18, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___y;

  /// @brief Field z, offset: 0x20, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___z;

  /// @brief Field t, offset: 0x28, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___t;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointExt, ___x) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointExt, ___y) == 0x18, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointExt, ___z) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointExt, ___t) == 0x28, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointExt, 0x30>, "Size mismatch!");

} // namespace Org::BouncyCastle::Math::EC::Rfc8032
// Dependencies System.Object
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
// Is value type: false
// CS Name: Org.BouncyCastle.Math.EC.Rfc8032.Ed25519/PointPrecomp
class CORDL_TYPE Ed25519_PointPrecomp : public ::System::Object {
public:
  // Declarations
  /// @brief Field xyd, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_xyd, put = __cordl_internal_set_xyd)) ::ArrayW<int32_t, ::Array<int32_t>*> xyd;

  /// @brief Field ymx_h, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_ymx_h, put = __cordl_internal_set_ymx_h)) ::ArrayW<int32_t, ::Array<int32_t>*> ymx_h;

  /// @brief Field ypx_h, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_ypx_h, put = __cordl_internal_set_ypx_h)) ::ArrayW<int32_t, ::Array<int32_t>*> ypx_h;

  static inline ::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointPrecomp* New_ctor();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __cordl_internal_get_xyd() const;

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __cordl_internal_get_xyd();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __cordl_internal_get_ymx_h() const;

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __cordl_internal_get_ymx_h();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __cordl_internal_get_ypx_h() const;

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __cordl_internal_get_ypx_h();

  constexpr void __cordl_internal_set_xyd(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr void __cordl_internal_set_ymx_h(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr void __cordl_internal_set_ypx_h(::ArrayW<int32_t, ::Array<int32_t>*> value);

  /// @brief Method .ctor, addr 0x24cb4cc, size 0x7c, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr Ed25519_PointPrecomp();

public:
  // Ctor Parameters [CppParam { name: "", ty: "Ed25519_PointPrecomp", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  Ed25519_PointPrecomp(Ed25519_PointPrecomp&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "Ed25519_PointPrecomp", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  Ed25519_PointPrecomp(Ed25519_PointPrecomp const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 1559 };

  /// @brief Field ypx_h, offset: 0x10, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___ypx_h;

  /// @brief Field ymx_h, offset: 0x18, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___ymx_h;

  /// @brief Field xyd, offset: 0x20, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___xyd;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointPrecomp, ___ypx_h) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointPrecomp, ___ymx_h) == 0x18, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointPrecomp, ___xyd) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointPrecomp, 0x28>, "Size mismatch!");

} // namespace Org::BouncyCastle::Math::EC::Rfc8032
// Dependencies System.Object
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
// Is value type: false
// CS Name: Org.BouncyCastle.Math.EC.Rfc8032.Ed25519
class CORDL_TYPE Ed25519 : public ::System::Object {
public:
  // Declarations
  using Algorithm = ::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_Algorithm;

  using PointAccum = ::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointAccum;

  using PointExt = ::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointExt;

  using PointPrecomp = ::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519_PointPrecomp;

  /// @brief Field B_x, offset 0xffffffff, size 0x8
