#pragma once
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../../../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__Object_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(Ed25519)
namespace Org::BouncyCastle::Crypto {
class IDigest;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
struct __Ed25519__Algorithm;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class __Ed25519__PointPrecomp;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class __Ed25519__PointAccum;
}
namespace System {
class Object;
}
namespace Org::BouncyCastle::Security {
class SecureRandom;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class __Ed25519__PointExt;
}
// Forward declare root types
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
struct __Ed25519__Algorithm;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class Ed25519;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class __Ed25519__PointAccum;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class __Ed25519__PointExt;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class __Ed25519__PointPrecomp;
}
// Write type traits
MARK_VAL_T(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__Algorithm);
MARK_REF_PTR_T(::Org::BouncyCastle::Math::EC::Rfc8032::Ed25519);
MARK_REF_PTR_T(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointAccum);
MARK_REF_PTR_T(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointExt);
MARK_REF_PTR_T(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointPrecomp);
// Type: ::Algorithm
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
// Is value type: true
// Dependencies: {}
// Self: TypeDefinitionIndex(TypeDefinitionIndex(1556))
// CS Name: ::Ed25519::Algorithm
struct CORDL_TYPE __Ed25519__Algorithm {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____Ed25519__Algorithm_Unwrapped
  enum struct ____Ed25519__Algorithm_Unwrapped : int32_t {
    __E_Ed25519 = static_cast<int32_t>(0x0),
    __E_Ed25519ctx = static_cast<int32_t>(0x1),
    __E_Ed25519ph = static_cast<int32_t>(0x2),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____Ed25519__Algorithm_Unwrapped() const noexcept {
    return static_cast<____Ed25519__Algorithm_Unwrapped>(this->value__);
  }

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __Ed25519__Algorithm(int32_t value__) noexcept;

  // Ctor Parameters []
  // @brief default ctor
  constexpr __Ed25519__Algorithm();

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field Ed25519 value: static_cast<int32_t>(0x0)
  static ::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__Algorithm const Ed25519;

  /// @brief Field Ed25519ctx value: static_cast<int32_t>(0x1)
  static ::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__Algorithm const Ed25519ctx;

  /// @brief Field Ed25519ph value: static_cast<int32_t>(0x2)
  static ::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__Algorithm const Ed25519ph;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__Algorithm, 0x4>, "Size mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__Algorithm, value__) == 0x0, "Offset mismatch!");

} // namespace Org::BouncyCastle::Math::EC::Rfc8032
// Type: ::PointAccum
// SizeInfo { instance_size: 56, native_size: -1, calculated_instance_size: 56, calculated_native_size: 56, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
// Is value type: false
// Dependencies: {TypeDefinitionIndex(TypeDefinitionIndex(2613))}
// Self: TypeDefinitionIndex(TypeDefinitionIndex(1557))
// CS Name: ::Ed25519::PointAccum*
class CORDL_TYPE __Ed25519__PointAccum : public ::System::Object {
public:
  // Declarations
  /// @brief Field x, offset 0x10, size 0x8
  __declspec(property(get = __get_x, put = __set_x))::ArrayW<int32_t, ::Array<int32_t>*> x;

  /// @brief Field y, offset 0x18, size 0x8
  __declspec(property(get = __get_y, put = __set_y))::ArrayW<int32_t, ::Array<int32_t>*> y;

  /// @brief Field z, offset 0x20, size 0x8
  __declspec(property(get = __get_z, put = __set_z))::ArrayW<int32_t, ::Array<int32_t>*> z;

  /// @brief Field u, offset 0x28, size 0x8
  __declspec(property(get = __get_u, put = __set_u))::ArrayW<int32_t, ::Array<int32_t>*> u;

  /// @brief Field v, offset 0x30, size 0x8
  __declspec(property(get = __get_v, put = __set_v))::ArrayW<int32_t, ::Array<int32_t>*> v;

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __get_x();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __get_x() const;

  constexpr void __set_x(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __get_y();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __get_y() const;

  constexpr void __set_y(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __get_z();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __get_z() const;

  constexpr void __set_z(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __get_u();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __get_u() const;

  constexpr void __set_u(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __get_v();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __get_v() const;

  constexpr void __set_v(::ArrayW<int32_t, ::Array<int32_t>*> value);

  static inline ::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointAccum* New_ctor();

  /// @brief Method .ctor, addr 0x104505c, size 0x94, virtual false, abstract: false, final false
  inline void _ctor();

  // Ctor Parameters [CppParam { name: "", ty: "__Ed25519__PointAccum", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __Ed25519__PointAccum(__Ed25519__PointAccum&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__Ed25519__PointAccum", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __Ed25519__PointAccum(__Ed25519__PointAccum const&) = delete;

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __Ed25519__PointAccum();

public:
  /// @brief Field x, offset: 0x10, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___x;

  /// @brief Field y, offset: 0x18, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___y;

  /// @brief Field z, offset: 0x20, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___z;

  /// @brief Field u, offset: 0x28, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___u;

  /// @brief Field v, offset: 0x30, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___v;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointAccum, 0x38>, "Size mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointAccum, ___x) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointAccum, ___y) == 0x18, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointAccum, ___z) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointAccum, ___u) == 0x28, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointAccum, ___v) == 0x30, "Offset mismatch!");

} // namespace Org::BouncyCastle::Math::EC::Rfc8032
// Type: ::PointExt
// SizeInfo { instance_size: 48, native_size: -1, calculated_instance_size: 48, calculated_native_size: 48, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
// Is value type: false
// Dependencies: {TypeDefinitionIndex(TypeDefinitionIndex(2613))}
// Self: TypeDefinitionIndex(TypeDefinitionIndex(1558))
// CS Name: ::Ed25519::PointExt*
class CORDL_TYPE __Ed25519__PointExt : public ::System::Object {
public:
  // Declarations
  /// @brief Field x, offset 0x10, size 0x8
  __declspec(property(get = __get_x, put = __set_x))::ArrayW<int32_t, ::Array<int32_t>*> x;

  /// @brief Field y, offset 0x18, size 0x8
  __declspec(property(get = __get_y, put = __set_y))::ArrayW<int32_t, ::Array<int32_t>*> y;

  /// @brief Field z, offset 0x20, size 0x8
  __declspec(property(get = __get_z, put = __set_z))::ArrayW<int32_t, ::Array<int32_t>*> z;

  /// @brief Field t, offset 0x28, size 0x8
  __declspec(property(get = __get_t, put = __set_t))::ArrayW<int32_t, ::Array<int32_t>*> t;

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __get_x();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __get_x() const;

  constexpr void __set_x(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __get_y();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __get_y() const;

  constexpr void __set_y(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __get_z();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __get_z() const;

  constexpr void __set_z(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __get_t();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __get_t() const;

  constexpr void __set_t(::ArrayW<int32_t, ::Array<int32_t>*> value);

  static inline ::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointExt* New_ctor();

  /// @brief Method .ctor, addr 0x10450f0, size 0x88, virtual false, abstract: false, final false
  inline void _ctor();

  // Ctor Parameters [CppParam { name: "", ty: "__Ed25519__PointExt", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __Ed25519__PointExt(__Ed25519__PointExt&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__Ed25519__PointExt", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __Ed25519__PointExt(__Ed25519__PointExt const&) = delete;

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __Ed25519__PointExt();

public:
  /// @brief Field x, offset: 0x10, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___x;

  /// @brief Field y, offset: 0x18, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___y;

  /// @brief Field z, offset: 0x20, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___z;

  /// @brief Field t, offset: 0x28, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___t;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointExt, 0x30>, "Size mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointExt, ___x) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointExt, ___y) == 0x18, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointExt, ___z) == 0x20, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointExt, ___t) == 0x28, "Offset mismatch!");

} // namespace Org::BouncyCastle::Math::EC::Rfc8032
// Type: ::PointPrecomp
// SizeInfo { instance_size: 40, native_size: -1, calculated_instance_size: 40, calculated_native_size: 40, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
// Is value type: false
// Dependencies: {TypeDefinitionIndex(TypeDefinitionIndex(2613))}
// Self: TypeDefinitionIndex(TypeDefinitionIndex(1559))
// CS Name: ::Ed25519::PointPrecomp*
class CORDL_TYPE __Ed25519__PointPrecomp : public ::System::Object {
public:
  // Declarations
  /// @brief Field ypx_h, offset 0x10, size 0x8
  __declspec(property(get = __get_ypx_h, put = __set_ypx_h))::ArrayW<int32_t, ::Array<int32_t>*> ypx_h;

  /// @brief Field ymx_h, offset 0x18, size 0x8
  __declspec(property(get = __get_ymx_h, put = __set_ymx_h))::ArrayW<int32_t, ::Array<int32_t>*> ymx_h;

  /// @brief Field xyd, offset 0x20, size 0x8
  __declspec(property(get = __get_xyd, put = __set_xyd))::ArrayW<int32_t, ::Array<int32_t>*> xyd;

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __get_ypx_h();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __get_ypx_h() const;

  constexpr void __set_ypx_h(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __get_ymx_h();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __get_ymx_h() const;

  constexpr void __set_ymx_h(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __get_xyd();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __get_xyd() const;

  constexpr void __set_xyd(::ArrayW<int32_t, ::Array<int32_t>*> value);

  static inline ::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointPrecomp* New_ctor();

  /// @brief Method .ctor, addr 0x1045178, size 0x7c, virtual false, abstract: false, final false
  inline void _ctor();

  // Ctor Parameters [CppParam { name: "", ty: "__Ed25519__PointPrecomp", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __Ed25519__PointPrecomp(__Ed25519__PointPrecomp&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__Ed25519__PointPrecomp", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __Ed25519__PointPrecomp(__Ed25519__PointPrecomp const&) = delete;

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __Ed25519__PointPrecomp();

public:
  /// @brief Field ypx_h, offset: 0x10, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___ypx_h;

  /// @brief Field ymx_h, offset: 0x18, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___ymx_h;

  /// @brief Field xyd, offset: 0x20, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___xyd;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointPrecomp, 0x28>, "Size mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointPrecomp, ___ypx_h) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointPrecomp, ___ymx_h) == 0x18, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointPrecomp, ___xyd) == 0x20, "Offset mismatch!");

} // namespace Org::BouncyCastle::Math::EC::Rfc8032
// Type: Org.BouncyCastle.Math.EC.Rfc8032::Ed25519
// SizeInfo { instance_size: 16, native_size: -1, calculated_instance_size: 16, calculated_native_size: 16, minimum_alignment: 8, natural_alignment: 0, packing: None, specified_packing: None }
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
// Is value type: false
// Dependencies: {TypeDefinitionIndex(TypeDefinitionIndex(2613))}
// Self: TypeDefinitionIndex(TypeDefinitionIndex(1560))
// CS Name: ::Org.BouncyCastle.Math.EC.Rfc8032::Ed25519*
class CORDL_TYPE Ed25519 : public ::System::Object {
public:
  // Declarations
  using PointPrecomp = ::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointPrecomp;

  using PointExt = ::Org::BouncyCastle::Math::EC::Rfc8032::__Ed25519__PointExt;

