#pragma once
// IWYU pragma private; include "Org/BouncyCastle/Math/EC/Rfc8032/Ed448.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../../../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__Object_def.hpp"
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(Ed448)
namespace Org::BouncyCastle::Crypto {
class IXof;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
struct Ed448_Algorithm;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class Ed448_PointExt;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class Ed448_PointPrecomp;
}
namespace Org::BouncyCastle::Math {
class BigInteger;
}
namespace Org::BouncyCastle::Security {
class SecureRandom;
}
namespace System {
class Object;
}
// Forward declare root types
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
struct Ed448_Algorithm;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class Ed448;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class Ed448_PointExt;
}
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
class Ed448_PointPrecomp;
}
// Write type traits
MARK_VAL_T(::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_Algorithm);
MARK_REF_PTR_T(::Org::BouncyCastle::Math::EC::Rfc8032::Ed448);
MARK_REF_PTR_T(::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_PointExt);
MARK_REF_PTR_T(::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_PointPrecomp);
// Dependencies
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
// Is value type: true
// CS Name: Org.BouncyCastle.Math.EC.Rfc8032.Ed448/Algorithm
struct CORDL_TYPE Ed448_Algorithm {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct __Ed448_Algorithm_Unwrapped
  enum struct __Ed448_Algorithm_Unwrapped : int32_t {
    __E_Ed448 = static_cast<int32_t>(0x0),
    __E_Ed448ph = static_cast<int32_t>(0x1),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __Ed448_Algorithm_Unwrapped() const noexcept {
    return static_cast<__Ed448_Algorithm_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr Ed448_Algorithm();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr Ed448_Algorithm(int32_t value__) noexcept;

  /// @brief Field Ed448 value: I32(0)
  static ::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_Algorithm const Ed448;

  /// @brief Field Ed448ph value: I32(1)
  static ::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_Algorithm const Ed448ph;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 1561 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_Algorithm, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_Algorithm, 0x4>, "Size mismatch!");

} // namespace Org::BouncyCastle::Math::EC::Rfc8032
// Dependencies System.Object
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
// Is value type: false
// CS Name: Org.BouncyCastle.Math.EC.Rfc8032.Ed448/PointExt
class CORDL_TYPE Ed448_PointExt : public ::System::Object {
public:
  // Declarations
  /// @brief Field x, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_x, put = __cordl_internal_set_x)) ::ArrayW<uint32_t, ::Array<uint32_t>*> x;

  /// @brief Field y, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_y, put = __cordl_internal_set_y)) ::ArrayW<uint32_t, ::Array<uint32_t>*> y;

  /// @brief Field z, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_z, put = __cordl_internal_set_z)) ::ArrayW<uint32_t, ::Array<uint32_t>*> z;

  static inline ::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_PointExt* New_ctor();

  constexpr ::ArrayW<uint32_t, ::Array<uint32_t>*> const& __cordl_internal_get_x() const;

  constexpr ::ArrayW<uint32_t, ::Array<uint32_t>*>& __cordl_internal_get_x();

  constexpr ::ArrayW<uint32_t, ::Array<uint32_t>*> const& __cordl_internal_get_y() const;

  constexpr ::ArrayW<uint32_t, ::Array<uint32_t>*>& __cordl_internal_get_y();

  constexpr ::ArrayW<uint32_t, ::Array<uint32_t>*> const& __cordl_internal_get_z() const;

  constexpr ::ArrayW<uint32_t, ::Array<uint32_t>*>& __cordl_internal_get_z();

  constexpr void __cordl_internal_set_x(::ArrayW<uint32_t, ::Array<uint32_t>*> value);

  constexpr void __cordl_internal_set_y(::ArrayW<uint32_t, ::Array<uint32_t>*> value);

  constexpr void __cordl_internal_set_z(::ArrayW<uint32_t, ::Array<uint32_t>*> value);

  /// @brief Method .ctor, addr 0x24c9ccc, size 0x3c, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr Ed448_PointExt();

public:
  // Ctor Parameters [CppParam { name: "", ty: "Ed448_PointExt", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  Ed448_PointExt(Ed448_PointExt&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "Ed448_PointExt", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  Ed448_PointExt(Ed448_PointExt const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 1562 };

  /// @brief Field x, offset: 0x10, size: 0x8, def value: None
  ::ArrayW<uint32_t, ::Array<uint32_t>*> ___x;

  /// @brief Field y, offset: 0x18, size: 0x8, def value: None
  ::ArrayW<uint32_t, ::Array<uint32_t>*> ___y;

  /// @brief Field z, offset: 0x20, size: 0x8, def value: None
  ::ArrayW<uint32_t, ::Array<uint32_t>*> ___z;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_PointExt, ___x) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_PointExt, ___y) == 0x18, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_PointExt, ___z) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_PointExt, 0x28>, "Size mismatch!");

} // namespace Org::BouncyCastle::Math::EC::Rfc8032
// Dependencies System.Object
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
// Is value type: false
// CS Name: Org.BouncyCastle.Math.EC.Rfc8032.Ed448/PointPrecomp
class CORDL_TYPE Ed448_PointPrecomp : public ::System::Object {
public:
  // Declarations
  /// @brief Field x, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_x, put = __cordl_internal_set_x)) ::ArrayW<uint32_t, ::Array<uint32_t>*> x;

  /// @brief Field y, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_y, put = __cordl_internal_set_y)) ::ArrayW<uint32_t, ::Array<uint32_t>*> y;

  static inline ::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_PointPrecomp* New_ctor();

  constexpr ::ArrayW<uint32_t, ::Array<uint32_t>*> const& __cordl_internal_get_x() const;

  constexpr ::ArrayW<uint32_t, ::Array<uint32_t>*>& __cordl_internal_get_x();

  constexpr ::ArrayW<uint32_t, ::Array<uint32_t>*> const& __cordl_internal_get_y() const;

  constexpr ::ArrayW<uint32_t, ::Array<uint32_t>*>& __cordl_internal_get_y();

  constexpr void __cordl_internal_set_x(::ArrayW<uint32_t, ::Array<uint32_t>*> value);

  constexpr void __cordl_internal_set_y(::ArrayW<uint32_t, ::Array<uint32_t>*> value);

  /// @brief Method .ctor, addr 0x24caf84, size 0x30, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr Ed448_PointPrecomp();

public:
  // Ctor Parameters [CppParam { name: "", ty: "Ed448_PointPrecomp", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  Ed448_PointPrecomp(Ed448_PointPrecomp&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "Ed448_PointPrecomp", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  Ed448_PointPrecomp(Ed448_PointPrecomp const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 1563 };

  /// @brief Field x, offset: 0x10, size: 0x8, def value: None
  ::ArrayW<uint32_t, ::Array<uint32_t>*> ___x;

  /// @brief Field y, offset: 0x18, size: 0x8, def value: None
  ::ArrayW<uint32_t, ::Array<uint32_t>*> ___y;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_PointPrecomp, ___x) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_PointPrecomp, ___y) == 0x18, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_PointPrecomp, 0x20>, "Size mismatch!");

} // namespace Org::BouncyCastle::Math::EC::Rfc8032
// Dependencies System.Object
namespace Org::BouncyCastle::Math::EC::Rfc8032 {
// Is value type: false
// CS Name: Org.BouncyCastle.Math.EC.Rfc8032.Ed448
class CORDL_TYPE Ed448 : public ::System::Object {
public:
  // Declarations
  using Algorithm = ::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_Algorithm;

  using PointExt = ::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_PointExt;

  using PointPrecomp = ::Org::BouncyCastle::Math::EC::Rfc8032::Ed448_PointPrecomp;

  /// @brief Field B_x, offset 0xffffffff, size 0x8
  __declspec(property(get = getStaticF_B_x, put = setStaticF_B_x)) ::ArrayW<uint32_t, ::Array<uint32_t>*> B_x;

  /// @brief Field B_y, offset 0xffffffff, size 0x8
