#pragma once
// IWYU pragma private; include "UnityEngine/Rendering/RenderGraphModule/RenderGraph.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__MulticastDelegate_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "UnityEngine/Experimental/Rendering/zzzz__GraphicsFormat_def.hpp"
#include "UnityEngine/Rendering/RenderGraphModule/NativeRenderPassCompiler/zzzz__NativePassAttachment_def.hpp"
#include "UnityEngine/Rendering/RenderGraphModule/zzzz__RenderGraphPassType_def.hpp"
#include "UnityEngine/Rendering/zzzz__GraphicsFence_def.hpp"
#include "UnityEngine/zzzz__GraphicsBuffer_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(RenderGraph)
namespace GlobalNamespace {
class RenderGraphCompilationCache;
}
namespace System::Collections::Generic {
template <typename TKey, typename TValue> class Dictionary_2_ValueCollection;
}
namespace System::Collections::Generic {
template <typename TKey, typename TValue> class Dictionary_2;
}
namespace System::Collections::Generic {
template <typename T> class List_1;
}
namespace System::Collections::Generic {
template <typename T> class Stack_1;
}
namespace System {
class Action;
}
namespace System {
class AsyncCallback;
}
namespace System {
class IAsyncResult;
}
namespace System {
struct IntPtr;
}
namespace System {
class Object;
}

class RenderGraph_ICompiledGraph;
}
namespace UnityEngine::Rendering::RenderGraphModule {
class RenderGraph_OnExecutionRegisteredDelegate;
}
namespace UnityEngine::Rendering::RenderGraphModule {
class RenderGraph_OnGraphRegisteredDelegate;
}
namespace UnityEngine::Rendering::RenderGraphModule {
class RenderGraph_ProfilingScopePassData;
}
namespace UnityEngine::Rendering::RenderGraphModule {
class RenderGraph___c;
}
namespace UnityEngine::Rendering::RenderGraphModule {
struct DebugData_RenderGraph_PassData;
}
namespace UnityEngine::Rendering::RenderGraphModule {
struct DebugData_RenderGraph_ResourceData;
}
namespace UnityEngine::Rendering::RenderGraphModule {
struct NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_PassCompatibilityInfo;
}
namespace UnityEngine::Rendering::RenderGraphModule {
struct RenderGraph_CompiledPassInfo;
}
namespace UnityEngine::Rendering::RenderGraphModule {
struct RenderGraph_CompiledResourceInfo;
}
// Write type traits
MARK_REF_PTR_T(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_BufferResourceData);
MARK_REF_PTR_T(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassScriptInfo);
MARK_REF_PTR_T(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_TextureResourceData);
MARK_REF_PTR_T(::UnityEngine::Rendering::RenderGraphModule::NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo);
MARK_REF_PTR_T(::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo);
MARK_REF_PTR_T(::UnityEngine::Rendering::RenderGraphModule::PassData_DebugData_RenderGraph_NRPInfo);
MARK_REF_PTR_T(::UnityEngine::Rendering::RenderGraphModule::RenderGraph);
MARK_REF_PTR_T(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledGraph);
MARK_REF_PTR_T(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_DebugData);
MARK_REF_PTR_T(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_ICompiledGraph);
MARK_REF_PTR_T(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_OnExecutionRegisteredDelegate);
MARK_REF_PTR_T(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_OnGraphRegisteredDelegate);
MARK_REF_PTR_T(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_ProfilingScopePassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::RenderGraphModule::RenderGraph___c);
MARK_VAL_T(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassData);
MARK_VAL_T(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_ResourceData);
MARK_VAL_T(::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_PassCompatibilityInfo);
MARK_VAL_T(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo);
MARK_VAL_T(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo);
// Dependencies
namespace UnityEngine::Rendering::RenderGraphModule {
// Is value type: true
// CS Name: UnityEngine.Rendering.RenderGraphModule.RenderGraph/CompiledResourceInfo
struct CORDL_TYPE RenderGraph_CompiledResourceInfo {
public:
  // Declarations
  /// @brief Method Reset, addr 0x6623c50, size 0xe8, virtual false, abstract: false, final false
  inline void Reset();

  // Ctor Parameters []
  // @brief default ctor
  constexpr RenderGraph_CompiledResourceInfo();

  // Ctor Parameters [CppParam { name: "producers", ty: "::System::Collections::Generic::List_1<int32_t>*", modifiers: "", def_value: None }, CppParam { name: "consumers", ty:
  // "::System::Collections::Generic::List_1<int32_t>*", modifiers: "", def_value: None }, CppParam { name: "refCount", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "imported",
  // ty: "bool", modifiers: "", def_value: None }]
  constexpr RenderGraph_CompiledResourceInfo(::System::Collections::Generic::List_1<int32_t>* producers, ::System::Collections::Generic::List_1<int32_t>* consumers, int32_t refCount,
                                             bool imported) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12363 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x18 };

  /// @brief Field producers, offset: 0x0, size: 0x8, def value: None
  ::System::Collections::Generic::List_1<int32_t>* producers;

  /// @brief Field consumers, offset: 0x8, size: 0x8, def value: None
  ::System::Collections::Generic::List_1<int32_t>* consumers;

  /// @brief Field refCount, offset: 0x10, size: 0x4, def value: None
  int32_t refCount;

  /// @brief Field imported, offset: 0x14, size: 0x1, def value: None
  bool imported;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo, producers) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo, consumers) == 0x8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo, refCount) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo, imported) == 0x14, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo, 0x18>, "Size mismatch!");

} // namespace UnityEngine::Rendering::RenderGraphModule
// Dependencies UnityEngine.Rendering.GraphicsFence
namespace UnityEngine::Rendering::RenderGraphModule {
// Is value type: true
// CS Name: UnityEngine.Rendering.RenderGraphModule.RenderGraph/CompiledPassInfo
struct CORDL_TYPE RenderGraph_CompiledPassInfo {
public:
  // Declarations
  /// @brief Method Reset, addr 0x6623d38, size 0x214, virtual false, abstract: false, final false
  inline void Reset(::UnityEngine::Rendering::RenderGraphModule::RenderGraphPass* pass, int32_t index);

  // Ctor Parameters []
  // @brief default ctor
  constexpr RenderGraph_CompiledPassInfo();

  // Ctor Parameters [CppParam { name: "name", ty: "::StringW", modifiers: "", def_value: None }, CppParam { name: "index", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name:
  // "resourceCreateList", ty: "::ArrayW<::System::Collections::Generic::List_1<int32_t>*,::Array<::System::Collections::Generic::List_1<int32_t>*>*>", modifiers: "", def_value: None }, CppParam {
  // name: "resourceReleaseList", ty: "::ArrayW<::System::Collections::Generic::List_1<int32_t>*,::Array<::System::Collections::Generic::List_1<int32_t>*>*>", modifiers: "", def_value: None },
  // CppParam { name: "fence", ty: "::UnityEngine::Rendering::GraphicsFence", modifiers: "", def_value: None }, CppParam { name: "refCount", ty: "int32_t", modifiers: "", def_value: None }, CppParam {
  // name: "syncToPassIndex", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "syncFromPassIndex", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name:
  // "enableAsyncCompute", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "allowPassCulling", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "needGraphicsFence", ty:
  // "bool", modifiers: "", def_value: None }, CppParam { name: "culled", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "culledByRendererList", ty: "bool", modifiers: "", def_value:
  // None }, CppParam { name: "hasSideEffect", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "enableFoveatedRasterization", ty: "bool", modifiers: "", def_value: None }]
  constexpr RenderGraph_CompiledPassInfo(::StringW name, int32_t index,
                                         ::ArrayW<::System::Collections::Generic::List_1<int32_t>*, ::Array<::System::Collections::Generic::List_1<int32_t>*>*> resourceCreateList,
                                         ::ArrayW<::System::Collections::Generic::List_1<int32_t>*, ::Array<::System::Collections::Generic::List_1<int32_t>*>*> resourceReleaseList,
                                         ::UnityEngine::Rendering::GraphicsFence fence, int32_t refCount, int32_t syncToPassIndex, int32_t syncFromPassIndex, bool enableAsyncCompute,
                                         bool allowPassCulling, bool needGraphicsFence, bool culled, bool culledByRendererList, bool hasSideEffect, bool enableFoveatedRasterization) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12364 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x48 };

  /// @brief Field name, offset: 0x0, size: 0x8, def value: None
  ::StringW name;

  /// @brief Field index, offset: 0x8, size: 0x4, def value: None
  int32_t index;

  /// @brief Field resourceCreateList, offset: 0x10, size: 0x8, def value: None
  ::ArrayW<::System::Collections::Generic::List_1<int32_t>*, ::Array<::System::Collections::Generic::List_1<int32_t>*>*> resourceCreateList;

  /// @brief Field resourceReleaseList, offset: 0x18, size: 0x8, def value: None
  ::ArrayW<::System::Collections::Generic::List_1<int32_t>*, ::Array<::System::Collections::Generic::List_1<int32_t>*>*> resourceReleaseList;

  /// @brief Field fence, offset: 0x20, size: 0x10, def value: None
  ::UnityEngine::Rendering::GraphicsFence fence;

  /// @brief Field refCount, offset: 0x30, size: 0x4, def value: None
  int32_t refCount;

  /// @brief Field syncToPassIndex, offset: 0x34, size: 0x4, def value: None
  int32_t syncToPassIndex;

  /// @brief Field syncFromPassIndex, offset: 0x38, size: 0x4, def value: None
  int32_t syncFromPassIndex;

  /// @brief Field enableAsyncCompute, offset: 0x3c, size: 0x1, def value: None
  bool enableAsyncCompute;

  /// @brief Field allowPassCulling, offset: 0x3d, size: 0x1, def value: None
  bool allowPassCulling;

  /// @brief Field needGraphicsFence, offset: 0x3e, size: 0x1, def value: None
  bool needGraphicsFence;

  /// @brief Field culled, offset: 0x3f, size: 0x1, def value: None
  bool culled;

  /// @brief Field culledByRendererList, offset: 0x40, size: 0x1, def value: None
  bool culledByRendererList;

  /// @brief Field hasSideEffect, offset: 0x41, size: 0x1, def value: None
  bool hasSideEffect;

  /// @brief Field enableFoveatedRasterization, offset: 0x42, size: 0x1, def value: None
  bool enableFoveatedRasterization;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo, name) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo, index) == 0x8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo, resourceCreateList) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo, resourceReleaseList) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo, fence) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo, refCount) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo, syncToPassIndex) == 0x34, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo, syncFromPassIndex) == 0x38, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo, enableAsyncCompute) == 0x3c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo, allowPassCulling) == 0x3d, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo, needGraphicsFence) == 0x3e, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo, culled) == 0x3f, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo, culledByRendererList) == 0x40, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo, hasSideEffect) == 0x41, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo, enableFoveatedRasterization) == 0x42, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo, 0x48>, "Size mismatch!");

} // namespace UnityEngine::Rendering::RenderGraphModule
// Dependencies
namespace UnityEngine::Rendering::RenderGraphModule {
// Is value type: false
// CS Name: UnityEngine.Rendering.RenderGraphModule.RenderGraph/ICompiledGraph
class CORDL_TYPE RenderGraph_ICompiledGraph {
public:
  // Declarations
  /// @brief Method Clear, addr 0xffffffffffffffff, size 0xffffffffffffffff, virtual true, abstract: false, final false
  inline void Clear();

  // Ctor Parameters [CppParam { name: "", ty: "RenderGraph_ICompiledGraph", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  RenderGraph_ICompiledGraph(RenderGraph_ICompiledGraph const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12365 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
} // namespace UnityEngine::Rendering::RenderGraphModule
// Dependencies System.Object
namespace UnityEngine::Rendering::RenderGraphModule {
// Is value type: false
// CS Name: UnityEngine.Rendering.RenderGraphModule.RenderGraph/CompiledGraph
class CORDL_TYPE RenderGraph_CompiledGraph : public ::System::Object {
public:
  // Declarations
  /// @brief Field compiledPassInfos, offset 0x18, size 0x8
  __declspec(property(
      get = __cordl_internal_get_compiledPassInfos,
      put = __cordl_internal_set_compiledPassInfos)) ::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo>* compiledPassInfos;

  /// @brief Field compiledResourcesInfos, offset 0x10, size 0x8
  __declspec(property(
      get = __cordl_internal_get_compiledResourcesInfos,
      put = __cordl_internal_set_compiledResourcesInfos)) ::ArrayW<::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo>*,
                                                                   ::Array<::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo>*>*>
      compiledResourcesInfos;

  /// @brief Field lastExecutionFrame, offset 0x20, size 0x4
  __declspec(property(get = __cordl_internal_get_lastExecutionFrame, put = __cordl_internal_set_lastExecutionFrame)) int32_t lastExecutionFrame;

  /// @brief Convert operator to "::UnityEngine::Rendering::RenderGraphModule::RenderGraph_ICompiledGraph"
  constexpr operator ::UnityEngine::Rendering::RenderGraphModule::RenderGraph_ICompiledGraph*() noexcept;

  /// @brief Method Clear, addr 0x6624098, size 0xa0, virtual true, abstract: false, final true
  inline void Clear();

  /// @brief Method InitResourceInfosData, addr 0x6624138, size 0xd8, virtual false, abstract: false, final false
  inline void InitResourceInfosData(::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo>* resourceInfos, int32_t count);

  /// @brief Method InitializeCompilationData, addr 0x6624210, size 0x1d4, virtual false, abstract: false, final false
  inline void InitializeCompilationData(::System::Collections::Generic::List_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraphPass*>* passes,
                                        ::UnityEngine::Rendering::RenderGraphModule::RenderGraphResourceRegistry* resources);

  static inline ::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledGraph* New_ctor();

  constexpr ::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo>* const& __cordl_internal_get_compiledPassInfos() const;

  constexpr ::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo>*& __cordl_internal_get_compiledPassInfos();

  constexpr ::ArrayW<::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo>*,
                     ::Array<::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo>*>*> const&
  __cordl_internal_get_compiledResourcesInfos() const;

  constexpr ::ArrayW<::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo>*,
                     ::Array<::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo>*>*>&
  __cordl_internal_get_compiledResourcesInfos();

  constexpr int32_t const& __cordl_internal_get_lastExecutionFrame() const;

  constexpr int32_t& __cordl_internal_get_lastExecutionFrame();

  constexpr void __cordl_internal_set_compiledPassInfos(::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo>* value);

  constexpr void
  __cordl_internal_set_compiledResourcesInfos(::ArrayW<::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo>*,
                                                       ::Array<::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo>*>*>
                                                  value);

  constexpr void __cordl_internal_set_lastExecutionFrame(int32_t value);

  /// @brief Method .ctor, addr 0x6623f4c, size 0x14c, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Convert to "::UnityEngine::Rendering::RenderGraphModule::RenderGraph_ICompiledGraph"
  constexpr ::UnityEngine::Rendering::RenderGraphModule::RenderGraph_ICompiledGraph* i___UnityEngine__Rendering__RenderGraphModule__RenderGraph_ICompiledGraph() noexcept;

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr RenderGraph_CompiledGraph();

public:
  // Ctor Parameters [CppParam { name: "", ty: "RenderGraph_CompiledGraph", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  RenderGraph_CompiledGraph(RenderGraph_CompiledGraph&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "RenderGraph_CompiledGraph", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  RenderGraph_CompiledGraph(RenderGraph_CompiledGraph const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12366 };

  /// @brief Field compiledResourcesInfos, offset: 0x10, size: 0x8, def value: None
  ::ArrayW<::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo>*,
           ::Array<::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledResourceInfo>*>*>
      ___compiledResourcesInfos;

  /// @brief Field compiledPassInfos, offset: 0x18, size: 0x8, def value: None
  ::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledPassInfo>* ___compiledPassInfos;

  /// @brief Field lastExecutionFrame, offset: 0x20, size: 0x4, def value: None
  int32_t ___lastExecutionFrame;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledGraph, ___compiledResourcesInfos) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledGraph, ___compiledPassInfos) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledGraph, ___lastExecutionFrame) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_CompiledGraph, 0x28>, "Size mismatch!");

} // namespace UnityEngine::Rendering::RenderGraphModule
// Dependencies System.Object
namespace UnityEngine::Rendering::RenderGraphModule {
// Is value type: false
// CS Name: UnityEngine.Rendering.RenderGraphModule.RenderGraph/ProfilingScopePassData
class CORDL_TYPE RenderGraph_ProfilingScopePassData : public ::System::Object {
public:
  // Declarations
  /// @brief Field sampler, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_sampler, put = __cordl_internal_set_sampler)) ::UnityEngine::Rendering::ProfilingSampler* sampler;

  static inline ::UnityEngine::Rendering::RenderGraphModule::RenderGraph_ProfilingScopePassData* New_ctor();

  constexpr ::UnityEngine::Rendering::ProfilingSampler* const& __cordl_internal_get_sampler() const;

  constexpr ::UnityEngine::Rendering::ProfilingSampler*& __cordl_internal_get_sampler();

  constexpr void __cordl_internal_set_sampler(::UnityEngine::Rendering::ProfilingSampler* value);

  /// @brief Method .ctor, addr 0x66243fc, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr RenderGraph_ProfilingScopePassData();

public:
  // Ctor Parameters [CppParam { name: "", ty: "RenderGraph_ProfilingScopePassData", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  RenderGraph_ProfilingScopePassData(RenderGraph_ProfilingScopePassData&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "RenderGraph_ProfilingScopePassData", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  RenderGraph_ProfilingScopePassData(RenderGraph_ProfilingScopePassData const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12367 };

  /// @brief Field sampler, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::Rendering::ProfilingSampler* ___sampler;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::RenderGraph_ProfilingScopePassData, ___sampler) == 0x10, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_ProfilingScopePassData, 0x18>, "Size mismatch!");

} // namespace UnityEngine::Rendering::RenderGraphModule
// Dependencies System.MulticastDelegate
namespace UnityEngine::Rendering::RenderGraphModule {
// Is value type: false
// CS Name: UnityEngine.Rendering.RenderGraphModule.RenderGraph/OnGraphRegisteredDelegate
class CORDL_TYPE RenderGraph_OnGraphRegisteredDelegate : public ::System::MulticastDelegate {
public:
  // Declarations
  /// @brief Method BeginInvoke, addr 0x6624558, size 0x20, virtual true, abstract: false, final false
  inline ::System::IAsyncResult* BeginInvoke(::UnityEngine::Rendering::RenderGraphModule::RenderGraph* graph, ::System::AsyncCallback* callback, ::System::Object* object);

  /// @brief Method EndInvoke, addr 0x6624578, size 0xc, virtual true, abstract: false, final false
  inline void EndInvoke(::System::IAsyncResult* result);

  /// @brief Method Invoke, addr 0x6624544, size 0x14, virtual true, abstract: false, final false
  inline void Invoke(::UnityEngine::Rendering::RenderGraphModule::RenderGraph* graph);

  static inline ::UnityEngine::Rendering::RenderGraphModule::RenderGraph_OnGraphRegisteredDelegate* New_ctor(::System::Object* object, ::System::IntPtr method);

  /// @brief Method .ctor, addr 0x6624400, size 0x144, virtual false, abstract: false, final false
  inline void _ctor(::System::Object* object, ::System::IntPtr method);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr RenderGraph_OnGraphRegisteredDelegate();

public:
  // Ctor Parameters [CppParam { name: "", ty: "RenderGraph_OnGraphRegisteredDelegate", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  RenderGraph_OnGraphRegisteredDelegate(RenderGraph_OnGraphRegisteredDelegate&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "RenderGraph_OnGraphRegisteredDelegate", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  RenderGraph_OnGraphRegisteredDelegate(RenderGraph_OnGraphRegisteredDelegate const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12368 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_OnGraphRegisteredDelegate, 0x80>, "Size mismatch!");

} // namespace UnityEngine::Rendering::RenderGraphModule
// Dependencies System.MulticastDelegate
namespace UnityEngine::Rendering::RenderGraphModule {
// Is value type: false
// CS Name: UnityEngine.Rendering.RenderGraphModule.RenderGraph/OnExecutionRegisteredDelegate
class CORDL_TYPE RenderGraph_OnExecutionRegisteredDelegate : public ::System::MulticastDelegate {
public:
  // Declarations
  /// @brief Method BeginInvoke, addr 0x66246e0, size 0x28, virtual true, abstract: false, final false
  inline ::System::IAsyncResult* BeginInvoke(::UnityEngine::Rendering::RenderGraphModule::RenderGraph* graph, ::StringW executionName, ::System::AsyncCallback* callback, ::System::Object* object);

  /// @brief Method EndInvoke, addr 0x6624708, size 0xc, virtual true, abstract: false, final false
  inline void EndInvoke(::System::IAsyncResult* result);

  /// @brief Method Invoke, addr 0x66246cc, size 0x14, virtual true, abstract: false, final false
  inline void Invoke(::UnityEngine::Rendering::RenderGraphModule::RenderGraph* graph, ::StringW executionName);

  static inline ::UnityEngine::Rendering::RenderGraphModule::RenderGraph_OnExecutionRegisteredDelegate* New_ctor(::System::Object* object, ::System::IntPtr method);

  /// @brief Method .ctor, addr 0x6624584, size 0x148, virtual false, abstract: false, final false
  inline void _ctor(::System::Object* object, ::System::IntPtr method);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr RenderGraph_OnExecutionRegisteredDelegate();

public:
  // Ctor Parameters [CppParam { name: "", ty: "RenderGraph_OnExecutionRegisteredDelegate", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  RenderGraph_OnExecutionRegisteredDelegate(RenderGraph_OnExecutionRegisteredDelegate&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "RenderGraph_OnExecutionRegisteredDelegate", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  RenderGraph_OnExecutionRegisteredDelegate(RenderGraph_OnExecutionRegisteredDelegate const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12369 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::RenderGraphModule::RenderGraph_OnExecutionRegisteredDelegate, 0x80>, "Size mismatch!");

} // namespace UnityEngine::Rendering::RenderGraphModule
// Dependencies System.Object, UnityEngine.Rendering.RenderGraphModule.NativeRenderPassCompiler.NativePassAttachment
namespace UnityEngine::Rendering::RenderGraphModule {
// Is value type: false
// CS Name: UnityEngine.Rendering.RenderGraphModule.RenderGraph/DebugData/PassData/NRPInfo/NativeRenderPassInfo/AttachmentInfo
class CORDL_TYPE NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo : public ::System::Object {
public:
  // Declarations
  /// @brief Field attachment, offset 0x34, size 0x20
  __declspec(property(get = __cordl_internal_get_attachment,
                      put = __cordl_internal_set_attachment)) ::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassCompiler::NativePassAttachment attachment;

  /// @brief Field attachmentIndex, offset 0x30, size 0x4
  __declspec(property(get = __cordl_internal_get_attachmentIndex, put = __cordl_internal_set_attachmentIndex)) int32_t attachmentIndex;

  /// @brief Field loadReason, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_loadReason, put = __cordl_internal_set_loadReason)) ::StringW loadReason;

  /// @brief Field resourceName, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_resourceName, put = __cordl_internal_set_resourceName)) ::StringW resourceName;

  /// @brief Field storeMsaaReason, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_storeMsaaReason, put = __cordl_internal_set_storeMsaaReason)) ::StringW storeMsaaReason;

  /// @brief Field storeReason, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_storeReason, put = __cordl_internal_set_storeReason)) ::StringW storeReason;

  static inline ::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo* New_ctor();

  constexpr ::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassCompiler::NativePassAttachment const& __cordl_internal_get_attachment() const;

  constexpr ::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassCompiler::NativePassAttachment& __cordl_internal_get_attachment();

  constexpr int32_t const& __cordl_internal_get_attachmentIndex() const;

  constexpr int32_t& __cordl_internal_get_attachmentIndex();

  constexpr ::StringW const& __cordl_internal_get_loadReason() const;

  constexpr ::StringW& __cordl_internal_get_loadReason();

  constexpr ::StringW const& __cordl_internal_get_resourceName() const;

  constexpr ::StringW& __cordl_internal_get_resourceName();

  constexpr ::StringW const& __cordl_internal_get_storeMsaaReason() const;

  constexpr ::StringW& __cordl_internal_get_storeMsaaReason();

  constexpr ::StringW const& __cordl_internal_get_storeReason() const;

  constexpr ::StringW& __cordl_internal_get_storeReason();

  constexpr void __cordl_internal_set_attachment(::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassCompiler::NativePassAttachment value);

  constexpr void __cordl_internal_set_attachmentIndex(int32_t value);

  constexpr void __cordl_internal_set_loadReason(::StringW value);

  constexpr void __cordl_internal_set_resourceName(::StringW value);

  constexpr void __cordl_internal_set_storeMsaaReason(::StringW value);

  constexpr void __cordl_internal_set_storeReason(::StringW value);

  /// @brief Method .ctor, addr 0x6624aa0, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo();

public:
  // Ctor Parameters [CppParam { name: "", ty: "NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo(NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo(NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12370 };

  /// @brief Field resourceName, offset: 0x10, size: 0x8, def value: None
  ::StringW ___resourceName;

  /// @brief Field loadReason, offset: 0x18, size: 0x8, def value: None
  ::StringW ___loadReason;

  /// @brief Field storeReason, offset: 0x20, size: 0x8, def value: None
  ::StringW ___storeReason;

  /// @brief Field storeMsaaReason, offset: 0x28, size: 0x8, def value: None
  ::StringW ___storeMsaaReason;

  /// @brief Field attachmentIndex, offset: 0x30, size: 0x4, def value: None
  int32_t ___attachmentIndex;

  /// @brief Field attachment, offset: 0x34, size: 0x20, def value: None
  ::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassCompiler::NativePassAttachment ___attachment;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo, ___resourceName) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo, ___loadReason) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo, ___storeReason) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo, ___storeMsaaReason) == 0x28, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo, ___attachmentIndex) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo, ___attachment) == 0x34, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo, 0x58>, "Size mismatch!");

} // namespace UnityEngine::Rendering::RenderGraphModule
// Dependencies
namespace UnityEngine::Rendering::RenderGraphModule {
// Is value type: true
// CS Name: UnityEngine.Rendering.RenderGraphModule.RenderGraph/DebugData/PassData/NRPInfo/NativeRenderPassInfo/PassCompatibilityInfo
struct CORDL_TYPE NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_PassCompatibilityInfo {
public:
  // Declarations
  // Ctor Parameters []
  // @brief default ctor
  constexpr NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_PassCompatibilityInfo();

  // Ctor Parameters [CppParam { name: "message", ty: "::StringW", modifiers: "", def_value: None }, CppParam { name: "isCompatible", ty: "bool", modifiers: "", def_value: None }]
  constexpr NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_PassCompatibilityInfo(::StringW message, bool isCompatible) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12371 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x10 };

  /// @brief Field message, offset: 0x0, size: 0x8, def value: None
  ::StringW message;

  /// @brief Field isCompatible, offset: 0x8, size: 0x1, def value: None
  bool isCompatible;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_PassCompatibilityInfo, message) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_PassCompatibilityInfo, isCompatible) == 0x8, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_PassCompatibilityInfo, 0x10>, "Size mismatch!");

} // namespace UnityEngine::Rendering::RenderGraphModule
// Dependencies System.Object
namespace UnityEngine::Rendering::RenderGraphModule {
// Is value type: false
// CS Name: UnityEngine.Rendering.RenderGraphModule.RenderGraph/DebugData/PassData/NRPInfo/NativeRenderPassInfo
class CORDL_TYPE NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo : public ::System::Object {
public:
  // Declarations
  using AttachmentInfo = ::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo;

  using PassCompatibilityInfo = ::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_PassCompatibilityInfo;

  /// @brief Field attachmentInfos, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_attachmentInfos, put = __cordl_internal_set_attachmentInfos)) ::System::Collections::Generic::List_1<
      ::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo*>* attachmentInfos;

  /// @brief Field mergedPassIds, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_mergedPassIds, put = __cordl_internal_set_mergedPassIds)) ::System::Collections::Generic::List_1<int32_t>* mergedPassIds;

  /// @brief Field passBreakReasoning, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_passBreakReasoning, put = __cordl_internal_set_passBreakReasoning)) ::StringW passBreakReasoning;

  /// @brief Field passCompatibility, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_passCompatibility, put = __cordl_internal_set_passCompatibility)) ::System::Collections::Generic::Dictionary_2<
      int32_t, ::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_PassCompatibilityInfo>* passCompatibility;

  static inline ::UnityEngine::Rendering::RenderGraphModule::NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo* New_ctor();

  constexpr ::System::Collections::Generic::List_1<::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo*>* const&
  __cordl_internal_get_attachmentInfos() const;

  constexpr ::System::Collections::Generic::List_1<::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo*>*&
  __cordl_internal_get_attachmentInfos();

  constexpr ::System::Collections::Generic::List_1<int32_t>* const& __cordl_internal_get_mergedPassIds() const;

  constexpr ::System::Collections::Generic::List_1<int32_t>*& __cordl_internal_get_mergedPassIds();

  constexpr ::StringW const& __cordl_internal_get_passBreakReasoning() const;

  constexpr ::StringW& __cordl_internal_get_passBreakReasoning();

  constexpr ::System::Collections::Generic::Dictionary_2<int32_t,
                                                         ::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_PassCompatibilityInfo>* const&
  __cordl_internal_get_passCompatibility() const;

  constexpr ::System::Collections::Generic::Dictionary_2<int32_t, ::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_PassCompatibilityInfo>*&
  __cordl_internal_get_passCompatibility();

  constexpr void __cordl_internal_set_attachmentInfos(
      ::System::Collections::Generic::List_1<::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo*>* value);

  constexpr void __cordl_internal_set_mergedPassIds(::System::Collections::Generic::List_1<int32_t>* value);

  constexpr void __cordl_internal_set_passBreakReasoning(::StringW value);

  constexpr void __cordl_internal_set_passCompatibility(
      ::System::Collections::Generic::Dictionary_2<int32_t, ::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_PassCompatibilityInfo>* value);

  /// @brief Method .ctor, addr 0x6624a9c, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo();

public:
  // Ctor Parameters [CppParam { name: "", ty: "NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo(NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo(NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12372 };

  /// @brief Field passBreakReasoning, offset: 0x10, size: 0x8, def value: None
  ::StringW ___passBreakReasoning;

  /// @brief Field attachmentInfos, offset: 0x18, size: 0x8, def value: None
  ::System::Collections::Generic::List_1<::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_AttachmentInfo*>* ___attachmentInfos;

  /// @brief Field passCompatibility, offset: 0x20, size: 0x8, def value: None
  ::System::Collections::Generic::Dictionary_2<int32_t, ::UnityEngine::Rendering::RenderGraphModule::NativeRenderPassInfo_NRPInfo_PassData_DebugData_RenderGraph_PassCompatibilityInfo>*
      ___passCompatibility;

  /// @brief Field mergedPassIds, offset: 0x28, size: 0x8, def value: None
  ::System::Collections::Generic::List_1<int32_t>* ___mergedPassIds;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo, ___passBreakReasoning) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo, ___attachmentInfos) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo, ___passCompatibility) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo, ___mergedPassIds) == 0x28, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::RenderGraphModule::NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo, 0x30>, "Size mismatch!");

} // namespace UnityEngine::Rendering::RenderGraphModule
// Dependencies System.Object
namespace UnityEngine::Rendering::RenderGraphModule {
// Is value type: false
// CS Name: UnityEngine.Rendering.RenderGraphModule.RenderGraph/DebugData/PassData/NRPInfo
class CORDL_TYPE PassData_DebugData_RenderGraph_NRPInfo : public ::System::Object {
public:
  // Declarations
  using NativeRenderPassInfo = ::UnityEngine::Rendering::RenderGraphModule::NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo;

  /// @brief Field hasDepth, offset 0x38, size 0x1
  __declspec(property(get = __cordl_internal_get_hasDepth, put = __cordl_internal_set_hasDepth)) bool hasDepth;

  /// @brief Field height, offset 0x2c, size 0x4
  __declspec(property(get = __cordl_internal_get_height, put = __cordl_internal_set_height)) int32_t height;

  /// @brief Field nativePassInfo, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_nativePassInfo,
                      put = __cordl_internal_set_nativePassInfo)) ::UnityEngine::Rendering::RenderGraphModule::NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo* nativePassInfo;

  /// @brief Field samples, offset 0x34, size 0x4
  __declspec(property(get = __cordl_internal_get_samples, put = __cordl_internal_set_samples)) int32_t samples;

  /// @brief Field setGlobals, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_setGlobals, put = __cordl_internal_set_setGlobals)) ::System::Collections::Generic::List_1<int32_t>* setGlobals;

  /// @brief Field textureFBFetchList, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_textureFBFetchList, put = __cordl_internal_set_textureFBFetchList)) ::System::Collections::Generic::List_1<int32_t>* textureFBFetchList;

  /// @brief Field volumeDepth, offset 0x30, size 0x4
  __declspec(property(get = __cordl_internal_get_volumeDepth, put = __cordl_internal_set_volumeDepth)) int32_t volumeDepth;

  /// @brief Field width, offset 0x28, size 0x4
  __declspec(property(get = __cordl_internal_get_width, put = __cordl_internal_set_width)) int32_t width;

  static inline ::UnityEngine::Rendering::RenderGraphModule::PassData_DebugData_RenderGraph_NRPInfo* New_ctor();

  constexpr bool const& __cordl_internal_get_hasDepth() const;

  constexpr bool& __cordl_internal_get_hasDepth();

  constexpr int32_t const& __cordl_internal_get_height() const;

  constexpr int32_t& __cordl_internal_get_height();

  constexpr ::UnityEngine::Rendering::RenderGraphModule::NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo* const& __cordl_internal_get_nativePassInfo() const;

  constexpr ::UnityEngine::Rendering::RenderGraphModule::NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo*& __cordl_internal_get_nativePassInfo();

  constexpr int32_t const& __cordl_internal_get_samples() const;

  constexpr int32_t& __cordl_internal_get_samples();

  constexpr ::System::Collections::Generic::List_1<int32_t>* const& __cordl_internal_get_setGlobals() const;

  constexpr ::System::Collections::Generic::List_1<int32_t>*& __cordl_internal_get_setGlobals();

  constexpr ::System::Collections::Generic::List_1<int32_t>* const& __cordl_internal_get_textureFBFetchList() const;

  constexpr ::System::Collections::Generic::List_1<int32_t>*& __cordl_internal_get_textureFBFetchList();

  constexpr int32_t const& __cordl_internal_get_volumeDepth() const;

  constexpr int32_t& __cordl_internal_get_volumeDepth();

  constexpr int32_t const& __cordl_internal_get_width() const;

  constexpr int32_t& __cordl_internal_get_width();

  constexpr void __cordl_internal_set_hasDepth(bool value);

  constexpr void __cordl_internal_set_height(int32_t value);

  constexpr void __cordl_internal_set_nativePassInfo(::UnityEngine::Rendering::RenderGraphModule::NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo* value);

  constexpr void __cordl_internal_set_samples(int32_t value);

  constexpr void __cordl_internal_set_setGlobals(::System::Collections::Generic::List_1<int32_t>* value);

  constexpr void __cordl_internal_set_textureFBFetchList(::System::Collections::Generic::List_1<int32_t>* value);

  constexpr void __cordl_internal_set_volumeDepth(int32_t value);

  constexpr void __cordl_internal_set_width(int32_t value);

  /// @brief Method .ctor, addr 0x6624a08, size 0x94, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr PassData_DebugData_RenderGraph_NRPInfo();

public:
  // Ctor Parameters [CppParam { name: "", ty: "PassData_DebugData_RenderGraph_NRPInfo", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  PassData_DebugData_RenderGraph_NRPInfo(PassData_DebugData_RenderGraph_NRPInfo&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "PassData_DebugData_RenderGraph_NRPInfo", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  PassData_DebugData_RenderGraph_NRPInfo(PassData_DebugData_RenderGraph_NRPInfo const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12373 };

  /// @brief Field nativePassInfo, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::Rendering::RenderGraphModule::NRPInfo_PassData_DebugData_RenderGraph_NativeRenderPassInfo* ___nativePassInfo;

  /// @brief Field textureFBFetchList, offset: 0x18, size: 0x8, def value: None
  ::System::Collections::Generic::List_1<int32_t>* ___textureFBFetchList;

  /// @brief Field setGlobals, offset: 0x20, size: 0x8, def value: None
  ::System::Collections::Generic::List_1<int32_t>* ___setGlobals;

  /// @brief Field width, offset: 0x28, size: 0x4, def value: None
  int32_t ___width;

  /// @brief Field height, offset: 0x2c, size: 0x4, def value: None
  int32_t ___height;

  /// @brief Field volumeDepth, offset: 0x30, size: 0x4, def value: None
  int32_t ___volumeDepth;

  /// @brief Field samples, offset: 0x34, size: 0x4, def value: None
  int32_t ___samples;

  /// @brief Field hasDepth, offset: 0x38, size: 0x1, def value: None
  bool ___hasDepth;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::PassData_DebugData_RenderGraph_NRPInfo, ___nativePassInfo) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::PassData_DebugData_RenderGraph_NRPInfo, ___textureFBFetchList) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::PassData_DebugData_RenderGraph_NRPInfo, ___setGlobals) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::PassData_DebugData_RenderGraph_NRPInfo, ___width) == 0x28, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::PassData_DebugData_RenderGraph_NRPInfo, ___height) == 0x2c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::PassData_DebugData_RenderGraph_NRPInfo, ___volumeDepth) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::PassData_DebugData_RenderGraph_NRPInfo, ___samples) == 0x34, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::PassData_DebugData_RenderGraph_NRPInfo, ___hasDepth) == 0x38, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::RenderGraphModule::PassData_DebugData_RenderGraph_NRPInfo, 0x40>, "Size mismatch!");

} // namespace UnityEngine::Rendering::RenderGraphModule
// Dependencies UnityEngine.Rendering.RenderGraphModule.RenderGraphPassType
namespace UnityEngine::Rendering::RenderGraphModule {
// Is value type: true
// CS Name: UnityEngine.Rendering.RenderGraphModule.RenderGraph/DebugData/PassData
struct CORDL_TYPE DebugData_RenderGraph_PassData {
public:
  // Declarations
  using NRPInfo = ::UnityEngine::Rendering::RenderGraphModule::PassData_DebugData_RenderGraph_NRPInfo;

  // Ctor Parameters []
  // @brief default ctor
  constexpr DebugData_RenderGraph_PassData();

  // Ctor Parameters [CppParam { name: "name", ty: "::StringW", modifiers: "", def_value: None }, CppParam { name: "type", ty: "::UnityEngine::Rendering::RenderGraphModule::RenderGraphPassType",
  // modifiers: "", def_value: None }, CppParam { name: "resourceReadLists", ty:
  // "::ArrayW<::System::Collections::Generic::List_1<int32_t>*,::Array<::System::Collections::Generic::List_1<int32_t>*>*>", modifiers: "", def_value: None }, CppParam { name: "resourceWriteLists",
  // ty: "::ArrayW<::System::Collections::Generic::List_1<int32_t>*,::Array<::System::Collections::Generic::List_1<int32_t>*>*>", modifiers: "", def_value: None }, CppParam { name: "culled", ty:
  // "bool", modifiers: "", def_value: None }, CppParam { name: "async", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "nativeSubPassIndex", ty: "int32_t", modifiers: "", def_value:
  // None }, CppParam { name: "syncToPassIndex", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "syncFromPassIndex", ty: "int32_t", modifiers: "", def_value: None }, CppParam {
  // name: "generateDebugData", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "nrpInfo", ty: "::UnityEngine::Rendering::RenderGraphModule::PassData_DebugData_RenderGraph_NRPInfo*",
  // modifiers: "", def_value: None }, CppParam { name: "scriptInfo", ty: "::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassScriptInfo*", modifiers: "", def_value: None }]
  constexpr DebugData_RenderGraph_PassData(::StringW name, ::UnityEngine::Rendering::RenderGraphModule::RenderGraphPassType type,
                                           ::ArrayW<::System::Collections::Generic::List_1<int32_t>*, ::Array<::System::Collections::Generic::List_1<int32_t>*>*> resourceReadLists,
                                           ::ArrayW<::System::Collections::Generic::List_1<int32_t>*, ::Array<::System::Collections::Generic::List_1<int32_t>*>*> resourceWriteLists, bool culled,
                                           bool async, int32_t nativeSubPassIndex, int32_t syncToPassIndex, int32_t syncFromPassIndex, bool generateDebugData,
                                           ::UnityEngine::Rendering::RenderGraphModule::PassData_DebugData_RenderGraph_NRPInfo* nrpInfo,
                                           ::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassScriptInfo* scriptInfo) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12374 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x48 };

  /// @brief Field name, offset: 0x0, size: 0x8, def value: None
  ::StringW name;

  /// @brief Field type, offset: 0x8, size: 0x4, def value: None
  ::UnityEngine::Rendering::RenderGraphModule::RenderGraphPassType type;

  /// @brief Field resourceReadLists, offset: 0x10, size: 0x8, def value: None
  ::ArrayW<::System::Collections::Generic::List_1<int32_t>*, ::Array<::System::Collections::Generic::List_1<int32_t>*>*> resourceReadLists;

  /// @brief Field resourceWriteLists, offset: 0x18, size: 0x8, def value: None
  ::ArrayW<::System::Collections::Generic::List_1<int32_t>*, ::Array<::System::Collections::Generic::List_1<int32_t>*>*> resourceWriteLists;

  /// @brief Field culled, offset: 0x20, size: 0x1, def value: None
  bool culled;

  /// @brief Field async, offset: 0x21, size: 0x1, def value: None
  bool async;

  /// @brief Field nativeSubPassIndex, offset: 0x24, size: 0x4, def value: None
  int32_t nativeSubPassIndex;

  /// @brief Field syncToPassIndex, offset: 0x28, size: 0x4, def value: None
  int32_t syncToPassIndex;

  /// @brief Field syncFromPassIndex, offset: 0x2c, size: 0x4, def value: None
  int32_t syncFromPassIndex;

  /// @brief Field generateDebugData, offset: 0x30, size: 0x1, def value: None
  bool generateDebugData;

  /// @brief Field nrpInfo, offset: 0x38, size: 0x8, def value: None
  ::UnityEngine::Rendering::RenderGraphModule::PassData_DebugData_RenderGraph_NRPInfo* nrpInfo;

  /// @brief Field scriptInfo, offset: 0x40, size: 0x8, def value: None
  ::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassScriptInfo* scriptInfo;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassData, name) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassData, type) == 0x8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassData, resourceReadLists) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassData, resourceWriteLists) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassData, culled) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassData, async) == 0x21, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassData, nativeSubPassIndex) == 0x24, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassData, syncToPassIndex) == 0x28, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassData, syncFromPassIndex) == 0x2c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassData, generateDebugData) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassData, nrpInfo) == 0x38, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassData, scriptInfo) == 0x40, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::RenderGraphModule::DebugData_RenderGraph_PassData, 0x48>, "Size mismatch!");

} // namespace UnityEngine::Rendering::RenderGraphModule
// Dependencies System.Object, UnityEngine.GraphicsBuffer::Target, UnityEngine.GraphicsBuffer::UsageFlags
namespace UnityEngine::Rendering::RenderGraphModule {
// Is value type: false
// CS Name: UnityEngine.Rendering.RenderGraphModule.RenderGraph/DebugData/BufferResourceData
class CORDL_TYPE DebugData_RenderGraph_BufferResourceData : public ::System::Object {
public:
  // Declarations
  /// @brief Field count, offset 0x10, size 0x4
