#pragma once
// IWYU pragma private; include "UnityEngine/Rendering/LensFlareCommonSRP.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__Object_def.hpp"
#include "UnityEngine/zzzz__Vector2_def.hpp"
#include <cmath>
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(LensFlareCommonSRP)
namespace System::Collections::Generic {
template <typename T> class List_1;
}
namespace System {
template <typename T1, typename T2, typename T3, typename TResult> class Func_4;
}
namespace System {
class Object;
}
namespace UnityEngine::Experimental::Rendering {
struct GraphicsFormat;
}
namespace UnityEngine::Experimental::Rendering {
class XRPass;
}
namespace UnityEngine::Rendering {
class CommandBuffer;
}
namespace UnityEngine::Rendering {
class LensFlareCommonSRP_LensFlareCompInfo;
}
namespace UnityEngine::Rendering {
class LensFlareCommonSRP___c__DisplayClass50_0;
}
namespace UnityEngine::Rendering {
class LensFlareCommonSRP___c__DisplayClass51_0;
}
namespace UnityEngine::Rendering {
struct LensFlareCommonSRP___c__DisplayClass74_0;
}
namespace UnityEngine::Rendering {
class LensFlareComponentSRP;
}
namespace UnityEngine::Rendering {
class LensFlareDataElementSRP;
}
namespace UnityEngine::Rendering {
class LensFlareDataSRP;
}
namespace UnityEngine::Rendering {
class RTHandle;
}
namespace UnityEngine::Rendering {
struct RenderTargetIdentifier;
}
namespace UnityEngine::Rendering {
class UnsafeCommandBuffer;
}
namespace UnityEngine {
class AnimationCurve;
}
namespace UnityEngine {
class Camera;
}
namespace UnityEngine {
struct Color;
}
namespace UnityEngine {
class Light;
}
namespace UnityEngine {
class Material;
}
namespace UnityEngine {
struct Matrix4x4;
}
namespace UnityEngine {
struct Rect;
}
namespace UnityEngine {
class Texture;
}
namespace UnityEngine {
struct Vector2;
}
namespace UnityEngine {
struct Vector3;
}
namespace UnityEngine {
struct Vector4;
}
// Forward declare root types
namespace UnityEngine::Rendering {
class LensFlareCommonSRP;
}
namespace UnityEngine::Rendering {
class LensFlareCommonSRP_LensFlareCompInfo;
}
namespace UnityEngine::Rendering {
class LensFlareCommonSRP___c__DisplayClass50_0;
}
namespace UnityEngine::Rendering {
class LensFlareCommonSRP___c__DisplayClass51_0;
}
namespace UnityEngine::Rendering {
struct LensFlareCommonSRP___c__DisplayClass74_0;
}
// Write type traits
MARK_REF_PTR_T(::UnityEngine::Rendering::LensFlareCommonSRP);
MARK_REF_PTR_T(::UnityEngine::Rendering::LensFlareCommonSRP_LensFlareCompInfo);
MARK_REF_PTR_T(::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass50_0);
MARK_REF_PTR_T(::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass51_0);
MARK_VAL_T(::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass74_0);
// Dependencies System.Object
namespace UnityEngine::Rendering {
// Is value type: false
// CS Name: UnityEngine.Rendering.LensFlareCommonSRP/LensFlareCompInfo
class CORDL_TYPE LensFlareCommonSRP_LensFlareCompInfo : public ::System::Object {
public:
  // Declarations
  /// @brief Field comp, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_comp, put = __cordl_internal_set_comp)) ::UnityW<::UnityEngine::Rendering::LensFlareComponentSRP> comp;

  /// @brief Field index, offset 0x10, size 0x4
  __declspec(property(get = __cordl_internal_get_index, put = __cordl_internal_set_index)) int32_t index;

  static inline ::UnityEngine::Rendering::LensFlareCommonSRP_LensFlareCompInfo* New_ctor(int32_t idx, ::UnityEngine::Rendering::LensFlareComponentSRP* cmp);

  constexpr ::UnityW<::UnityEngine::Rendering::LensFlareComponentSRP> const& __cordl_internal_get_comp() const;

  constexpr ::UnityW<::UnityEngine::Rendering::LensFlareComponentSRP>& __cordl_internal_get_comp();

  constexpr int32_t const& __cordl_internal_get_index() const;

  constexpr int32_t& __cordl_internal_get_index();

  constexpr void __cordl_internal_set_comp(::UnityW<::UnityEngine::Rendering::LensFlareComponentSRP> value);

  constexpr void __cordl_internal_set_index(int32_t value);

  /// @brief Method .ctor, addr 0x65e32f4, size 0xc, virtual false, abstract: false, final false
  inline void _ctor(int32_t idx, ::UnityEngine::Rendering::LensFlareComponentSRP* cmp);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr LensFlareCommonSRP_LensFlareCompInfo();

public:
  // Ctor Parameters [CppParam { name: "", ty: "LensFlareCommonSRP_LensFlareCompInfo", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  LensFlareCommonSRP_LensFlareCompInfo(LensFlareCommonSRP_LensFlareCompInfo&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "LensFlareCommonSRP_LensFlareCompInfo", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  LensFlareCommonSRP_LensFlareCompInfo(LensFlareCommonSRP_LensFlareCompInfo const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12142 };

  /// @brief Field index, offset: 0x10, size: 0x4, def value: None
  int32_t ___index;

  /// @brief Field comp, offset: 0x18, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Rendering::LensFlareComponentSRP> ___comp;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::LensFlareCommonSRP_LensFlareCompInfo, ___index) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::LensFlareCommonSRP_LensFlareCompInfo, ___comp) == 0x18, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::LensFlareCommonSRP_LensFlareCompInfo, 0x20>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies System.Object
namespace UnityEngine::Rendering {
// Is value type: false
// CS Name: UnityEngine.Rendering.LensFlareCommonSRP/<>c__DisplayClass50_0
class CORDL_TYPE LensFlareCommonSRP___c__DisplayClass50_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field newData, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_newData, put = __cordl_internal_set_newData)) ::UnityW<::UnityEngine::Rendering::LensFlareComponentSRP> newData;

  static inline ::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass50_0* New_ctor();

  /// @brief Method <AddData>b__0, addr 0x65ea430, size 0x7c, virtual false, abstract: false, final false
  inline bool _AddData_b__0(::UnityEngine::Rendering::LensFlareCommonSRP_LensFlareCompInfo* x);

  constexpr ::UnityW<::UnityEngine::Rendering::LensFlareComponentSRP> const& __cordl_internal_get_newData() const;

  constexpr ::UnityW<::UnityEngine::Rendering::LensFlareComponentSRP>& __cordl_internal_get_newData();

  constexpr void __cordl_internal_set_newData(::UnityW<::UnityEngine::Rendering::LensFlareComponentSRP> value);

  /// @brief Method .ctor, addr 0x65e32f0, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr LensFlareCommonSRP___c__DisplayClass50_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "LensFlareCommonSRP___c__DisplayClass50_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  LensFlareCommonSRP___c__DisplayClass50_0(LensFlareCommonSRP___c__DisplayClass50_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "LensFlareCommonSRP___c__DisplayClass50_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  LensFlareCommonSRP___c__DisplayClass50_0(LensFlareCommonSRP___c__DisplayClass50_0 const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12143 };

  /// @brief Field newData, offset: 0x10, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Rendering::LensFlareComponentSRP> ___newData;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass50_0, ___newData) == 0x10, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass50_0, 0x18>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies System.Object
namespace UnityEngine::Rendering {
// Is value type: false
// CS Name: UnityEngine.Rendering.LensFlareCommonSRP/<>c__DisplayClass51_0
class CORDL_TYPE LensFlareCommonSRP___c__DisplayClass51_0 : public ::System::Object {
public:
  // Declarations
  /// @brief Field data, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_data, put = __cordl_internal_set_data)) ::UnityW<::UnityEngine::Rendering::LensFlareComponentSRP> data;

  static inline ::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass51_0* New_ctor();

  /// @brief Method <RemoveData>b__0, addr 0x65ea4ac, size 0x7c, virtual false, abstract: false, final false
  inline bool _RemoveData_b__0(::UnityEngine::Rendering::LensFlareCommonSRP_LensFlareCompInfo* x);

  constexpr ::UnityW<::UnityEngine::Rendering::LensFlareComponentSRP> const& __cordl_internal_get_data() const;

  constexpr ::UnityW<::UnityEngine::Rendering::LensFlareComponentSRP>& __cordl_internal_get_data();

  constexpr void __cordl_internal_set_data(::UnityW<::UnityEngine::Rendering::LensFlareComponentSRP> value);

  /// @brief Method .ctor, addr 0x65e3544, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr LensFlareCommonSRP___c__DisplayClass51_0();

public:
  // Ctor Parameters [CppParam { name: "", ty: "LensFlareCommonSRP___c__DisplayClass51_0", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  LensFlareCommonSRP___c__DisplayClass51_0(LensFlareCommonSRP___c__DisplayClass51_0&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "LensFlareCommonSRP___c__DisplayClass51_0", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  LensFlareCommonSRP___c__DisplayClass51_0(LensFlareCommonSRP___c__DisplayClass51_0 const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12144 };

  /// @brief Field data, offset: 0x10, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Rendering::LensFlareComponentSRP> ___data;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass51_0, ___data) == 0x10, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass51_0, 0x18>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies UnityEngine.Vector2
namespace UnityEngine::Rendering {
// Is value type: true
// CS Name: UnityEngine.Rendering.LensFlareCommonSRP/<>c__DisplayClass74_0
struct CORDL_TYPE LensFlareCommonSRP___c__DisplayClass74_0 {
public:
  // Declarations
  // Ctor Parameters []
  // @brief default ctor
  constexpr LensFlareCommonSRP___c__DisplayClass74_0();

  // Ctor Parameters [CppParam { name: "screenPos", ty: "::UnityEngine::Vector2", modifiers: "", def_value: None }, CppParam { name: "position", ty: "float_t", modifiers: "", def_value: None },
  // CppParam { name: "globalCos0", ty: "float_t", modifiers: "", def_value: None }, CppParam { name: "globalSin0", ty: "float_t", modifiers: "", def_value: None }, CppParam { name: "vScreenRatio",
  // ty: "::UnityEngine::Vector2", modifiers: "", def_value: None }, CppParam { name: "element", ty: "::UnityEngine::Rendering::LensFlareDataElementSRP*", modifiers: "", def_value: None }, CppParam {
  // name: "combinedScale", ty: "float_t", modifiers: "", def_value: None }, CppParam { name: "usedAspectRatio", ty: "float_t", modifiers: "", def_value: None }]
  constexpr LensFlareCommonSRP___c__DisplayClass74_0(::UnityEngine::Vector2 screenPos, float_t position, float_t globalCos0, float_t globalSin0, ::UnityEngine::Vector2 vScreenRatio,
                                                     ::UnityEngine::Rendering::LensFlareDataElementSRP* element, float_t combinedScale, float_t usedAspectRatio) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12145 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x30 };

  /// @brief Field screenPos, offset: 0x0, size: 0x8, def value: None
  ::UnityEngine::Vector2 screenPos;

  /// @brief Field position, offset: 0x8, size: 0x4, def value: None
  float_t position;

  /// @brief Field globalCos0, offset: 0xc, size: 0x4, def value: None
  float_t globalCos0;

  /// @brief Field globalSin0, offset: 0x10, size: 0x4, def value: None
  float_t globalSin0;

  /// @brief Field vScreenRatio, offset: 0x14, size: 0x8, def value: None
  ::UnityEngine::Vector2 vScreenRatio;

  /// @brief Field element, offset: 0x20, size: 0x8, def value: None
  ::UnityEngine::Rendering::LensFlareDataElementSRP* element;

  /// @brief Field combinedScale, offset: 0x28, size: 0x4, def value: None
  float_t combinedScale;

  /// @brief Field usedAspectRatio, offset: 0x2c, size: 0x4, def value: None
  float_t usedAspectRatio;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass74_0, screenPos) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass74_0, position) == 0x8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass74_0, globalCos0) == 0xc, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass74_0, globalSin0) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass74_0, vScreenRatio) == 0x14, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass74_0, element) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass74_0, combinedScale) == 0x28, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass74_0, usedAspectRatio) == 0x2c, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass74_0, 0x30>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies System.Object
namespace UnityEngine::Rendering {
// Is value type: false
// CS Name: UnityEngine.Rendering.LensFlareCommonSRP
class CORDL_TYPE LensFlareCommonSRP : public ::System::Object {
public:
  // Declarations
  using LensFlareCompInfo = ::UnityEngine::Rendering::LensFlareCommonSRP_LensFlareCompInfo;

  using __c__DisplayClass50_0 = ::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass50_0;

  using __c__DisplayClass51_0 = ::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass51_0;

  using __c__DisplayClass74_0 = ::UnityEngine::Rendering::LensFlareCommonSRP___c__DisplayClass74_0;

