#pragma once
// IWYU pragma private; include "UnityEngine/Rendering/InstanceDataSystem.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__Object_def.hpp"
#include "Unity/Collections/LowLevel/Unsafe/zzzz__UnsafeAtomicCounter32_def.hpp"
#include "Unity/Collections/zzzz__NativeArray_1_def.hpp"
#include "Unity/Collections/zzzz__NativeList_1_def.hpp"
#include "Unity/Collections/zzzz__NativeParallelHashMap_2_def.hpp"
#include "Unity/Collections/zzzz__NativeParallelMultiHashMap_2_def.hpp"
#include "Unity/Mathematics/zzzz__float4_def.hpp"
#include "UnityEngine/Rendering/zzzz__CPUInstanceData_def.hpp"
#include "UnityEngine/Rendering/zzzz__CPUSharedInstanceData_def.hpp"
#include "UnityEngine/Rendering/zzzz__GPUDrivenPackedRendererData_def.hpp"
#include "UnityEngine/Rendering/zzzz__GPUDrivenRendererGroupData_def.hpp"
#include "UnityEngine/Rendering/zzzz__GPUInstanceIndex_def.hpp"
#include "UnityEngine/Rendering/zzzz__InstanceAllocators_def.hpp"
#include "UnityEngine/Rendering/zzzz__InstanceHandle_def.hpp"
#include "UnityEngine/Rendering/zzzz__ParallelBitArray_def.hpp"
#include "UnityEngine/Rendering/zzzz__SphericalHarmonicsL2_def.hpp"
#include "UnityEngine/Rendering/zzzz__TransformUpdatePacket_def.hpp"
#include "UnityEngine/zzzz__LightProbesQuery_def.hpp"
#include "UnityEngine/zzzz__Matrix4x4_def.hpp"
#include "UnityEngine/zzzz__Vector3_def.hpp"
#include "UnityEngine/zzzz__Vector4_def.hpp"

struct InstanceDataSystem_GetVisibleNonProcessedTreeInstancesJob;
}
namespace UnityEngine::Rendering {
struct InstanceDataSystem_MotionUpdateJob;
}
namespace UnityEngine::Rendering {
struct InstanceDataSystem_ProbesUpdateJob;
}
namespace UnityEngine::Rendering {
struct InstanceDataSystem_QueryRendererGroupInstancesCountJob;
}
namespace UnityEngine::Rendering {
struct InstanceDataSystem_QueryRendererGroupInstancesJob;
}
namespace UnityEngine::Rendering {
struct InstanceDataSystem_QueryRendererGroupInstancesMultiJob;
}
namespace UnityEngine::Rendering {
struct InstanceDataSystem_QuerySortedMeshInstancesJob;
}
namespace UnityEngine::Rendering {
struct InstanceDataSystem_ReallocateInstancesJob;
}
namespace UnityEngine::Rendering {
struct InstanceDataSystem_ScatterTetrahedronCacheIndicesJob;
}
namespace UnityEngine::Rendering {
struct InstanceDataSystem_TransformUpdateJob;
}
namespace UnityEngine::Rendering {
struct InstanceDataSystem_UpdateCompactedInstanceVisibilityJob;
}
namespace UnityEngine::Rendering {
struct InstanceDataSystem_UpdateRendererInstancesJob;
}
// Write type traits
MARK_REF_PTR_T(::UnityEngine::Rendering::InstanceDataSystem);
MARK_REF_PTR_T(::UnityEngine::Rendering::InstanceDataSystem_InstanceTransformUpdateIDs);
MARK_REF_PTR_T(::UnityEngine::Rendering::InstanceDataSystem_InstanceWindDataUpdateIDs);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_CalculateInterpolatedLightAndOcclusionProbesBatchJob);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_CollectInstancesLODGroupsAndMasksJob);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_ComputeInstancesOffsetAndResizeInstancesArrayJob);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_FreeInstancesJob);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_FreeRendererGroupInstancesJob);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_GetVisibleNonProcessedTreeInstancesJob);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_MotionUpdateJob);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_ProbesUpdateJob);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesCountJob);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesJob);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesMultiJob);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_QuerySortedMeshInstancesJob);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_ReallocateInstancesJob);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_ScatterTetrahedronCacheIndicesJob);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_TransformUpdateJob);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_UpdateCompactedInstanceVisibilityJob);
MARK_VAL_T(::UnityEngine::Rendering::InstanceDataSystem_UpdateRendererInstancesJob);
// Dependencies System.Object
namespace UnityEngine::Rendering {
// Is value type: false
// CS Name: UnityEngine.Rendering.InstanceDataSystem/InstanceTransformUpdateIDs
class CORDL_TYPE InstanceDataSystem_InstanceTransformUpdateIDs : public ::System::Object {
public:
  // Declarations
  /// @brief Field _BoundingSphereDataQueue, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__BoundingSphereDataQueue, put = setStaticF__BoundingSphereDataQueue)) int32_t _BoundingSphereDataQueue;

  /// @brief Field _BoundingSphereOutputVec4Offset, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__BoundingSphereOutputVec4Offset, put = setStaticF__BoundingSphereOutputVec4Offset)) int32_t _BoundingSphereOutputVec4Offset;

  /// @brief Field _OutputProbeBuffer, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__OutputProbeBuffer, put = setStaticF__OutputProbeBuffer)) int32_t _OutputProbeBuffer;

  /// @brief Field _OutputTransformBuffer, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__OutputTransformBuffer, put = setStaticF__OutputTransformBuffer)) int32_t _OutputTransformBuffer;

  /// @brief Field _ProbeOcclusionUpdateDataQueue, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__ProbeOcclusionUpdateDataQueue, put = setStaticF__ProbeOcclusionUpdateDataQueue)) int32_t _ProbeOcclusionUpdateDataQueue;

  /// @brief Field _ProbeUpdateDataQueue, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__ProbeUpdateDataQueue, put = setStaticF__ProbeUpdateDataQueue)) int32_t _ProbeUpdateDataQueue;

  /// @brief Field _ProbeUpdateIndexQueue, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__ProbeUpdateIndexQueue, put = setStaticF__ProbeUpdateIndexQueue)) int32_t _ProbeUpdateIndexQueue;

  /// @brief Field _ProbeUpdateQueueCount, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__ProbeUpdateQueueCount, put = setStaticF__ProbeUpdateQueueCount)) int32_t _ProbeUpdateQueueCount;

  /// @brief Field _SHUpdateVec4Offset, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__SHUpdateVec4Offset, put = setStaticF__SHUpdateVec4Offset)) int32_t _SHUpdateVec4Offset;

  /// @brief Field _TransformUpdateDataQueue, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__TransformUpdateDataQueue, put = setStaticF__TransformUpdateDataQueue)) int32_t _TransformUpdateDataQueue;

  /// @brief Field _TransformUpdateIndexQueue, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__TransformUpdateIndexQueue, put = setStaticF__TransformUpdateIndexQueue)) int32_t _TransformUpdateIndexQueue;

  /// @brief Field _TransformUpdateOutputL2WVec4Offset, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__TransformUpdateOutputL2WVec4Offset, put = setStaticF__TransformUpdateOutputL2WVec4Offset)) int32_t _TransformUpdateOutputL2WVec4Offset;

  /// @brief Field _TransformUpdateOutputPrevL2WVec4Offset, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__TransformUpdateOutputPrevL2WVec4Offset, put = setStaticF__TransformUpdateOutputPrevL2WVec4Offset)) int32_t _TransformUpdateOutputPrevL2WVec4Offset;

  /// @brief Field _TransformUpdateOutputPrevW2LVec4Offset, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__TransformUpdateOutputPrevW2LVec4Offset, put = setStaticF__TransformUpdateOutputPrevW2LVec4Offset)) int32_t _TransformUpdateOutputPrevW2LVec4Offset;

  /// @brief Field _TransformUpdateOutputW2LVec4Offset, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__TransformUpdateOutputW2LVec4Offset, put = setStaticF__TransformUpdateOutputW2LVec4Offset)) int32_t _TransformUpdateOutputW2LVec4Offset;

  /// @brief Field _TransformUpdateQueueCount, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__TransformUpdateQueueCount, put = setStaticF__TransformUpdateQueueCount)) int32_t _TransformUpdateQueueCount;

  static inline int32_t getStaticF__BoundingSphereDataQueue();

  static inline int32_t getStaticF__BoundingSphereOutputVec4Offset();

  static inline int32_t getStaticF__OutputProbeBuffer();

  static inline int32_t getStaticF__OutputTransformBuffer();

  static inline int32_t getStaticF__ProbeOcclusionUpdateDataQueue();

  static inline int32_t getStaticF__ProbeUpdateDataQueue();

  static inline int32_t getStaticF__ProbeUpdateIndexQueue();

  static inline int32_t getStaticF__ProbeUpdateQueueCount();

  static inline int32_t getStaticF__SHUpdateVec4Offset();

  static inline int32_t getStaticF__TransformUpdateDataQueue();

  static inline int32_t getStaticF__TransformUpdateIndexQueue();

  static inline int32_t getStaticF__TransformUpdateOutputL2WVec4Offset();

  static inline int32_t getStaticF__TransformUpdateOutputPrevL2WVec4Offset();

  static inline int32_t getStaticF__TransformUpdateOutputPrevW2LVec4Offset();

  static inline int32_t getStaticF__TransformUpdateOutputW2LVec4Offset();

  static inline int32_t getStaticF__TransformUpdateQueueCount();

  static inline void setStaticF__BoundingSphereDataQueue(int32_t value);

  static inline void setStaticF__BoundingSphereOutputVec4Offset(int32_t value);

  static inline void setStaticF__OutputProbeBuffer(int32_t value);

  static inline void setStaticF__OutputTransformBuffer(int32_t value);

  static inline void setStaticF__ProbeOcclusionUpdateDataQueue(int32_t value);

  static inline void setStaticF__ProbeUpdateDataQueue(int32_t value);

  static inline void setStaticF__ProbeUpdateIndexQueue(int32_t value);

  static inline void setStaticF__ProbeUpdateQueueCount(int32_t value);

  static inline void setStaticF__SHUpdateVec4Offset(int32_t value);

  static inline void setStaticF__TransformUpdateDataQueue(int32_t value);

  static inline void setStaticF__TransformUpdateIndexQueue(int32_t value);

  static inline void setStaticF__TransformUpdateOutputL2WVec4Offset(int32_t value);

  static inline void setStaticF__TransformUpdateOutputPrevL2WVec4Offset(int32_t value);

  static inline void setStaticF__TransformUpdateOutputPrevW2LVec4Offset(int32_t value);

  static inline void setStaticF__TransformUpdateOutputW2LVec4Offset(int32_t value);

  static inline void setStaticF__TransformUpdateQueueCount(int32_t value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr InstanceDataSystem_InstanceTransformUpdateIDs();

public:
  // Ctor Parameters [CppParam { name: "", ty: "InstanceDataSystem_InstanceTransformUpdateIDs", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  InstanceDataSystem_InstanceTransformUpdateIDs(InstanceDataSystem_InstanceTransformUpdateIDs&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "InstanceDataSystem_InstanceTransformUpdateIDs", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  InstanceDataSystem_InstanceTransformUpdateIDs(InstanceDataSystem_InstanceTransformUpdateIDs const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17674 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::InstanceDataSystem_InstanceTransformUpdateIDs, 0x10>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies System.Object
namespace UnityEngine::Rendering {
// Is value type: false
// CS Name: UnityEngine.Rendering.InstanceDataSystem/InstanceWindDataUpdateIDs
class CORDL_TYPE InstanceDataSystem_InstanceWindDataUpdateIDs : public ::System::Object {
public:
  // Declarations
  /// @brief Field _WindDataBuffer, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__WindDataBuffer, put = setStaticF__WindDataBuffer)) int32_t _WindDataBuffer;

  /// @brief Field _WindDataQueueCount, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__WindDataQueueCount, put = setStaticF__WindDataQueueCount)) int32_t _WindDataQueueCount;

  /// @brief Field _WindDataUpdateIndexQueue, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__WindDataUpdateIndexQueue, put = setStaticF__WindDataUpdateIndexQueue)) int32_t _WindDataUpdateIndexQueue;

  /// @brief Field _WindHistoryParamAddressArray, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__WindHistoryParamAddressArray, put = setStaticF__WindHistoryParamAddressArray)) int32_t _WindHistoryParamAddressArray;

  /// @brief Field _WindParamAddressArray, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__WindParamAddressArray, put = setStaticF__WindParamAddressArray)) int32_t _WindParamAddressArray;

  static inline int32_t getStaticF__WindDataBuffer();

  static inline int32_t getStaticF__WindDataQueueCount();

  static inline int32_t getStaticF__WindDataUpdateIndexQueue();

  static inline int32_t getStaticF__WindHistoryParamAddressArray();

  static inline int32_t getStaticF__WindParamAddressArray();

  static inline void setStaticF__WindDataBuffer(int32_t value);

  static inline void setStaticF__WindDataQueueCount(int32_t value);

  static inline void setStaticF__WindDataUpdateIndexQueue(int32_t value);

  static inline void setStaticF__WindHistoryParamAddressArray(int32_t value);

  static inline void setStaticF__WindParamAddressArray(int32_t value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr InstanceDataSystem_InstanceWindDataUpdateIDs();

public:
  // Ctor Parameters [CppParam { name: "", ty: "InstanceDataSystem_InstanceWindDataUpdateIDs", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  InstanceDataSystem_InstanceWindDataUpdateIDs(InstanceDataSystem_InstanceWindDataUpdateIDs&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "InstanceDataSystem_InstanceWindDataUpdateIDs", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  InstanceDataSystem_InstanceWindDataUpdateIDs(InstanceDataSystem_InstanceWindDataUpdateIDs const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17675 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::InstanceDataSystem_InstanceWindDataUpdateIDs, 0x10>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies Unity.Collections.NativeArray`1<T>, Unity.Collections.NativeParallelMultiHashMap`2<TKey, TValue>, UnityEngine.Rendering.CPUInstanceData, UnityEngine.Rendering.CPUSharedInstanceData,
// UnityEngine.Rendering.InstanceHandle
namespace UnityEngine::Rendering {
// Is value type: true
// CS Name: UnityEngine.Rendering.InstanceDataSystem/QueryRendererGroupInstancesCountJob
struct CORDL_TYPE InstanceDataSystem_QueryRendererGroupInstancesCountJob {
public:
  // Declarations
  /// @brief Convert operator to "::Unity::Jobs::IJobParallelForBatch"
  constexpr operator ::Unity::Jobs::IJobParallelForBatch*();

  /// @brief Method Execute, addr 0x6674398, size 0xd0, virtual true, abstract: false, final true
  inline void Execute(int32_t startIndex, int32_t count);

  /// @brief Convert to "::Unity::Jobs::IJobParallelForBatch"
  constexpr ::Unity::Jobs::IJobParallelForBatch* i___Unity__Jobs__IJobParallelForBatch();

  // Ctor Parameters []
  // @brief default ctor
  constexpr InstanceDataSystem_QueryRendererGroupInstancesCountJob();

  // Ctor Parameters [CppParam { name: "instanceData", ty: "::UnityEngine::Rendering::CPUInstanceData", modifiers: "", def_value: None }, CppParam { name: "sharedInstanceData", ty:
  // "::UnityEngine::Rendering::CPUSharedInstanceData", modifiers: "", def_value: None }, CppParam { name: "rendererGroupInstanceMultiHash", ty:
  // "::Unity::Collections::NativeParallelMultiHashMap_2<int32_t,::UnityEngine::Rendering::InstanceHandle>", modifiers: "", def_value: None }, CppParam { name: "rendererGroupIDs", ty:
  // "::Unity::Collections::NativeArray_1<int32_t>", modifiers: "", def_value: None }, CppParam { name: "instancesCount", ty: "::Unity::Collections::NativeArray_1<int32_t>", modifiers: "", def_value:
  // None }]
  constexpr InstanceDataSystem_QueryRendererGroupInstancesCountJob(::UnityEngine::Rendering::CPUInstanceData instanceData, ::UnityEngine::Rendering::CPUSharedInstanceData sharedInstanceData,
                                                                   ::Unity::Collections::NativeParallelMultiHashMap_2<int32_t, ::UnityEngine::Rendering::InstanceHandle> rendererGroupInstanceMultiHash,
                                                                   ::Unity::Collections::NativeArray_1<int32_t> rendererGroupIDs, ::Unity::Collections::NativeArray_1<int32_t> instancesCount) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17676 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x1b8 };

  /// @brief Field k_BatchSize offset 0xffffffff size 0x4
  static constexpr int32_t k_BatchSize{ static_cast<int32_t>(0x80) };

  /// @brief Field instanceData, offset: 0x0, size: 0xe0, def value: None
  ::UnityEngine::Rendering::CPUInstanceData instanceData;

  /// @brief Field sharedInstanceData, offset: 0xe0, size: 0xa8, def value: None
  ::UnityEngine::Rendering::CPUSharedInstanceData sharedInstanceData;

  /// @brief Field rendererGroupInstanceMultiHash, offset: 0x188, size: 0x10, def value: None
  ::Unity::Collections::NativeParallelMultiHashMap_2<int32_t, ::UnityEngine::Rendering::InstanceHandle> rendererGroupInstanceMultiHash;

  /// @brief Field rendererGroupIDs, offset: 0x198, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<int32_t> rendererGroupIDs;

  /// @brief Field instancesCount, offset: 0x1a8, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<int32_t> instancesCount;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesCountJob, instanceData) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesCountJob, sharedInstanceData) == 0xe0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesCountJob, rendererGroupInstanceMultiHash) == 0x188, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesCountJob, rendererGroupIDs) == 0x198, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesCountJob, instancesCount) == 0x1a8, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesCountJob, 0x1b8>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies Unity.Collections.NativeArray`1<T>, Unity.Collections.NativeList`1<T>, UnityEngine.Rendering.InstanceHandle
namespace UnityEngine::Rendering {
// Is value type: true
// CS Name: UnityEngine.Rendering.InstanceDataSystem/ComputeInstancesOffsetAndResizeInstancesArrayJob
struct CORDL_TYPE InstanceDataSystem_ComputeInstancesOffsetAndResizeInstancesArrayJob {
public:
  // Declarations
  /// @brief Convert operator to "::Unity::Jobs::IJob"
  constexpr operator ::Unity::Jobs::IJob*();

  /// @brief Method Execute, addr 0x6674468, size 0x8c, virtual true, abstract: false, final true
  inline void Execute();

  /// @brief Convert to "::Unity::Jobs::IJob"
  constexpr ::Unity::Jobs::IJob* i___Unity__Jobs__IJob();

  // Ctor Parameters []
  // @brief default ctor
  constexpr InstanceDataSystem_ComputeInstancesOffsetAndResizeInstancesArrayJob();

  // Ctor Parameters [CppParam { name: "instancesCount", ty: "::Unity::Collections::NativeArray_1<int32_t>", modifiers: "", def_value: None }, CppParam { name: "instancesOffset", ty:
  // "::Unity::Collections::NativeArray_1<int32_t>", modifiers: "", def_value: None }, CppParam { name: "instances", ty: "::Unity::Collections::NativeList_1<::UnityEngine::Rendering::InstanceHandle>",
  // modifiers: "", def_value: None }]
  constexpr InstanceDataSystem_ComputeInstancesOffsetAndResizeInstancesArrayJob(::Unity::Collections::NativeArray_1<int32_t> instancesCount,
                                                                                ::Unity::Collections::NativeArray_1<int32_t> instancesOffset,
                                                                                ::Unity::Collections::NativeList_1<::UnityEngine::Rendering::InstanceHandle> instances) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17677 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x28 };

  /// @brief Field instancesCount, offset: 0x0, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<int32_t> instancesCount;

  /// @brief Field instancesOffset, offset: 0x10, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<int32_t> instancesOffset;

  /// @brief Field instances, offset: 0x20, size: 0x8, def value: None
  ::Unity::Collections::NativeList_1<::UnityEngine::Rendering::InstanceHandle> instances;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_ComputeInstancesOffsetAndResizeInstancesArrayJob, instancesCount) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_ComputeInstancesOffsetAndResizeInstancesArrayJob, instancesOffset) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_ComputeInstancesOffsetAndResizeInstancesArrayJob, instances) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::InstanceDataSystem_ComputeInstancesOffsetAndResizeInstancesArrayJob, 0x28>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies Unity.Collections.LowLevel.Unsafe.UnsafeAtomicCounter32, Unity.Collections.NativeArray`1<T>, Unity.Collections.NativeParallelMultiHashMap`2<TKey, TValue>,
// UnityEngine.Rendering.InstanceHandle
namespace UnityEngine::Rendering {
// Is value type: true
// CS Name: UnityEngine.Rendering.InstanceDataSystem/QueryRendererGroupInstancesJob
struct CORDL_TYPE InstanceDataSystem_QueryRendererGroupInstancesJob {
public:
  // Declarations
  /// @brief Convert operator to "::Unity::Jobs::IJobParallelForBatch"
  constexpr operator ::Unity::Jobs::IJobParallelForBatch*();

  /// @brief Method Execute, addr 0x66744f4, size 0x134, virtual true, abstract: false, final true
  inline void Execute(int32_t startIndex, int32_t count);

  /// @brief Convert to "::Unity::Jobs::IJobParallelForBatch"
  constexpr ::Unity::Jobs::IJobParallelForBatch* i___Unity__Jobs__IJobParallelForBatch();

  // Ctor Parameters []
  // @brief default ctor
  constexpr InstanceDataSystem_QueryRendererGroupInstancesJob();

  // Ctor Parameters [CppParam { name: "rendererGroupInstanceMultiHash", ty: "::Unity::Collections::NativeParallelMultiHashMap_2<int32_t,::UnityEngine::Rendering::InstanceHandle>", modifiers: "",
  // def_value: None }, CppParam { name: "rendererGroupIDs", ty: "::Unity::Collections::NativeArray_1<int32_t>", modifiers: "", def_value: None }, CppParam { name: "instances", ty:
  // "::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle>", modifiers: "", def_value: None }, CppParam { name: "atomicNonFoundInstancesCount", ty:
  // "::Unity::Collections::LowLevel::Unsafe::UnsafeAtomicCounter32", modifiers: "", def_value: None }]
  constexpr InstanceDataSystem_QueryRendererGroupInstancesJob(::Unity::Collections::NativeParallelMultiHashMap_2<int32_t, ::UnityEngine::Rendering::InstanceHandle> rendererGroupInstanceMultiHash,
                                                              ::Unity::Collections::NativeArray_1<int32_t> rendererGroupIDs,
                                                              ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle> instances,
                                                              ::Unity::Collections::LowLevel::Unsafe::UnsafeAtomicCounter32 atomicNonFoundInstancesCount) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17678 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x38 };

  /// @brief Field k_BatchSize offset 0xffffffff size 0x4
  static constexpr int32_t k_BatchSize{ static_cast<int32_t>(0x80) };

  /// @brief Field rendererGroupInstanceMultiHash, offset: 0x0, size: 0x10, def value: None
  ::Unity::Collections::NativeParallelMultiHashMap_2<int32_t, ::UnityEngine::Rendering::InstanceHandle> rendererGroupInstanceMultiHash;

  /// @brief Field rendererGroupIDs, offset: 0x10, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<int32_t> rendererGroupIDs;

  /// @brief Field instances, offset: 0x20, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle> instances;

  /// @brief Field atomicNonFoundInstancesCount, offset: 0x30, size: 0x8, def value: None
  ::Unity::Collections::LowLevel::Unsafe::UnsafeAtomicCounter32 atomicNonFoundInstancesCount;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesJob, rendererGroupInstanceMultiHash) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesJob, rendererGroupIDs) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesJob, instances) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesJob, atomicNonFoundInstancesCount) == 0x30, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesJob, 0x38>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies Unity.Collections.LowLevel.Unsafe.UnsafeAtomicCounter32, Unity.Collections.NativeArray`1<T>, Unity.Collections.NativeParallelMultiHashMap`2<TKey, TValue>,
// UnityEngine.Rendering.InstanceHandle
namespace UnityEngine::Rendering {
// Is value type: true
// CS Name: UnityEngine.Rendering.InstanceDataSystem/QueryRendererGroupInstancesMultiJob
struct CORDL_TYPE InstanceDataSystem_QueryRendererGroupInstancesMultiJob {
public:
  // Declarations
  /// @brief Convert operator to "::Unity::Jobs::IJobParallelForBatch"
  constexpr operator ::Unity::Jobs::IJobParallelForBatch*();

  /// @brief Method Execute, addr 0x6674628, size 0x20c, virtual true, abstract: false, final true
  inline void Execute(int32_t startIndex, int32_t count);

  /// @brief Convert to "::Unity::Jobs::IJobParallelForBatch"
  constexpr ::Unity::Jobs::IJobParallelForBatch* i___Unity__Jobs__IJobParallelForBatch();

  // Ctor Parameters []
  // @brief default ctor
  constexpr InstanceDataSystem_QueryRendererGroupInstancesMultiJob();

  // Ctor Parameters [CppParam { name: "rendererGroupInstanceMultiHash", ty: "::Unity::Collections::NativeParallelMultiHashMap_2<int32_t,::UnityEngine::Rendering::InstanceHandle>", modifiers: "",
  // def_value: None }, CppParam { name: "rendererGroupIDs", ty: "::Unity::Collections::NativeArray_1<int32_t>", modifiers: "", def_value: None }, CppParam { name: "instancesOffsets", ty:
  // "::Unity::Collections::NativeArray_1<int32_t>", modifiers: "", def_value: None }, CppParam { name: "instancesCounts", ty: "::Unity::Collections::NativeArray_1<int32_t>", modifiers: "", def_value:
  // None }, CppParam { name: "instances", ty: "::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle>", modifiers: "", def_value: None }, CppParam { name:
  // "atomicNonFoundSharedInstancesCount", ty: "::Unity::Collections::LowLevel::Unsafe::UnsafeAtomicCounter32", modifiers: "", def_value: None }, CppParam { name: "atomicNonFoundInstancesCount", ty:
  // "::Unity::Collections::LowLevel::Unsafe::UnsafeAtomicCounter32", modifiers: "", def_value: None }]
  constexpr InstanceDataSystem_QueryRendererGroupInstancesMultiJob(::Unity::Collections::NativeParallelMultiHashMap_2<int32_t, ::UnityEngine::Rendering::InstanceHandle> rendererGroupInstanceMultiHash,
                                                                   ::Unity::Collections::NativeArray_1<int32_t> rendererGroupIDs, ::Unity::Collections::NativeArray_1<int32_t> instancesOffsets,
                                                                   ::Unity::Collections::NativeArray_1<int32_t> instancesCounts,
                                                                   ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle> instances,
                                                                   ::Unity::Collections::LowLevel::Unsafe::UnsafeAtomicCounter32 atomicNonFoundSharedInstancesCount,
                                                                   ::Unity::Collections::LowLevel::Unsafe::UnsafeAtomicCounter32 atomicNonFoundInstancesCount) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17679 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x60 };

  /// @brief Field k_BatchSize offset 0xffffffff size 0x4
  static constexpr int32_t k_BatchSize{ static_cast<int32_t>(0x80) };

  /// @brief Field rendererGroupInstanceMultiHash, offset: 0x0, size: 0x10, def value: None
  ::Unity::Collections::NativeParallelMultiHashMap_2<int32_t, ::UnityEngine::Rendering::InstanceHandle> rendererGroupInstanceMultiHash;

  /// @brief Field rendererGroupIDs, offset: 0x10, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<int32_t> rendererGroupIDs;

  /// @brief Field instancesOffsets, offset: 0x20, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<int32_t> instancesOffsets;

  /// @brief Field instancesCounts, offset: 0x30, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<int32_t> instancesCounts;

  /// @brief Field instances, offset: 0x40, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle> instances;

  /// @brief Field atomicNonFoundSharedInstancesCount, offset: 0x50, size: 0x8, def value: None
  ::Unity::Collections::LowLevel::Unsafe::UnsafeAtomicCounter32 atomicNonFoundSharedInstancesCount;

  /// @brief Field atomicNonFoundInstancesCount, offset: 0x58, size: 0x8, def value: None
  ::Unity::Collections::LowLevel::Unsafe::UnsafeAtomicCounter32 atomicNonFoundInstancesCount;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesMultiJob, rendererGroupInstanceMultiHash) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesMultiJob, rendererGroupIDs) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesMultiJob, instancesOffsets) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesMultiJob, instancesCounts) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesMultiJob, instances) == 0x40, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesMultiJob, atomicNonFoundSharedInstancesCount) == 0x50, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesMultiJob, atomicNonFoundInstancesCount) == 0x58, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::InstanceDataSystem_QueryRendererGroupInstancesMultiJob, 0x60>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies Unity.Collections.NativeArray`1<T>, Unity.Collections.NativeList`1<T>, UnityEngine.Rendering.CPUInstanceData, UnityEngine.Rendering.CPUSharedInstanceData,
// UnityEngine.Rendering.InstanceHandle
namespace UnityEngine::Rendering {
// Is value type: true
// CS Name: UnityEngine.Rendering.InstanceDataSystem/QuerySortedMeshInstancesJob
struct CORDL_TYPE InstanceDataSystem_QuerySortedMeshInstancesJob {
public:
  // Declarations
  /// @brief Convert operator to "::Unity::Jobs::IJobParallelForBatch"
  constexpr operator ::Unity::Jobs::IJobParallelForBatch*();

  /// @brief Method Execute, addr 0x6674834, size 0x1f8, virtual true, abstract: false, final true
  inline void Execute(int32_t startIndex, int32_t count);

  /// @brief Convert to "::Unity::Jobs::IJobParallelForBatch"
  constexpr ::Unity::Jobs::IJobParallelForBatch* i___Unity__Jobs__IJobParallelForBatch();

  // Ctor Parameters []
  // @brief default ctor
  constexpr InstanceDataSystem_QuerySortedMeshInstancesJob();

  // Ctor Parameters [CppParam { name: "instanceData", ty: "::UnityEngine::Rendering::CPUInstanceData", modifiers: "", def_value: None }, CppParam { name: "sharedInstanceData", ty:
  // "::UnityEngine::Rendering::CPUSharedInstanceData", modifiers: "", def_value: None }, CppParam { name: "sortedMeshID", ty: "::Unity::Collections::NativeArray_1<int32_t>", modifiers: "", def_value:
  // None }, CppParam { name: "instances", ty: "::Unity::Collections::NativeList_1<::UnityEngine::Rendering::InstanceHandle>", modifiers: "", def_value: None }]
  constexpr InstanceDataSystem_QuerySortedMeshInstancesJob(::UnityEngine::Rendering::CPUInstanceData instanceData, ::UnityEngine::Rendering::CPUSharedInstanceData sharedInstanceData,
                                                           ::Unity::Collections::NativeArray_1<int32_t> sortedMeshID,
                                                           ::Unity::Collections::NativeList_1<::UnityEngine::Rendering::InstanceHandle> instances) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17680 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x1a0 };

  /// @brief Field k_BatchSize offset 0xffffffff size 0x4
  static constexpr int32_t k_BatchSize{ static_cast<int32_t>(0x40) };

  /// @brief Field instanceData, offset: 0x0, size: 0xe0, def value: None
  ::UnityEngine::Rendering::CPUInstanceData instanceData;

  /// @brief Field sharedInstanceData, offset: 0xe0, size: 0xa8, def value: None
  ::UnityEngine::Rendering::CPUSharedInstanceData sharedInstanceData;

  /// @brief Field sortedMeshID, offset: 0x188, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<int32_t> sortedMeshID;

  /// @brief Field instances, offset: 0x198, size: 0x8, def value: None
  ::Unity::Collections::NativeList_1<::UnityEngine::Rendering::InstanceHandle> instances;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QuerySortedMeshInstancesJob, instanceData) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QuerySortedMeshInstancesJob, sharedInstanceData) == 0xe0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QuerySortedMeshInstancesJob, sortedMeshID) == 0x188, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_QuerySortedMeshInstancesJob, instances) == 0x198, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::InstanceDataSystem_QuerySortedMeshInstancesJob, 0x1a0>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies Unity.Collections.NativeArray`1<T>, UnityEngine.LightProbesQuery, UnityEngine.Rendering.SphericalHarmonicsL2, UnityEngine.Vector3, UnityEngine.Vector4
namespace UnityEngine::Rendering {
// Is value type: true
// CS Name: UnityEngine.Rendering.InstanceDataSystem/CalculateInterpolatedLightAndOcclusionProbesBatchJob
struct CORDL_TYPE InstanceDataSystem_CalculateInterpolatedLightAndOcclusionProbesBatchJob {
public:
  // Declarations
  /// @brief Convert operator to "::Unity::Jobs::IJobParallelFor"
  constexpr operator ::Unity::Jobs::IJobParallelFor*();

  /// @brief Method Execute, addr 0x6674a2c, size 0x168, virtual true, abstract: false, final true
  inline void Execute(int32_t index);

  /// @brief Convert to "::Unity::Jobs::IJobParallelFor"
  constexpr ::Unity::Jobs::IJobParallelFor* i___Unity__Jobs__IJobParallelFor();

  // Ctor Parameters []
  // @brief default ctor
  constexpr InstanceDataSystem_CalculateInterpolatedLightAndOcclusionProbesBatchJob();

  // Ctor Parameters [CppParam { name: "probesCount", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "lightProbesQuery", ty: "::UnityEngine::LightProbesQuery", modifiers: "",
  // def_value: None }, CppParam { name: "queryPostitions", ty: "::Unity::Collections::NativeArray_1<::UnityEngine::Vector3>", modifiers: "", def_value: None }, CppParam { name:
  // "compactTetrahedronCache", ty: "::Unity::Collections::NativeArray_1<int32_t>", modifiers: "", def_value: None }, CppParam { name: "probesSphericalHarmonics", ty:
  // "::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::SphericalHarmonicsL2>", modifiers: "", def_value: None }, CppParam { name: "probesOcclusion", ty:
  // "::Unity::Collections::NativeArray_1<::UnityEngine::Vector4>", modifiers: "", def_value: None }]
  constexpr InstanceDataSystem_CalculateInterpolatedLightAndOcclusionProbesBatchJob(int32_t probesCount, ::UnityEngine::LightProbesQuery lightProbesQuery,
                                                                                    ::Unity::Collections::NativeArray_1<::UnityEngine::Vector3> queryPostitions,
                                                                                    ::Unity::Collections::NativeArray_1<int32_t> compactTetrahedronCache,
                                                                                    ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::SphericalHarmonicsL2> probesSphericalHarmonics,
                                                                                    ::Unity::Collections::NativeArray_1<::UnityEngine::Vector4> probesOcclusion) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17681 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x58 };

  /// @brief Field k_BatchSize offset 0xffffffff size 0x4
  static constexpr int32_t k_BatchSize{ static_cast<int32_t>(0x1) };

  /// @brief Field k_CalculatedProbesPerBatch offset 0xffffffff size 0x4
  static constexpr int32_t k_CalculatedProbesPerBatch{ static_cast<int32_t>(0x8) };

  /// @brief Field probesCount, offset: 0x0, size: 0x4, def value: None
  int32_t probesCount;

  /// @brief Field lightProbesQuery, offset: 0x8, size: 0x10, def value: None
  ::UnityEngine::LightProbesQuery lightProbesQuery;

  /// @brief Field queryPostitions, offset: 0x18, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Vector3> queryPostitions;

  /// @brief Field compactTetrahedronCache, offset: 0x28, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<int32_t> compactTetrahedronCache;

  /// @brief Field probesSphericalHarmonics, offset: 0x38, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::SphericalHarmonicsL2> probesSphericalHarmonics;

  /// @brief Field probesOcclusion, offset: 0x48, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Vector4> probesOcclusion;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_CalculateInterpolatedLightAndOcclusionProbesBatchJob, probesCount) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_CalculateInterpolatedLightAndOcclusionProbesBatchJob, lightProbesQuery) == 0x8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_CalculateInterpolatedLightAndOcclusionProbesBatchJob, queryPostitions) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_CalculateInterpolatedLightAndOcclusionProbesBatchJob, compactTetrahedronCache) == 0x28, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_CalculateInterpolatedLightAndOcclusionProbesBatchJob, probesSphericalHarmonics) == 0x38, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_CalculateInterpolatedLightAndOcclusionProbesBatchJob, probesOcclusion) == 0x48, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::InstanceDataSystem_CalculateInterpolatedLightAndOcclusionProbesBatchJob, 0x58>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies Unity.Collections.NativeArray`1<T>, UnityEngine.Rendering.CPUInstanceData, UnityEngine.Rendering.InstanceHandle
namespace UnityEngine::Rendering {
// Is value type: true
// CS Name: UnityEngine.Rendering.InstanceDataSystem/ScatterTetrahedronCacheIndicesJob
struct CORDL_TYPE InstanceDataSystem_ScatterTetrahedronCacheIndicesJob {
public:
  // Declarations
  /// @brief Convert operator to "::Unity::Jobs::IJobParallelFor"
  constexpr operator ::Unity::Jobs::IJobParallelFor*();

  /// @brief Method Execute, addr 0x6674b94, size 0x3c, virtual true, abstract: false, final true
  inline void Execute(int32_t index);

  /// @brief Convert to "::Unity::Jobs::IJobParallelFor"
  constexpr ::Unity::Jobs::IJobParallelFor* i___Unity__Jobs__IJobParallelFor();

  // Ctor Parameters []
  // @brief default ctor
  constexpr InstanceDataSystem_ScatterTetrahedronCacheIndicesJob();

  // Ctor Parameters [CppParam { name: "probeInstances", ty: "::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle>", modifiers: "", def_value: None }, CppParam { name:
  // "compactTetrahedronCache", ty: "::Unity::Collections::NativeArray_1<int32_t>", modifiers: "", def_value: None }, CppParam { name: "instanceData", ty: "::UnityEngine::Rendering::CPUInstanceData",
  // modifiers: "", def_value: None }]
  constexpr InstanceDataSystem_ScatterTetrahedronCacheIndicesJob(::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle> probeInstances,
                                                                 ::Unity::Collections::NativeArray_1<int32_t> compactTetrahedronCache, ::UnityEngine::Rendering::CPUInstanceData instanceData) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17682 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x100 };

  /// @brief Field k_BatchSize offset 0xffffffff size 0x4
  static constexpr int32_t k_BatchSize{ static_cast<int32_t>(0x80) };

  /// @brief Field probeInstances, offset: 0x0, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle> probeInstances;

  /// @brief Field compactTetrahedronCache, offset: 0x10, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<int32_t> compactTetrahedronCache;

  /// @brief Field instanceData, offset: 0x20, size: 0xe0, def value: None
  ::UnityEngine::Rendering::CPUInstanceData instanceData;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_ScatterTetrahedronCacheIndicesJob, probeInstances) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_ScatterTetrahedronCacheIndicesJob, compactTetrahedronCache) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_ScatterTetrahedronCacheIndicesJob, instanceData) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::InstanceDataSystem_ScatterTetrahedronCacheIndicesJob, 0x100>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies Unity.Collections.LowLevel.Unsafe.UnsafeAtomicCounter32, Unity.Collections.NativeArray`1<T>, Unity.Mathematics.float4, UnityEngine.Matrix4x4, UnityEngine.Rendering.CPUInstanceData,
// UnityEngine.Rendering.CPUSharedInstanceData, UnityEngine.Rendering.InstanceHandle, UnityEngine.Rendering.TransformUpdatePacket
namespace UnityEngine::Rendering {
// Is value type: true
// CS Name: UnityEngine.Rendering.InstanceDataSystem/TransformUpdateJob
struct CORDL_TYPE InstanceDataSystem_TransformUpdateJob {
public:
  // Declarations
  /// @brief Convert operator to "::Unity::Jobs::IJobParallelForBatch"
  constexpr operator ::Unity::Jobs::IJobParallelForBatch*();

  /// @brief Method Execute, addr 0x6674bd0, size 0x5a0, virtual true, abstract: false, final true
  inline void Execute(int32_t startIndex, int32_t count);

  /// @brief Convert to "::Unity::Jobs::IJobParallelForBatch"
  constexpr ::Unity::Jobs::IJobParallelForBatch* i___Unity__Jobs__IJobParallelForBatch();

  // Ctor Parameters []
  // @brief default ctor
  constexpr InstanceDataSystem_TransformUpdateJob();

  // Ctor Parameters [CppParam { name: "initialize", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "enableBoundingSpheres", ty: "bool", modifiers: "", def_value: None }, CppParam {
  // name: "instances", ty: "::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle>", modifiers: "", def_value: None }, CppParam { name: "localToWorldMatrices", ty:
  // "::Unity::Collections::NativeArray_1<::UnityEngine::Matrix4x4>", modifiers: "", def_value: None }, CppParam { name: "prevLocalToWorldMatrices", ty:
  // "::Unity::Collections::NativeArray_1<::UnityEngine::Matrix4x4>", modifiers: "", def_value: None }, CppParam { name: "atomicTransformQueueCount", ty:
  // "::Unity::Collections::LowLevel::Unsafe::UnsafeAtomicCounter32", modifiers: "", def_value: None }, CppParam { name: "sharedInstanceData", ty: "::UnityEngine::Rendering::CPUSharedInstanceData",
  // modifiers: "", def_value: None }, CppParam { name: "instanceData", ty: "::UnityEngine::Rendering::CPUInstanceData", modifiers: "", def_value: None }, CppParam { name:
  // "transformUpdateInstanceQueue", ty: "::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle>", modifiers: "", def_value: None }, CppParam { name: "transformUpdateDataQueue",
  // ty: "::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::TransformUpdatePacket>", modifiers: "", def_value: None }, CppParam { name: "boundingSpheresDataQueue", ty:
  // "::Unity::Collections::NativeArray_1<::Unity::Mathematics::float4>", modifiers: "", def_value: None }]
  constexpr InstanceDataSystem_TransformUpdateJob(bool initialize, bool enableBoundingSpheres, ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle> instances,
                                                  ::Unity::Collections::NativeArray_1<::UnityEngine::Matrix4x4> localToWorldMatrices,
                                                  ::Unity::Collections::NativeArray_1<::UnityEngine::Matrix4x4> prevLocalToWorldMatrices,
                                                  ::Unity::Collections::LowLevel::Unsafe::UnsafeAtomicCounter32 atomicTransformQueueCount,
                                                  ::UnityEngine::Rendering::CPUSharedInstanceData sharedInstanceData, ::UnityEngine::Rendering::CPUInstanceData instanceData,
                                                  ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle> transformUpdateInstanceQueue,
                                                  ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::TransformUpdatePacket> transformUpdateDataQueue,
                                                  ::Unity::Collections::NativeArray_1<::Unity::Mathematics::float4> boundingSpheresDataQueue) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17683 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x1f8 };

  /// @brief Field k_BatchSize offset 0xffffffff size 0x4
  static constexpr int32_t k_BatchSize{ static_cast<int32_t>(0x40) };

  /// @brief Field initialize, offset: 0x0, size: 0x1, def value: None
  bool initialize;

  /// @brief Field enableBoundingSpheres, offset: 0x1, size: 0x1, def value: None
  bool enableBoundingSpheres;

  /// @brief Field instances, offset: 0x8, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle> instances;

  /// @brief Field localToWorldMatrices, offset: 0x18, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Matrix4x4> localToWorldMatrices;

  /// @brief Field prevLocalToWorldMatrices, offset: 0x28, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Matrix4x4> prevLocalToWorldMatrices;

  /// @brief Field atomicTransformQueueCount, offset: 0x38, size: 0x8, def value: None
  ::Unity::Collections::LowLevel::Unsafe::UnsafeAtomicCounter32 atomicTransformQueueCount;

  /// @brief Field sharedInstanceData, offset: 0x40, size: 0xa8, def value: None
  ::UnityEngine::Rendering::CPUSharedInstanceData sharedInstanceData;

  /// @brief Field instanceData, offset: 0xe8, size: 0xe0, def value: None
  ::UnityEngine::Rendering::CPUInstanceData instanceData;

  /// @brief Field transformUpdateInstanceQueue, offset: 0x1c8, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle> transformUpdateInstanceQueue;

  /// @brief Field transformUpdateDataQueue, offset: 0x1d8, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::TransformUpdatePacket> transformUpdateDataQueue;

  /// @brief Field boundingSpheresDataQueue, offset: 0x1e8, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::Unity::Mathematics::float4> boundingSpheresDataQueue;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_TransformUpdateJob, initialize) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_TransformUpdateJob, enableBoundingSpheres) == 0x1, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_TransformUpdateJob, instances) == 0x8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_TransformUpdateJob, localToWorldMatrices) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_TransformUpdateJob, prevLocalToWorldMatrices) == 0x28, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_TransformUpdateJob, atomicTransformQueueCount) == 0x38, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_TransformUpdateJob, sharedInstanceData) == 0x40, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_TransformUpdateJob, instanceData) == 0xe8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_TransformUpdateJob, transformUpdateInstanceQueue) == 0x1c8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_TransformUpdateJob, transformUpdateDataQueue) == 0x1d8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_TransformUpdateJob, boundingSpheresDataQueue) == 0x1e8, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::InstanceDataSystem_TransformUpdateJob, 0x1f8>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies Unity.Collections.LowLevel.Unsafe.UnsafeAtomicCounter32, Unity.Collections.NativeArray`1<T>, UnityEngine.Rendering.CPUInstanceData, UnityEngine.Rendering.CPUSharedInstanceData,
// UnityEngine.Rendering.InstanceHandle, UnityEngine.Vector3
namespace UnityEngine::Rendering {
// Is value type: true
// CS Name: UnityEngine.Rendering.InstanceDataSystem/ProbesUpdateJob
struct CORDL_TYPE InstanceDataSystem_ProbesUpdateJob {
public:
  // Declarations
  /// @brief Convert operator to "::Unity::Jobs::IJobParallelForBatch"
  constexpr operator ::Unity::Jobs::IJobParallelForBatch*();

  /// @brief Method Execute, addr 0x6675170, size 0x298, virtual true, abstract: false, final true
  inline void Execute(int32_t startIndex, int32_t count);

  /// @brief Convert to "::Unity::Jobs::IJobParallelForBatch"
  constexpr ::Unity::Jobs::IJobParallelForBatch* i___Unity__Jobs__IJobParallelForBatch();

  // Ctor Parameters []
  // @brief default ctor
  constexpr InstanceDataSystem_ProbesUpdateJob();

  // Ctor Parameters [CppParam { name: "instances", ty: "::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle>", modifiers: "", def_value: None }, CppParam { name:
  // "instanceData", ty: "::UnityEngine::Rendering::CPUInstanceData", modifiers: "", def_value: None }, CppParam { name: "sharedInstanceData", ty: "::UnityEngine::Rendering::CPUSharedInstanceData",
  // modifiers: "", def_value: None }, CppParam { name: "atomicProbesQueueCount", ty: "::Unity::Collections::LowLevel::Unsafe::UnsafeAtomicCounter32", modifiers: "", def_value: None }, CppParam {
  // name: "probeInstanceQueue", ty: "::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle>", modifiers: "", def_value: None }, CppParam { name: "compactTetrahedronCache", ty:
  // "::Unity::Collections::NativeArray_1<int32_t>", modifiers: "", def_value: None }, CppParam { name: "probeQueryPosition", ty: "::Unity::Collections::NativeArray_1<::UnityEngine::Vector3>",
  // modifiers: "", def_value: None }]
  constexpr InstanceDataSystem_ProbesUpdateJob(::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle> instances, ::UnityEngine::Rendering::CPUInstanceData instanceData,
                                               ::UnityEngine::Rendering::CPUSharedInstanceData sharedInstanceData, ::Unity::Collections::LowLevel::Unsafe::UnsafeAtomicCounter32 atomicProbesQueueCount,
                                               ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle> probeInstanceQueue,
                                               ::Unity::Collections::NativeArray_1<int32_t> compactTetrahedronCache,
                                               ::Unity::Collections::NativeArray_1<::UnityEngine::Vector3> probeQueryPosition) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 17684 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x1d0 };

  /// @brief Field k_BatchSize offset 0xffffffff size 0x4
  static constexpr int32_t k_BatchSize{ static_cast<int32_t>(0x40) };

  /// @brief Field instances, offset: 0x0, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle> instances;

  /// @brief Field instanceData, offset: 0x10, size: 0xe0, def value: None
  ::UnityEngine::Rendering::CPUInstanceData instanceData;

  /// @brief Field sharedInstanceData, offset: 0xf0, size: 0xa8, def value: None
  ::UnityEngine::Rendering::CPUSharedInstanceData sharedInstanceData;

  /// @brief Field atomicProbesQueueCount, offset: 0x198, size: 0x8, def value: None
  ::Unity::Collections::LowLevel::Unsafe::UnsafeAtomicCounter32 atomicProbesQueueCount;

  /// @brief Field probeInstanceQueue, offset: 0x1a0, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::InstanceHandle> probeInstanceQueue;

  /// @brief Field compactTetrahedronCache, offset: 0x1b0, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<int32_t> compactTetrahedronCache;

  /// @brief Field probeQueryPosition, offset: 0x1c0, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Vector3> probeQueryPosition;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_ProbesUpdateJob, instances) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_ProbesUpdateJob, instanceData) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_ProbesUpdateJob, sharedInstanceData) == 0xf0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_ProbesUpdateJob, atomicProbesQueueCount) == 0x198, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_ProbesUpdateJob, probeInstanceQueue) == 0x1a0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_ProbesUpdateJob, compactTetrahedronCache) == 0x1b0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::InstanceDataSystem_ProbesUpdateJob, probeQueryPosition) == 0x1c0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::InstanceDataSystem_ProbesUpdateJob, 0x1d0>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies Unity.Collections.LowLevel.Unsafe.UnsafeAtomicCounter32, Unity.Collections.NativeArray`1<T>, UnityEngine.Rendering.CPUInstanceData, UnityEngine.Rendering.InstanceHandle
namespace UnityEngine::Rendering {
// Is value type: true
// CS Name: UnityEngine.Rendering.InstanceDataSystem/MotionUpdateJob
struct CORDL_TYPE InstanceDataSystem_MotionUpdateJob {
public:
  // Declarations
  /// @brief Convert operator to "::Unity::Jobs::IJobParallelFor"
  constexpr operator ::Unity::Jobs::IJobParallelFor*();

  /// @brief Method Execute, addr 0x6675408, size 0x184, virtual true, abstract: false, final true
  inline void Execute(int32_t chunk_index);

  /// @brief Convert to "::Unity::Jobs::IJobParallelFor"
  constexpr ::Unity::Jobs::IJobParallelFor* i___Unity__Jobs__IJobParallelFor();

  // Ctor Parameters []
  // @brief default ctor
  constexpr InstanceDataSystem_MotionUpdateJob();

  // Ctor Parameters [CppParam { name: "queueWriteBase", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "instanceData", ty: "::UnityEngine::Rendering::CPUInstanceData", modifiers:
  // "", def_value: None }, CppParam { name: "atomicUpdateQueueCount", ty: "::Unity::Collections::LowLevel::Unsafe::UnsafeAtomicCounter32", modifiers: "", def_value: None }, CppParam { name:
