#pragma once
// IWYU pragma private; include "UnityEngine/Rendering/ProbeReferenceVolume.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__MulticastDelegate_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "Unity/Collections/zzzz__NativeArray_1_def.hpp"
#include "Unity/IO/LowLevel/Unsafe/zzzz__ReadCommandArray_def.hpp"
#include "Unity/IO/LowLevel/Unsafe/zzzz__ReadCommand_def.hpp"
#include "Unity/IO/LowLevel/Unsafe/zzzz__ReadHandle_def.hpp"
#include "UnityEngine/Rendering/RenderGraphModule/zzzz__TextureHandle_def.hpp"
#include "UnityEngine/Rendering/zzzz__ProbeBrickIndex_def.hpp"
#include "UnityEngine/Rendering/zzzz__ProbeBrickPool_def.hpp"
#include "UnityEngine/Rendering/zzzz__ProbeVolumeBlendingTextureMemoryBudget_def.hpp"
#include "UnityEngine/Rendering/zzzz__ProbeVolumeSHBands_def.hpp"
#include "UnityEngine/Rendering/zzzz__ProbeVolumeTextureMemoryBudget_def.hpp"
#include "UnityEngine/zzzz__Bounds_def.hpp"
#include "UnityEngine/zzzz__Quaternion_def.hpp"
#include "UnityEngine/zzzz__Vector3Int_def.hpp"
#include "UnityEngine/zzzz__Vector3_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cmath>
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(ProbeReferenceVolume)
namespace System::Collections::Generic {
template <typename TKey, typename TValue> class Dictionary_2;
}
namespace System::Collections::Generic {

class ProbeReferenceVolume_ShaderIDs;
}
namespace UnityEngine::Rendering {
class ProbeReferenceVolume___c;
}
namespace UnityEngine::Rendering {
class ProbeReferenceVolume___c__DisplayClass314_0;
}
namespace UnityEngine::Rendering {
struct CellData_ProbeReferenceVolume_PerScenarioData;
}
namespace UnityEngine::Rendering {
struct ProbeReferenceVolume_CellStreamingScratchBufferLayout;
}
namespace UnityEngine::Rendering {
struct ProbeReferenceVolume_ExtraDataActionInput;
}
namespace UnityEngine::Rendering {
struct ProbeReferenceVolume_IndirectionEntryInfo;
}
namespace UnityEngine::Rendering {
struct ProbeReferenceVolume_RefVolTransform;
}
namespace UnityEngine::Rendering {
struct ProbeReferenceVolume_RuntimeResources;
}
namespace UnityEngine::Rendering {
struct ProbeReferenceVolume_Volume;
}
// Write type traits
MARK_VAL_T(::UnityEngine::Rendering::CellStreamingRequest_ProbeReferenceVolume_State);
MARK_REF_PTR_T(::UnityEngine::Rendering::CellStreamingRequest_ProbeReferenceVolume_OnStreamingCompleteDelegate);
MARK_REF_PTR_T(::UnityEngine::Rendering::ProbeReferenceVolume);
MARK_REF_PTR_T(::UnityEngine::Rendering::ProbeReferenceVolume_Cell);
MARK_REF_PTR_T(::UnityEngine::Rendering::ProbeReferenceVolume_CellBlendingInfo);
MARK_REF_PTR_T(::UnityEngine::Rendering::ProbeReferenceVolume_CellData);
MARK_REF_PTR_T(::UnityEngine::Rendering::ProbeReferenceVolume_CellDesc);
MARK_REF_PTR_T(::UnityEngine::Rendering::ProbeReferenceVolume_CellIndexInfo);
MARK_REF_PTR_T(::UnityEngine::Rendering::ProbeReferenceVolume_CellInstancedDebugProbes);
MARK_REF_PTR_T(::UnityEngine::Rendering::ProbeReferenceVolume_CellPoolInfo);
MARK_REF_PTR_T(::UnityEngine::Rendering::ProbeReferenceVolume_CellStreamingInfo);
MARK_REF_PTR_T(::UnityEngine::Rendering::ProbeReferenceVolume_CellStreamingRequest);
MARK_REF_PTR_T(::UnityEngine::Rendering::ProbeReferenceVolume_CellStreamingScratchBuffer);
MARK_REF_PTR_T(::UnityEngine::Rendering::ProbeReferenceVolume_DiskStreamingRequest);
MARK_REF_PTR_T(::UnityEngine::Rendering::ProbeReferenceVolume_RenderFragmentationOverlayPassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::ProbeReferenceVolume_ShaderIDs);
MARK_REF_PTR_T(::UnityEngine::Rendering::ProbeReferenceVolume___c);
MARK_REF_PTR_T(::UnityEngine::Rendering::ProbeReferenceVolume___c__DisplayClass314_0);
MARK_VAL_T(::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData);
MARK_VAL_T(::UnityEngine::Rendering::ProbeReferenceVolume_CellStreamingScratchBufferLayout);
MARK_VAL_T(::UnityEngine::Rendering::ProbeReferenceVolume_ExtraDataActionInput);
MARK_VAL_T(::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo);
MARK_VAL_T(::UnityEngine::Rendering::ProbeReferenceVolume_RefVolTransform);
MARK_VAL_T(::UnityEngine::Rendering::ProbeReferenceVolume_RuntimeResources);
MARK_VAL_T(::UnityEngine::Rendering::ProbeReferenceVolume_Volume);
// Dependencies System.Object
namespace UnityEngine::Rendering {
// Is value type: false
// CS Name: UnityEngine.Rendering.ProbeReferenceVolume/ShaderIDs
class CORDL_TYPE ProbeReferenceVolume_ShaderIDs : public ::System::Object {
public:
  // Declarations
  /// @brief Field _APVProbeOcclusion, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__APVProbeOcclusion, put = setStaticF__APVProbeOcclusion)) int32_t _APVProbeOcclusion;

  /// @brief Field _APVResCellIndices, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__APVResCellIndices, put = setStaticF__APVResCellIndices)) int32_t _APVResCellIndices;

  /// @brief Field _APVResIndex, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__APVResIndex, put = setStaticF__APVResIndex)) int32_t _APVResIndex;

  /// @brief Field _APVResL0_L1Rx, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__APVResL0_L1Rx, put = setStaticF__APVResL0_L1Rx)) int32_t _APVResL0_L1Rx;

  /// @brief Field _APVResL1B_L1Rz, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__APVResL1B_L1Rz, put = setStaticF__APVResL1B_L1Rz)) int32_t _APVResL1B_L1Rz;

  /// @brief Field _APVResL1G_L1Ry, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__APVResL1G_L1Ry, put = setStaticF__APVResL1G_L1Ry)) int32_t _APVResL1G_L1Ry;

  /// @brief Field _APVResL2_0, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__APVResL2_0, put = setStaticF__APVResL2_0)) int32_t _APVResL2_0;

  /// @brief Field _APVResL2_1, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__APVResL2_1, put = setStaticF__APVResL2_1)) int32_t _APVResL2_1;

  /// @brief Field _APVResL2_2, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__APVResL2_2, put = setStaticF__APVResL2_2)) int32_t _APVResL2_2;

  /// @brief Field _APVResL2_3, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__APVResL2_3, put = setStaticF__APVResL2_3)) int32_t _APVResL2_3;

  /// @brief Field _APVResValidity, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__APVResValidity, put = setStaticF__APVResValidity)) int32_t _APVResValidity;

  /// @brief Field _AntiLeakData, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__AntiLeakData, put = setStaticF__AntiLeakData)) int32_t _AntiLeakData;

  /// @brief Field _SkyOcclusionTexL0L1, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__SkyOcclusionTexL0L1, put = setStaticF__SkyOcclusionTexL0L1)) int32_t _SkyOcclusionTexL0L1;

  /// @brief Field _SkyPrecomputedDirections, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__SkyPrecomputedDirections, put = setStaticF__SkyPrecomputedDirections)) int32_t _SkyPrecomputedDirections;

  /// @brief Field _SkyShadingDirectionIndicesTex, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__SkyShadingDirectionIndicesTex, put = setStaticF__SkyShadingDirectionIndicesTex)) int32_t _SkyShadingDirectionIndicesTex;

  static inline int32_t getStaticF__APVProbeOcclusion();

  static inline int32_t getStaticF__APVResCellIndices();

  static inline int32_t getStaticF__APVResIndex();

  static inline int32_t getStaticF__APVResL0_L1Rx();

  static inline int32_t getStaticF__APVResL1B_L1Rz();

  static inline int32_t getStaticF__APVResL1G_L1Ry();

  static inline int32_t getStaticF__APVResL2_0();

  static inline int32_t getStaticF__APVResL2_1();

  static inline int32_t getStaticF__APVResL2_2();

  static inline int32_t getStaticF__APVResL2_3();

  static inline int32_t getStaticF__APVResValidity();

  static inline int32_t getStaticF__AntiLeakData();

  static inline int32_t getStaticF__SkyOcclusionTexL0L1();

  static inline int32_t getStaticF__SkyPrecomputedDirections();

  static inline int32_t getStaticF__SkyShadingDirectionIndicesTex();

  static inline void setStaticF__APVProbeOcclusion(int32_t value);

  static inline void setStaticF__APVResCellIndices(int32_t value);

  static inline void setStaticF__APVResIndex(int32_t value);

  static inline void setStaticF__APVResL0_L1Rx(int32_t value);

  static inline void setStaticF__APVResL1B_L1Rz(int32_t value);

  static inline void setStaticF__APVResL1G_L1Ry(int32_t value);

  static inline void setStaticF__APVResL2_0(int32_t value);

  static inline void setStaticF__APVResL2_1(int32_t value);

  static inline void setStaticF__APVResL2_2(int32_t value);

  static inline void setStaticF__APVResL2_3(int32_t value);

  static inline void setStaticF__APVResValidity(int32_t value);

  static inline void setStaticF__AntiLeakData(int32_t value);

  static inline void setStaticF__SkyOcclusionTexL0L1(int32_t value);

  static inline void setStaticF__SkyPrecomputedDirections(int32_t value);

  static inline void setStaticF__SkyShadingDirectionIndicesTex(int32_t value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr ProbeReferenceVolume_ShaderIDs();

public:
  // Ctor Parameters [CppParam { name: "", ty: "ProbeReferenceVolume_ShaderIDs", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  ProbeReferenceVolume_ShaderIDs(ProbeReferenceVolume_ShaderIDs&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "ProbeReferenceVolume_ShaderIDs", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  ProbeReferenceVolume_ShaderIDs(ProbeReferenceVolume_ShaderIDs const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12063 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::ProbeReferenceVolume_ShaderIDs, 0x10>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies UnityEngine.Vector3Int
namespace UnityEngine::Rendering {
// Is value type: true
// CS Name: UnityEngine.Rendering.ProbeReferenceVolume/IndirectionEntryInfo
struct CORDL_TYPE ProbeReferenceVolume_IndirectionEntryInfo {
public:
  // Declarations
  // Ctor Parameters []
  // @brief default ctor
  constexpr ProbeReferenceVolume_IndirectionEntryInfo();

  // Ctor Parameters [CppParam { name: "positionInBricks", ty: "::UnityEngine::Vector3Int", modifiers: "", def_value: None }, CppParam { name: "minSubdiv", ty: "int32_t", modifiers: "", def_value:
  // None }, CppParam { name: "minBrickPos", ty: "::UnityEngine::Vector3Int", modifiers: "", def_value: None }, CppParam { name: "maxBrickPosPlusOne", ty: "::UnityEngine::Vector3Int", modifiers: "",
  // def_value: None }, CppParam { name: "hasMinMax", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "hasOnlyBiggerBricks", ty: "bool", modifiers: "", def_value: None }]
  constexpr ProbeReferenceVolume_IndirectionEntryInfo(::UnityEngine::Vector3Int positionInBricks, int32_t minSubdiv, ::UnityEngine::Vector3Int minBrickPos,
                                                      ::UnityEngine::Vector3Int maxBrickPosPlusOne, bool hasMinMax, bool hasOnlyBiggerBricks) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12064 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x2c };

  /// @brief Field positionInBricks, offset: 0x0, size: 0xc, def value: None
  ::UnityEngine::Vector3Int positionInBricks;

  /// @brief Field minSubdiv, offset: 0xc, size: 0x4, def value: None
  int32_t minSubdiv;

  /// @brief Field minBrickPos, offset: 0x10, size: 0xc, def value: None
  ::UnityEngine::Vector3Int minBrickPos;

  /// @brief Field maxBrickPosPlusOne, offset: 0x1c, size: 0xc, def value: None
  ::UnityEngine::Vector3Int maxBrickPosPlusOne;

  /// @brief Field hasMinMax, offset: 0x28, size: 0x1, def value: None
  bool hasMinMax;

  /// @brief Field hasOnlyBiggerBricks, offset: 0x29, size: 0x1, def value: None
  bool hasOnlyBiggerBricks;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo, positionInBricks) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo, minSubdiv) == 0xc, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo, minBrickPos) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo, maxBrickPosPlusOne) == 0x1c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo, hasMinMax) == 0x28, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo, hasOnlyBiggerBricks) == 0x29, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo, 0x2c>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies System.Object, UnityEngine.Vector3Int
namespace UnityEngine::Rendering {
// Is value type: false
// CS Name: UnityEngine.Rendering.ProbeReferenceVolume/CellDesc
class CORDL_TYPE ProbeReferenceVolume_CellDesc : public ::System::Object {
public:
  // Declarations
  /// @brief Field bricksCount, offset 0x30, size 0x4
  __declspec(property(get = __cordl_internal_get_bricksCount, put = __cordl_internal_set_bricksCount)) int32_t bricksCount;

  /// @brief Field index, offset 0x1c, size 0x4
  __declspec(property(get = __cordl_internal_get_index, put = __cordl_internal_set_index)) int32_t index;

  /// @brief Field indexChunkCount, offset 0x28, size 0x4
  __declspec(property(get = __cordl_internal_get_indexChunkCount, put = __cordl_internal_set_indexChunkCount)) int32_t indexChunkCount;

  /// @brief Field indirectionEntryInfo, offset 0x38, size 0x8
  __declspec(property(get = __cordl_internal_get_indirectionEntryInfo,
                      put = __cordl_internal_set_indirectionEntryInfo)) ::ArrayW<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo,
                                                                                 ::Array<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo>*>
      indirectionEntryInfo;

  /// @brief Field minSubdiv, offset 0x24, size 0x4
  __declspec(property(get = __cordl_internal_get_minSubdiv, put = __cordl_internal_set_minSubdiv)) int32_t minSubdiv;

  /// @brief Field position, offset 0x10, size 0xc
  __declspec(property(get = __cordl_internal_get_position, put = __cordl_internal_set_position)) ::UnityEngine::Vector3Int position;

  /// @brief Field probeCount, offset 0x20, size 0x4
  __declspec(property(get = __cordl_internal_get_probeCount, put = __cordl_internal_set_probeCount)) int32_t probeCount;

  /// @brief Field shChunkCount, offset 0x2c, size 0x4
  __declspec(property(get = __cordl_internal_get_shChunkCount, put = __cordl_internal_set_shChunkCount)) int32_t shChunkCount;

  static inline ::UnityEngine::Rendering::ProbeReferenceVolume_CellDesc* New_ctor();

  /// @brief Method ToString, addr 0x65d7cbc, size 0xd4, virtual true, abstract: false, final false
  inline ::StringW ToString();

  constexpr int32_t const& __cordl_internal_get_bricksCount() const;

  constexpr int32_t& __cordl_internal_get_bricksCount();

  constexpr int32_t const& __cordl_internal_get_index() const;

  constexpr int32_t& __cordl_internal_get_index();

  constexpr int32_t const& __cordl_internal_get_indexChunkCount() const;

  constexpr int32_t& __cordl_internal_get_indexChunkCount();

  constexpr ::ArrayW<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo, ::Array<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo>*> const&
  __cordl_internal_get_indirectionEntryInfo() const;

  constexpr ::ArrayW<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo, ::Array<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo>*>&
  __cordl_internal_get_indirectionEntryInfo();

  constexpr int32_t const& __cordl_internal_get_minSubdiv() const;

  constexpr int32_t& __cordl_internal_get_minSubdiv();

  constexpr ::UnityEngine::Vector3Int const& __cordl_internal_get_position() const;

  constexpr ::UnityEngine::Vector3Int& __cordl_internal_get_position();

  constexpr int32_t const& __cordl_internal_get_probeCount() const;

  constexpr int32_t& __cordl_internal_get_probeCount();

  constexpr int32_t const& __cordl_internal_get_shChunkCount() const;

  constexpr int32_t& __cordl_internal_get_shChunkCount();

  constexpr void __cordl_internal_set_bricksCount(int32_t value);

  constexpr void __cordl_internal_set_index(int32_t value);

  constexpr void __cordl_internal_set_indexChunkCount(int32_t value);

  constexpr void __cordl_internal_set_indirectionEntryInfo(
      ::ArrayW<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo, ::Array<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo>*> value);

  constexpr void __cordl_internal_set_minSubdiv(int32_t value);

  constexpr void __cordl_internal_set_position(::UnityEngine::Vector3Int value);

  constexpr void __cordl_internal_set_probeCount(int32_t value);

  constexpr void __cordl_internal_set_shChunkCount(int32_t value);

  /// @brief Method .ctor, addr 0x65d7d90, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr ProbeReferenceVolume_CellDesc();

public:
  // Ctor Parameters [CppParam { name: "", ty: "ProbeReferenceVolume_CellDesc", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  ProbeReferenceVolume_CellDesc(ProbeReferenceVolume_CellDesc&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "ProbeReferenceVolume_CellDesc", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  ProbeReferenceVolume_CellDesc(ProbeReferenceVolume_CellDesc const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12065 };

  /// @brief Field position, offset: 0x10, size: 0xc, def value: None
  ::UnityEngine::Vector3Int ___position;

  /// @brief Field index, offset: 0x1c, size: 0x4, def value: None
  int32_t ___index;

  /// @brief Field probeCount, offset: 0x20, size: 0x4, def value: None
  int32_t ___probeCount;

  /// @brief Field minSubdiv, offset: 0x24, size: 0x4, def value: None
  int32_t ___minSubdiv;

  /// @brief Field indexChunkCount, offset: 0x28, size: 0x4, def value: None
  int32_t ___indexChunkCount;

  /// @brief Field shChunkCount, offset: 0x2c, size: 0x4, def value: None
  int32_t ___shChunkCount;

  /// @brief Field bricksCount, offset: 0x30, size: 0x4, def value: None
  int32_t ___bricksCount;

  /// @brief Field indirectionEntryInfo, offset: 0x38, size: 0x8, def value: None
  ::ArrayW<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo, ::Array<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo>*> ___indirectionEntryInfo;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellDesc, ___position) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellDesc, ___index) == 0x1c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellDesc, ___probeCount) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellDesc, ___minSubdiv) == 0x24, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellDesc, ___indexChunkCount) == 0x28, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellDesc, ___shChunkCount) == 0x2c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellDesc, ___bricksCount) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellDesc, ___indirectionEntryInfo) == 0x38, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::ProbeReferenceVolume_CellDesc, 0x40>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies Unity.Collections.NativeArray`1<T>
namespace UnityEngine::Rendering {
// Is value type: true
// CS Name: UnityEngine.Rendering.ProbeReferenceVolume/CellData/PerScenarioData
struct CORDL_TYPE CellData_ProbeReferenceVolume_PerScenarioData {
public:
  // Declarations
  // Ctor Parameters []
  // @brief default ctor
  constexpr CellData_ProbeReferenceVolume_PerScenarioData();

  // Ctor Parameters [CppParam { name: "shL0L1RxData", ty: "::Unity::Collections::NativeArray_1<uint16_t>", modifiers: "", def_value: None }, CppParam { name: "shL1GL1RyData", ty:
  // "::Unity::Collections::NativeArray_1<uint8_t>", modifiers: "", def_value: None }, CppParam { name: "shL1BL1RzData", ty: "::Unity::Collections::NativeArray_1<uint8_t>", modifiers: "", def_value:
  // None }, CppParam { name: "shL2Data_0", ty: "::Unity::Collections::NativeArray_1<uint8_t>", modifiers: "", def_value: None }, CppParam { name: "shL2Data_1", ty:
  // "::Unity::Collections::NativeArray_1<uint8_t>", modifiers: "", def_value: None }, CppParam { name: "shL2Data_2", ty: "::Unity::Collections::NativeArray_1<uint8_t>", modifiers: "", def_value: None
  // }, CppParam { name: "shL2Data_3", ty: "::Unity::Collections::NativeArray_1<uint8_t>", modifiers: "", def_value: None }, CppParam { name: "probeOcclusion", ty:
  // "::Unity::Collections::NativeArray_1<uint8_t>", modifiers: "", def_value: None }]
  constexpr CellData_ProbeReferenceVolume_PerScenarioData(::Unity::Collections::NativeArray_1<uint16_t> shL0L1RxData, ::Unity::Collections::NativeArray_1<uint8_t> shL1GL1RyData,
                                                          ::Unity::Collections::NativeArray_1<uint8_t> shL1BL1RzData, ::Unity::Collections::NativeArray_1<uint8_t> shL2Data_0,
                                                          ::Unity::Collections::NativeArray_1<uint8_t> shL2Data_1, ::Unity::Collections::NativeArray_1<uint8_t> shL2Data_2,
                                                          ::Unity::Collections::NativeArray_1<uint8_t> shL2Data_3, ::Unity::Collections::NativeArray_1<uint8_t> probeOcclusion) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12066 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x80 };

  /// @brief Field shL0L1RxData, offset: 0x0, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<uint16_t> shL0L1RxData;

  /// @brief Field shL1GL1RyData, offset: 0x10, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<uint8_t> shL1GL1RyData;

  /// @brief Field shL1BL1RzData, offset: 0x20, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<uint8_t> shL1BL1RzData;

  /// @brief Field shL2Data_0, offset: 0x30, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<uint8_t> shL2Data_0;

  /// @brief Field shL2Data_1, offset: 0x40, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<uint8_t> shL2Data_1;

  /// @brief Field shL2Data_2, offset: 0x50, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<uint8_t> shL2Data_2;

  /// @brief Field shL2Data_3, offset: 0x60, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<uint8_t> shL2Data_3;

  /// @brief Field probeOcclusion, offset: 0x70, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<uint8_t> probeOcclusion;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData, shL0L1RxData) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData, shL1GL1RyData) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData, shL1BL1RzData) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData, shL2Data_0) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData, shL2Data_1) == 0x40, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData, shL2Data_2) == 0x50, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData, shL2Data_3) == 0x60, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData, probeOcclusion) == 0x70, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData, 0x80>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies System.Object, Unity.Collections.NativeArray`1<T>, UnityEngine.Rendering.ProbeBrickIndex::Brick, UnityEngine.Vector3
namespace UnityEngine::Rendering {
// Is value type: false
// CS Name: UnityEngine.Rendering.ProbeReferenceVolume/CellData
class CORDL_TYPE ProbeReferenceVolume_CellData : public ::System::Object {
public:
  // Declarations
  using PerScenarioData = ::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData;

  /// @brief Field <bricks>k__BackingField, offset 0x48, size 0x10
  __declspec(property(get = __cordl_internal_get__bricks_k__BackingField,
                      put = __cordl_internal_set__bricks_k__BackingField)) ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::ProbeBrickIndex_Brick>
      _bricks_k__BackingField;

  /// @brief Field <layer>k__BackingField, offset 0x98, size 0x10
  __declspec(property(get = __cordl_internal_get__layer_k__BackingField, put = __cordl_internal_set__layer_k__BackingField)) ::Unity::Collections::NativeArray_1<uint8_t> _layer_k__BackingField;

  /// @brief Field <offsetVectors>k__BackingField, offset 0x78, size 0x10
  __declspec(property(get = __cordl_internal_get__offsetVectors_k__BackingField, put = __cordl_internal_set__offsetVectors_k__BackingField)) ::Unity::Collections::NativeArray_1<::UnityEngine::Vector3>
      _offsetVectors_k__BackingField;

  /// @brief Field <probePositions>k__BackingField, offset 0x58, size 0x10
  __declspec(property(get = __cordl_internal_get__probePositions_k__BackingField,
                      put = __cordl_internal_set__probePositions_k__BackingField)) ::Unity::Collections::NativeArray_1<::UnityEngine::Vector3>
      _probePositions_k__BackingField;

  /// @brief Field <skyOcclusionDataL0L1>k__BackingField, offset 0x20, size 0x10
  __declspec(property(get = __cordl_internal_get__skyOcclusionDataL0L1_k__BackingField, put = __cordl_internal_set__skyOcclusionDataL0L1_k__BackingField)) ::Unity::Collections::NativeArray_1<uint16_t>
      _skyOcclusionDataL0L1_k__BackingField;

  /// @brief Field <skyShadingDirectionIndices>k__BackingField, offset 0x30, size 0x10
  __declspec(property(get = __cordl_internal_get__skyShadingDirectionIndices_k__BackingField,
                      put = __cordl_internal_set__skyShadingDirectionIndices_k__BackingField)) ::Unity::Collections::NativeArray_1<uint8_t>
      _skyShadingDirectionIndices_k__BackingField;

  /// @brief Field <touchupVolumeInteraction>k__BackingField, offset 0x68, size 0x10
  __declspec(property(get = __cordl_internal_get__touchupVolumeInteraction_k__BackingField,
                      put = __cordl_internal_set__touchupVolumeInteraction_k__BackingField)) ::Unity::Collections::NativeArray_1<float_t>
      _touchupVolumeInteraction_k__BackingField;

  /// @brief Field <validity>k__BackingField, offset 0x88, size 0x10
  __declspec(property(get = __cordl_internal_get__validity_k__BackingField, put = __cordl_internal_set__validity_k__BackingField)) ::Unity::Collections::NativeArray_1<float_t>
      _validity_k__BackingField;

  __declspec(property(get = get_bricks, put = set_bricks)) ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::ProbeBrickIndex_Brick> bricks;

  __declspec(property(get = get_layer, put = set_layer)) ::Unity::Collections::NativeArray_1<uint8_t> layer;

  __declspec(property(get = get_offsetVectors, put = set_offsetVectors)) ::Unity::Collections::NativeArray_1<::UnityEngine::Vector3> offsetVectors;

  __declspec(property(get = get_probePositions, put = set_probePositions)) ::Unity::Collections::NativeArray_1<::UnityEngine::Vector3> probePositions;

  /// @brief Field scenarios, offset 0x40, size 0x8
  __declspec(property(get = __cordl_internal_get_scenarios,
                      put =
                          __cordl_internal_set_scenarios)) ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData>* scenarios;

  __declspec(property(get = get_skyOcclusionDataL0L1, put = set_skyOcclusionDataL0L1)) ::Unity::Collections::NativeArray_1<uint16_t> skyOcclusionDataL0L1;

  __declspec(property(get = get_skyShadingDirectionIndices, put = set_skyShadingDirectionIndices)) ::Unity::Collections::NativeArray_1<uint8_t> skyShadingDirectionIndices;

  __declspec(property(get = get_touchupVolumeInteraction, put = set_touchupVolumeInteraction)) ::Unity::Collections::NativeArray_1<float_t> touchupVolumeInteraction;

  __declspec(property(get = get_validity, put = set_validity)) ::Unity::Collections::NativeArray_1<float_t> validity;

  /// @brief Field validityNeighMaskData, offset 0x10, size 0x10
  __declspec(property(get = __cordl_internal_get_validityNeighMaskData, put = __cordl_internal_set_validityNeighMaskData)) ::Unity::Collections::NativeArray_1<uint8_t> validityNeighMaskData;

  /// @brief Method Cleanup, addr 0x65d7f78, size 0x3d0, virtual false, abstract: false, final false
  inline void Cleanup(bool cleanScenarioList);

  /// @brief Method CleanupPerScenarioData, addr 0x65d7e34, size 0x144, virtual false, abstract: false, final false
  inline void CleanupPerScenarioData(::ByRef<::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData> data);

  static inline ::UnityEngine::Rendering::ProbeReferenceVolume_CellData* New_ctor();

  constexpr ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::ProbeBrickIndex_Brick> const& __cordl_internal_get__bricks_k__BackingField() const;

  constexpr ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::ProbeBrickIndex_Brick>& __cordl_internal_get__bricks_k__BackingField();

  constexpr ::Unity::Collections::NativeArray_1<uint8_t> const& __cordl_internal_get__layer_k__BackingField() const;

  constexpr ::Unity::Collections::NativeArray_1<uint8_t>& __cordl_internal_get__layer_k__BackingField();

  constexpr ::Unity::Collections::NativeArray_1<::UnityEngine::Vector3> const& __cordl_internal_get__offsetVectors_k__BackingField() const;

  constexpr ::Unity::Collections::NativeArray_1<::UnityEngine::Vector3>& __cordl_internal_get__offsetVectors_k__BackingField();

  constexpr ::Unity::Collections::NativeArray_1<::UnityEngine::Vector3> const& __cordl_internal_get__probePositions_k__BackingField() const;

  constexpr ::Unity::Collections::NativeArray_1<::UnityEngine::Vector3>& __cordl_internal_get__probePositions_k__BackingField();

  constexpr ::Unity::Collections::NativeArray_1<uint16_t> const& __cordl_internal_get__skyOcclusionDataL0L1_k__BackingField() const;

  constexpr ::Unity::Collections::NativeArray_1<uint16_t>& __cordl_internal_get__skyOcclusionDataL0L1_k__BackingField();

  constexpr ::Unity::Collections::NativeArray_1<uint8_t> const& __cordl_internal_get__skyShadingDirectionIndices_k__BackingField() const;

  constexpr ::Unity::Collections::NativeArray_1<uint8_t>& __cordl_internal_get__skyShadingDirectionIndices_k__BackingField();

  constexpr ::Unity::Collections::NativeArray_1<float_t> const& __cordl_internal_get__touchupVolumeInteraction_k__BackingField() const;

  constexpr ::Unity::Collections::NativeArray_1<float_t>& __cordl_internal_get__touchupVolumeInteraction_k__BackingField();

  constexpr ::Unity::Collections::NativeArray_1<float_t> const& __cordl_internal_get__validity_k__BackingField() const;

  constexpr ::Unity::Collections::NativeArray_1<float_t>& __cordl_internal_get__validity_k__BackingField();

  constexpr ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData>* const& __cordl_internal_get_scenarios() const;

  constexpr ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData>*& __cordl_internal_get_scenarios();

  constexpr ::Unity::Collections::NativeArray_1<uint8_t> const& __cordl_internal_get_validityNeighMaskData() const;

  constexpr ::Unity::Collections::NativeArray_1<uint8_t>& __cordl_internal_get_validityNeighMaskData();

  constexpr void __cordl_internal_set__bricks_k__BackingField(::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::ProbeBrickIndex_Brick> value);

  constexpr void __cordl_internal_set__layer_k__BackingField(::Unity::Collections::NativeArray_1<uint8_t> value);

  constexpr void __cordl_internal_set__offsetVectors_k__BackingField(::Unity::Collections::NativeArray_1<::UnityEngine::Vector3> value);

  constexpr void __cordl_internal_set__probePositions_k__BackingField(::Unity::Collections::NativeArray_1<::UnityEngine::Vector3> value);

  constexpr void __cordl_internal_set__skyOcclusionDataL0L1_k__BackingField(::Unity::Collections::NativeArray_1<uint16_t> value);

  constexpr void __cordl_internal_set__skyShadingDirectionIndices_k__BackingField(::Unity::Collections::NativeArray_1<uint8_t> value);

  constexpr void __cordl_internal_set__touchupVolumeInteraction_k__BackingField(::Unity::Collections::NativeArray_1<float_t> value);

  constexpr void __cordl_internal_set__validity_k__BackingField(::Unity::Collections::NativeArray_1<float_t> value);

  constexpr void __cordl_internal_set_scenarios(::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData>* value);

  constexpr void __cordl_internal_set_validityNeighMaskData(::Unity::Collections::NativeArray_1<uint8_t> value);

  /// @brief Method .ctor, addr 0x65d8348, size 0x98, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_bricks, addr 0x65d7dbc, size 0xc, virtual false, abstract: false, final false
  inline ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::ProbeBrickIndex_Brick> get_bricks();

  /// @brief Method get_layer, addr 0x65d7e20, size 0xc, virtual false, abstract: false, final false
  inline ::Unity::Collections::NativeArray_1<uint8_t> get_layer();

  /// @brief Method get_offsetVectors, addr 0x65d7df8, size 0xc, virtual false, abstract: false, final false
  inline ::Unity::Collections::NativeArray_1<::UnityEngine::Vector3> get_offsetVectors();

  /// @brief Method get_probePositions, addr 0x65d7dd0, size 0xc, virtual false, abstract: false, final false
  inline ::Unity::Collections::NativeArray_1<::UnityEngine::Vector3> get_probePositions();

  /// @brief Method get_skyOcclusionDataL0L1, addr 0x65d7d94, size 0xc, virtual false, abstract: false, final false
  inline ::Unity::Collections::NativeArray_1<uint16_t> get_skyOcclusionDataL0L1();

  /// @brief Method get_skyShadingDirectionIndices, addr 0x65d7da8, size 0xc, virtual false, abstract: false, final false
  inline ::Unity::Collections::NativeArray_1<uint8_t> get_skyShadingDirectionIndices();

  /// @brief Method get_touchupVolumeInteraction, addr 0x65d7de4, size 0xc, virtual false, abstract: false, final false
  inline ::Unity::Collections::NativeArray_1<float_t> get_touchupVolumeInteraction();

  /// @brief Method get_validity, addr 0x65d7e0c, size 0xc, virtual false, abstract: false, final false
  inline ::Unity::Collections::NativeArray_1<float_t> get_validity();

  /// @brief Method set_bricks, addr 0x65d7dc8, size 0x8, virtual false, abstract: false, final false
  inline void set_bricks(::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::ProbeBrickIndex_Brick> value);

  /// @brief Method set_layer, addr 0x65d7e2c, size 0x8, virtual false, abstract: false, final false
  inline void set_layer(::Unity::Collections::NativeArray_1<uint8_t> value);

  /// @brief Method set_offsetVectors, addr 0x65d7e04, size 0x8, virtual false, abstract: false, final false
  inline void set_offsetVectors(::Unity::Collections::NativeArray_1<::UnityEngine::Vector3> value);

  /// @brief Method set_probePositions, addr 0x65d7ddc, size 0x8, virtual false, abstract: false, final false
  inline void set_probePositions(::Unity::Collections::NativeArray_1<::UnityEngine::Vector3> value);

  /// @brief Method set_skyOcclusionDataL0L1, addr 0x65d7da0, size 0x8, virtual false, abstract: false, final false
  inline void set_skyOcclusionDataL0L1(::Unity::Collections::NativeArray_1<uint16_t> value);

  /// @brief Method set_skyShadingDirectionIndices, addr 0x65d7db4, size 0x8, virtual false, abstract: false, final false
  inline void set_skyShadingDirectionIndices(::Unity::Collections::NativeArray_1<uint8_t> value);

  /// @brief Method set_touchupVolumeInteraction, addr 0x65d7df0, size 0x8, virtual false, abstract: false, final false
  inline void set_touchupVolumeInteraction(::Unity::Collections::NativeArray_1<float_t> value);

  /// @brief Method set_validity, addr 0x65d7e18, size 0x8, virtual false, abstract: false, final false
  inline void set_validity(::Unity::Collections::NativeArray_1<float_t> value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr ProbeReferenceVolume_CellData();

public:
  // Ctor Parameters [CppParam { name: "", ty: "ProbeReferenceVolume_CellData", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  ProbeReferenceVolume_CellData(ProbeReferenceVolume_CellData&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "ProbeReferenceVolume_CellData", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  ProbeReferenceVolume_CellData(ProbeReferenceVolume_CellData const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12067 };

  /// @brief Field validityNeighMaskData, offset: 0x10, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<uint8_t> ___validityNeighMaskData;

  /// @brief Field <skyOcclusionDataL0L1>k__BackingField, offset: 0x20, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<uint16_t> ____skyOcclusionDataL0L1_k__BackingField;

  /// @brief Field <skyShadingDirectionIndices>k__BackingField, offset: 0x30, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<uint8_t> ____skyShadingDirectionIndices_k__BackingField;

  /// @brief Field scenarios, offset: 0x40, size: 0x8, def value: None
  ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Rendering::CellData_ProbeReferenceVolume_PerScenarioData>* ___scenarios;

  /// @brief Field <bricks>k__BackingField, offset: 0x48, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::ProbeBrickIndex_Brick> ____bricks_k__BackingField;

  /// @brief Field <probePositions>k__BackingField, offset: 0x58, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Vector3> ____probePositions_k__BackingField;

  /// @brief Field <touchupVolumeInteraction>k__BackingField, offset: 0x68, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<float_t> ____touchupVolumeInteraction_k__BackingField;

  /// @brief Field <offsetVectors>k__BackingField, offset: 0x78, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<::UnityEngine::Vector3> ____offsetVectors_k__BackingField;

  /// @brief Field <validity>k__BackingField, offset: 0x88, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<float_t> ____validity_k__BackingField;

  /// @brief Field <layer>k__BackingField, offset: 0x98, size: 0x10, def value: None
  ::Unity::Collections::NativeArray_1<uint8_t> ____layer_k__BackingField;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellData, ___validityNeighMaskData) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellData, ____skyOcclusionDataL0L1_k__BackingField) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellData, ____skyShadingDirectionIndices_k__BackingField) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellData, ___scenarios) == 0x40, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellData, ____bricks_k__BackingField) == 0x48, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellData, ____probePositions_k__BackingField) == 0x58, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellData, ____touchupVolumeInteraction_k__BackingField) == 0x68, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellData, ____offsetVectors_k__BackingField) == 0x78, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellData, ____validity_k__BackingField) == 0x88, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellData, ____layer_k__BackingField) == 0x98, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::ProbeReferenceVolume_CellData, 0xa8>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies System.Object
namespace UnityEngine::Rendering {
// Is value type: false
// CS Name: UnityEngine.Rendering.ProbeReferenceVolume/CellPoolInfo
class CORDL_TYPE ProbeReferenceVolume_CellPoolInfo : public ::System::Object {
public:
  // Declarations
  /// @brief Field chunkList, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_chunkList,
                      put = __cordl_internal_set_chunkList)) ::System::Collections::Generic::List_1<::UnityEngine::Rendering::ProbeBrickPool_BrickChunkAlloc>* chunkList;

  /// @brief Field shChunkCount, offset 0x18, size 0x4
  __declspec(property(get = __cordl_internal_get_shChunkCount, put = __cordl_internal_set_shChunkCount)) int32_t shChunkCount;

  /// @brief Method Clear, addr 0x65d83e0, size 0x58, virtual false, abstract: false, final false
  inline void Clear();

  static inline ::UnityEngine::Rendering::ProbeReferenceVolume_CellPoolInfo* New_ctor();

  constexpr ::System::Collections::Generic::List_1<::UnityEngine::Rendering::ProbeBrickPool_BrickChunkAlloc>* const& __cordl_internal_get_chunkList() const;

  constexpr ::System::Collections::Generic::List_1<::UnityEngine::Rendering::ProbeBrickPool_BrickChunkAlloc>*& __cordl_internal_get_chunkList();

  constexpr int32_t const& __cordl_internal_get_shChunkCount() const;

  constexpr int32_t& __cordl_internal_get_shChunkCount();

  constexpr void __cordl_internal_set_chunkList(::System::Collections::Generic::List_1<::UnityEngine::Rendering::ProbeBrickPool_BrickChunkAlloc>* value);

  constexpr void __cordl_internal_set_shChunkCount(int32_t value);

  /// @brief Method .ctor, addr 0x65d8438, size 0x74, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr ProbeReferenceVolume_CellPoolInfo();

public:
  // Ctor Parameters [CppParam { name: "", ty: "ProbeReferenceVolume_CellPoolInfo", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  ProbeReferenceVolume_CellPoolInfo(ProbeReferenceVolume_CellPoolInfo&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "ProbeReferenceVolume_CellPoolInfo", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  ProbeReferenceVolume_CellPoolInfo(ProbeReferenceVolume_CellPoolInfo const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12068 };

  /// @brief Field chunkList, offset: 0x10, size: 0x8, def value: None
  ::System::Collections::Generic::List_1<::UnityEngine::Rendering::ProbeBrickPool_BrickChunkAlloc>* ___chunkList;

  /// @brief Field shChunkCount, offset: 0x18, size: 0x4, def value: None
  int32_t ___shChunkCount;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellPoolInfo, ___chunkList) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellPoolInfo, ___shChunkCount) == 0x18, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::ProbeReferenceVolume_CellPoolInfo, 0x20>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies System.Object, UnityEngine.Rendering.ProbeBrickIndex::CellIndexUpdateInfo
namespace UnityEngine::Rendering {
// Is value type: false
// CS Name: UnityEngine.Rendering.ProbeReferenceVolume/CellIndexInfo
class CORDL_TYPE ProbeReferenceVolume_CellIndexInfo : public ::System::Object {
public:
  // Declarations
  /// @brief Field flatIndicesInGlobalIndirection, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_flatIndicesInGlobalIndirection, put = __cordl_internal_set_flatIndicesInGlobalIndirection)) ::ArrayW<int32_t, ::Array<int32_t>*>
      flatIndicesInGlobalIndirection;

  /// @brief Field indexChunkCount, offset 0x30, size 0x4
  __declspec(property(get = __cordl_internal_get_indexChunkCount, put = __cordl_internal_set_indexChunkCount)) int32_t indexChunkCount;

  /// @brief Field indexUpdated, offset 0x20, size 0x1
  __declspec(property(get = __cordl_internal_get_indexUpdated, put = __cordl_internal_set_indexUpdated)) bool indexUpdated;

  /// @brief Field indirectionEntryInfo, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_indirectionEntryInfo,
                      put = __cordl_internal_set_indirectionEntryInfo)) ::ArrayW<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo,
                                                                                 ::Array<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo>*>
      indirectionEntryInfo;

  /// @brief Field updateInfo, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_updateInfo, put = __cordl_internal_set_updateInfo)) ::UnityEngine::Rendering::ProbeBrickIndex_CellIndexUpdateInfo updateInfo;

  /// @brief Method Clear, addr 0x65d84ac, size 0x10, virtual false, abstract: false, final false
  inline void Clear();

  static inline ::UnityEngine::Rendering::ProbeReferenceVolume_CellIndexInfo* New_ctor();

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*> const& __cordl_internal_get_flatIndicesInGlobalIndirection() const;

  constexpr ::ArrayW<int32_t, ::Array<int32_t>*>& __cordl_internal_get_flatIndicesInGlobalIndirection();

  constexpr int32_t const& __cordl_internal_get_indexChunkCount() const;

  constexpr int32_t& __cordl_internal_get_indexChunkCount();

  constexpr bool const& __cordl_internal_get_indexUpdated() const;

  constexpr bool& __cordl_internal_get_indexUpdated();

  constexpr ::ArrayW<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo, ::Array<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo>*> const&
  __cordl_internal_get_indirectionEntryInfo() const;

  constexpr ::ArrayW<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo, ::Array<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo>*>&
  __cordl_internal_get_indirectionEntryInfo();

  constexpr ::UnityEngine::Rendering::ProbeBrickIndex_CellIndexUpdateInfo const& __cordl_internal_get_updateInfo() const;

  constexpr ::UnityEngine::Rendering::ProbeBrickIndex_CellIndexUpdateInfo& __cordl_internal_get_updateInfo();

  constexpr void __cordl_internal_set_flatIndicesInGlobalIndirection(::ArrayW<int32_t, ::Array<int32_t>*> value);

  constexpr void __cordl_internal_set_indexChunkCount(int32_t value);

  constexpr void __cordl_internal_set_indexUpdated(bool value);

  constexpr void __cordl_internal_set_indirectionEntryInfo(
      ::ArrayW<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo, ::Array<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo>*> value);

  constexpr void __cordl_internal_set_updateInfo(::UnityEngine::Rendering::ProbeBrickIndex_CellIndexUpdateInfo value);

  /// @brief Method .ctor, addr 0x65d84bc, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr ProbeReferenceVolume_CellIndexInfo();

public:
  // Ctor Parameters [CppParam { name: "", ty: "ProbeReferenceVolume_CellIndexInfo", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  ProbeReferenceVolume_CellIndexInfo(ProbeReferenceVolume_CellIndexInfo&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "ProbeReferenceVolume_CellIndexInfo", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  ProbeReferenceVolume_CellIndexInfo(ProbeReferenceVolume_CellIndexInfo const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12069 };

  /// @brief Field flatIndicesInGlobalIndirection, offset: 0x10, size: 0x8, def value: None
  ::ArrayW<int32_t, ::Array<int32_t>*> ___flatIndicesInGlobalIndirection;

  /// @brief Field updateInfo, offset: 0x18, size: 0x8, def value: None
  ::UnityEngine::Rendering::ProbeBrickIndex_CellIndexUpdateInfo ___updateInfo;

  /// @brief Field indexUpdated, offset: 0x20, size: 0x1, def value: None
  bool ___indexUpdated;

  /// @brief Field indirectionEntryInfo, offset: 0x28, size: 0x8, def value: None
  ::ArrayW<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo, ::Array<::UnityEngine::Rendering::ProbeReferenceVolume_IndirectionEntryInfo>*> ___indirectionEntryInfo;

  /// @brief Field indexChunkCount, offset: 0x30, size: 0x4, def value: None
  int32_t ___indexChunkCount;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellIndexInfo, ___flatIndicesInGlobalIndirection) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellIndexInfo, ___updateInfo) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellIndexInfo, ___indexUpdated) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellIndexInfo, ___indirectionEntryInfo) == 0x28, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellIndexInfo, ___indexChunkCount) == 0x30, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::ProbeReferenceVolume_CellIndexInfo, 0x38>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies System.Object
namespace UnityEngine::Rendering {
// Is value type: false
// CS Name: UnityEngine.Rendering.ProbeReferenceVolume/CellBlendingInfo
class CORDL_TYPE ProbeReferenceVolume_CellBlendingInfo : public ::System::Object {
public:
  // Declarations
  /// @brief Field blending, offset 0x20, size 0x1
  __declspec(property(get = __cordl_internal_get_blending, put = __cordl_internal_set_blending)) bool blending;

  /// @brief Field blendingFactor, offset 0x1c, size 0x4
  __declspec(property(get = __cordl_internal_get_blendingFactor, put = __cordl_internal_set_blendingFactor)) float_t blendingFactor;

  /// @brief Field blendingScore, offset 0x18, size 0x4
  __declspec(property(get = __cordl_internal_get_blendingScore, put = __cordl_internal_set_blendingScore)) float_t blendingScore;

  /// @brief Field chunkList, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_chunkList,
                      put = __cordl_internal_set_chunkList)) ::System::Collections::Generic::List_1<::UnityEngine::Rendering::ProbeBrickPool_BrickChunkAlloc>* chunkList;

  /// @brief Method Clear, addr 0x65d8524, size 0x60, virtual false, abstract: false, final false
  inline void Clear();

  /// @brief Method ForceReupload, addr 0x65d84e4, size 0xc, virtual false, abstract: false, final false
  inline void ForceReupload();

  /// @brief Method IsUpToDate, addr 0x65d84cc, size 0x18, virtual false, abstract: false, final false
  inline bool IsUpToDate();

  /// @brief Method MarkUpToDate, addr 0x65d84c0, size 0xc, virtual false, abstract: false, final false
  inline void MarkUpToDate();

  static inline ::UnityEngine::Rendering::ProbeReferenceVolume_CellBlendingInfo* New_ctor();

  /// @brief Method Prioritize, addr 0x65d8504, size 0xc, virtual false, abstract: false, final false
  inline void Prioritize();

  /// @brief Method ShouldPrioritize, addr 0x65d8510, size 0x14, virtual false, abstract: false, final false
  inline bool ShouldPrioritize();

  /// @brief Method ShouldReupload, addr 0x65d84f0, size 0x14, virtual false, abstract: false, final false
  inline bool ShouldReupload();

  constexpr bool const& __cordl_internal_get_blending() const;

  constexpr bool& __cordl_internal_get_blending();

  constexpr float_t const& __cordl_internal_get_blendingFactor() const;

  constexpr float_t& __cordl_internal_get_blendingFactor();

  constexpr float_t const& __cordl_internal_get_blendingScore() const;

  constexpr float_t& __cordl_internal_get_blendingScore();

  constexpr ::System::Collections::Generic::List_1<::UnityEngine::Rendering::ProbeBrickPool_BrickChunkAlloc>* const& __cordl_internal_get_chunkList() const;

  constexpr ::System::Collections::Generic::List_1<::UnityEngine::Rendering::ProbeBrickPool_BrickChunkAlloc>*& __cordl_internal_get_chunkList();

  constexpr void __cordl_internal_set_blending(bool value);

  constexpr void __cordl_internal_set_blendingFactor(float_t value);

  constexpr void __cordl_internal_set_blendingScore(float_t value);

  constexpr void __cordl_internal_set_chunkList(::System::Collections::Generic::List_1<::UnityEngine::Rendering::ProbeBrickPool_BrickChunkAlloc>* value);

  /// @brief Method .ctor, addr 0x65d8584, size 0x74, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr ProbeReferenceVolume_CellBlendingInfo();

public:
  // Ctor Parameters [CppParam { name: "", ty: "ProbeReferenceVolume_CellBlendingInfo", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  ProbeReferenceVolume_CellBlendingInfo(ProbeReferenceVolume_CellBlendingInfo&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "ProbeReferenceVolume_CellBlendingInfo", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  ProbeReferenceVolume_CellBlendingInfo(ProbeReferenceVolume_CellBlendingInfo const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12070 };

  /// @brief Field chunkList, offset: 0x10, size: 0x8, def value: None
  ::System::Collections::Generic::List_1<::UnityEngine::Rendering::ProbeBrickPool_BrickChunkAlloc>* ___chunkList;

  /// @brief Field blendingScore, offset: 0x18, size: 0x4, def value: None
  float_t ___blendingScore;

  /// @brief Field blendingFactor, offset: 0x1c, size: 0x4, def value: None
  float_t ___blendingFactor;

  /// @brief Field blending, offset: 0x20, size: 0x1, def value: None
  bool ___blending;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellBlendingInfo, ___chunkList) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellBlendingInfo, ___blendingScore) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellBlendingInfo, ___blendingFactor) == 0x1c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::ProbeReferenceVolume_CellBlendingInfo, ___blending) == 0x20, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::ProbeReferenceVolume_CellBlendingInfo, 0x28>, "Size mismatch!");

} // namespace UnityEngine::Rendering
// Dependencies System.Object
namespace UnityEngine::Rendering {
// Is value type: false
// CS Name: UnityEngine.Rendering.ProbeReferenceVolume/CellStreamingInfo
class CORDL_TYPE ProbeReferenceVolume_CellStreamingInfo : public ::System::Object {
public:
  // Declarations
  /// @brief Field blendingRequest0, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_blendingRequest0, put = __cordl_internal_set_blendingRequest0)) ::UnityEngine::Rendering::ProbeReferenceVolume_CellStreamingRequest* blendingRequest0;

  /// @brief Field blendingRequest1, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_blendingRequest1, put = __cordl_internal_set_blendingRequest1)) ::UnityEngine::Rendering::ProbeReferenceVolume_CellStreamingRequest* blendingRequest1;

  /// @brief Field request, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_request, put = __cordl_internal_set_request)) ::UnityEngine::Rendering::ProbeReferenceVolume_CellStreamingRequest* request;

  /// @brief Field streamingScore, offset 0x28, size 0x4
  __declspec(property(get = __cordl_internal_get_streamingScore, put = __cordl_internal_set_streamingScore)) float_t streamingScore;

  /// @brief Method Clear, addr 0x65d8664, size 0x10, virtual false, abstract: false, final false
  inline void Clear();

  /// @brief Method IsBlendingStreaming, addr 0x65d8628, size 0x3c, virtual false, abstract: false, final false
  inline bool IsBlendingStreaming();

  /// @brief Method IsStreaming, addr 0x65d85f8, size 0x20, virtual false, abstract: false, final false
  inline bool IsStreaming();

  static inline ::UnityEngine::Rendering::ProbeReferenceVolume_CellStreamingInfo* New_ctor();

  constexpr ::UnityEngine::Rendering::ProbeReferenceVolume_CellStreamingRequest* const& __cordl_internal_get_blendingRequest0() const;

  constexpr ::UnityEngine::Rendering::ProbeReferenceVolume_CellStreamingRequest*& __cordl_internal_get_blendingRequest0();

  constexpr ::UnityEngine::Rendering::ProbeReferenceVolume_CellStreamingRequest* const& __cordl_internal_get_blendingRequest1() const;

  constexpr ::UnityEngine::Rendering::ProbeReferenceVolume_CellStreamingRequest*& __cordl_internal_get_blendingRequest1();

  constexpr ::UnityEngine::Rendering::ProbeReferenceVolume_CellStreamingRequest* const& __cordl_internal_get_request() const;

