#pragma once
// IWYU pragma private; include "Unity/Burst/BurstString.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__Attribute_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cmath>
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(BurstString)
namespace Unity::Burst {
struct BurstString_CutoffMode;
}
namespace Unity::Burst {
struct BurstString_FormatOptions;
}
namespace Unity::Burst {
struct BurstString_NumberBufferKind;
}
namespace Unity::Burst {
struct BurstString_NumberBuffer;
}
namespace Unity::Burst {
struct BurstString_NumberFormatKind;
}
namespace Unity::Burst {
class BurstString_PreserveAttribute;
}
namespace Unity::Burst {
struct BurstString_PrintFloatFormat;
}
namespace Unity::Burst {
struct BurstString_tBigInt;
}
namespace Unity::Burst {
struct BurstString_tFloatUnion32;
}
namespace Unity::Burst {
struct BurstString_tFloatUnion64;
}
namespace Unity::Burst {
struct tBigInt_BurstString__m_blocks_e__FixedBuffer;
}
// Forward declare root types
namespace Unity::Burst {
struct BurstString_CutoffMode;
}
namespace Unity::Burst {
struct BurstString_NumberBufferKind;
}
namespace Unity::Burst {
struct BurstString_NumberFormatKind;
}
namespace Unity::Burst {
struct BurstString_PrintFloatFormat;
}
namespace Unity::Burst {
class BurstString;
}
namespace Unity::Burst {
class BurstString_PreserveAttribute;
}
namespace Unity::Burst {
struct BurstString_FormatOptions;
}
namespace Unity::Burst {
struct BurstString_NumberBuffer;
}
namespace Unity::Burst {
struct BurstString_tBigInt;
}
namespace Unity::Burst {
struct BurstString_tFloatUnion32;
}
namespace Unity::Burst {
struct BurstString_tFloatUnion64;
}
namespace Unity::Burst {
struct tBigInt_BurstString__m_blocks_e__FixedBuffer;
}
// Write type traits
MARK_VAL_T(::Unity::Burst::BurstString_CutoffMode);
MARK_VAL_T(::Unity::Burst::BurstString_NumberBufferKind);
MARK_VAL_T(::Unity::Burst::BurstString_NumberFormatKind);
MARK_VAL_T(::Unity::Burst::BurstString_PrintFloatFormat);
MARK_REF_PTR_T(::Unity::Burst::BurstString);
MARK_REF_PTR_T(::Unity::Burst::BurstString_PreserveAttribute);
MARK_VAL_T(::Unity::Burst::BurstString_FormatOptions);
MARK_VAL_T(::Unity::Burst::BurstString_NumberBuffer);
MARK_VAL_T(::Unity::Burst::BurstString_tBigInt);
MARK_VAL_T(::Unity::Burst::BurstString_tFloatUnion32);
MARK_VAL_T(::Unity::Burst::BurstString_tFloatUnion64);
MARK_VAL_T(::Unity::Burst::tBigInt_BurstString__m_blocks_e__FixedBuffer);
// Dependencies System.Attribute
namespace Unity::Burst {
// Is value type: false
// CS Name: Unity.Burst.BurstString/PreserveAttribute
class CORDL_TYPE BurstString_PreserveAttribute : public ::System::Attribute {
public:
  // Declarations
  static inline ::Unity::Burst::BurstString_PreserveAttribute* New_ctor();

  /// @brief Method .ctor, addr 0x450b584, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr BurstString_PreserveAttribute();

public:
  // Ctor Parameters [CppParam { name: "", ty: "BurstString_PreserveAttribute", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  BurstString_PreserveAttribute(BurstString_PreserveAttribute&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "BurstString_PreserveAttribute", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  BurstString_PreserveAttribute(BurstString_PreserveAttribute const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 14619 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Burst::BurstString_PreserveAttribute, 0x10>, "Size mismatch!");

} // namespace Unity::Burst
// Dependencies
namespace Unity::Burst {
// Is value type: true
// CS Name: Unity.Burst.BurstString/NumberBufferKind
struct CORDL_TYPE BurstString_NumberBufferKind {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct __BurstString_NumberBufferKind_Unwrapped
  enum struct __BurstString_NumberBufferKind_Unwrapped : int32_t {
    __E_Integer = static_cast<int32_t>(0x0),
    __E_Float = static_cast<int32_t>(0x1),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __BurstString_NumberBufferKind_Unwrapped() const noexcept {
    return static_cast<__BurstString_NumberBufferKind_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr BurstString_NumberBufferKind();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr BurstString_NumberBufferKind(int32_t value__) noexcept;

  /// @brief Field Float value: I32(1)
  static ::Unity::Burst::BurstString_NumberBufferKind const Float;

  /// @brief Field Integer value: I32(0)
  static ::Unity::Burst::BurstString_NumberBufferKind const Integer;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 14620 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::Unity::Burst::BurstString_NumberBufferKind, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::Unity::Burst::BurstString_NumberBufferKind, 0x4>, "Size mismatch!");

} // namespace Unity::Burst
// Dependencies Unity.Burst.BurstString::NumberBufferKind
namespace Unity::Burst {
// Is value type: true
// CS Name: Unity.Burst.BurstString/NumberBuffer
struct CORDL_TYPE BurstString_NumberBuffer {
public:
  // Declarations
  /// @brief Method GetDigitsPointer, addr 0x450b58c, size 0x8, virtual false, abstract: false, final false
  inline ::cordl_internals::Ptr<uint8_t> GetDigitsPointer();

  /// @brief Method .ctor, addr 0x4508858, size 0x18, virtual false, abstract: false, final false
  inline void _ctor(::Unity::Burst::BurstString_NumberBufferKind kind, ::cordl_internals::Ptr<uint8_t> buffer, int32_t digitsCount, int32_t scale, bool isNegative);

  // Ctor Parameters []
  // @brief default ctor
  constexpr BurstString_NumberBuffer();

  // Ctor Parameters [CppParam { name: "_buffer", ty: "::cordl_internals::Ptr<uint8_t>", modifiers: "", def_value: None }, CppParam { name: "Kind", ty: "::Unity::Burst::BurstString_NumberBufferKind",
  // modifiers: "", def_value: None }, CppParam { name: "DigitsCount", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "Scale", ty: "int32_t", modifiers: "", def_value: None },
  // CppParam { name: "IsNegative", ty: "bool", modifiers: "", def_value: None }]
  constexpr BurstString_NumberBuffer(::cordl_internals::Ptr<uint8_t> _buffer, ::Unity::Burst::BurstString_NumberBufferKind Kind, int32_t DigitsCount, int32_t Scale, bool IsNegative) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 14621 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x18 };

  /// @brief Field _buffer, offset: 0x0, size: 0x8, def value: None
  ::cordl_internals::Ptr<uint8_t> _buffer;

  /// @brief Field Kind, offset: 0x8, size: 0x4, def value: None
  ::Unity::Burst::BurstString_NumberBufferKind Kind;

  /// @brief Field DigitsCount, offset: 0xc, size: 0x4, def value: None
  int32_t DigitsCount;

  /// @brief Field Scale, offset: 0x10, size: 0x4, def value: None
  int32_t Scale;

  /// @brief Field IsNegative, offset: 0x14, size: 0x1, def value: None
  bool IsNegative;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::Unity::Burst::BurstString_NumberBuffer, _buffer) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Burst::BurstString_NumberBuffer, Kind) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Burst::BurstString_NumberBuffer, DigitsCount) == 0xc, "Offset mismatch!");

static_assert(offsetof(::Unity::Burst::BurstString_NumberBuffer, Scale) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Unity::Burst::BurstString_NumberBuffer, IsNegative) == 0x14, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::Unity::Burst::BurstString_NumberBuffer, 0x18>, "Size mismatch!");

} // namespace Unity::Burst
// Dependencies
namespace Unity::Burst {
// Is value type: true
// CS Name: Unity.Burst.BurstString/NumberFormatKind
struct CORDL_TYPE BurstString_NumberFormatKind {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = uint8_t;

  /// @brief Nested struct __BurstString_NumberFormatKind_Unwrapped
  enum struct __BurstString_NumberFormatKind_Unwrapped : uint8_t {
    __E_General = static_cast<uint8_t>(0x0u),
    __E_Decimal = static_cast<uint8_t>(0x1u),
    __E_DecimalForceSigned = static_cast<uint8_t>(0x2u),
    __E_Hexadecimal = static_cast<uint8_t>(0x3u),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __BurstString_NumberFormatKind_Unwrapped() const noexcept {
    return static_cast<__BurstString_NumberFormatKind_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator uint8_t() const noexcept {
    return static_cast<uint8_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr BurstString_NumberFormatKind();

  // Ctor Parameters [CppParam { name: "value__", ty: "uint8_t", modifiers: "", def_value: None }]
  constexpr BurstString_NumberFormatKind(uint8_t value__) noexcept;

  /// @brief Field Decimal value: U8(1)
  static ::Unity::Burst::BurstString_NumberFormatKind const Decimal;

  /// @brief Field DecimalForceSigned value: U8(2)
  static ::Unity::Burst::BurstString_NumberFormatKind const DecimalForceSigned;

  /// @brief Field General value: U8(0)
  static ::Unity::Burst::BurstString_NumberFormatKind const General;

  /// @brief Field Hexadecimal value: U8(3)
  static ::Unity::Burst::BurstString_NumberFormatKind const Hexadecimal;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 14622 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x1 };

  /// @brief Field value__, offset: 0x0, size: 0x1, def value: None
  uint8_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::Unity::Burst::BurstString_NumberFormatKind, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::Unity::Burst::BurstString_NumberFormatKind, 0x1>, "Size mismatch!");

} // namespace Unity::Burst
// Dependencies Unity.Burst.BurstString::NumberFormatKind
namespace Unity::Burst {
// Is value type: true
// CS Name: Unity.Burst.BurstString/FormatOptions
struct CORDL_TYPE BurstString_FormatOptions {
public:
  // Declarations
  __declspec(property(get = get_Uppercase)) bool Uppercase;

  /// @brief Method EncodeToRaw, addr 0x450b594, size 0x8, virtual false, abstract: false, final false
  inline int32_t EncodeToRaw();

  /// @brief Method GetBase, addr 0x45087ec, size 0x18, virtual false, abstract: false, final false
  inline int32_t GetBase();

  /// @brief Method ToString, addr 0x450b59c, size 0x2ec, virtual true, abstract: false, final false
  inline ::StringW ToString();

  /// @brief Method .ctor, addr 0x450954c, size 0x18, virtual false, abstract: false, final false
  inline void _ctor(::Unity::Burst::BurstString_NumberFormatKind kind, int8_t alignAndSize, uint8_t specifier, bool lowercase);

  /// @brief Method get_Uppercase, addr 0x4508804, size 0x10, virtual false, abstract: false, final false
  inline bool get_Uppercase();

  // Ctor Parameters []
  // @brief default ctor
  constexpr BurstString_FormatOptions();

  // Ctor Parameters [CppParam { name: "Kind", ty: "::Unity::Burst::BurstString_NumberFormatKind", modifiers: "", def_value: None }, CppParam { name: "AlignAndSize", ty: "int8_t", modifiers: "",
  // def_value: None }, CppParam { name: "Specifier", ty: "uint8_t", modifiers: "", def_value: None }, CppParam { name: "Lowercase", ty: "bool", modifiers: "", def_value: None }]
  constexpr BurstString_FormatOptions(::Unity::Burst::BurstString_NumberFormatKind Kind, int8_t AlignAndSize, uint8_t Specifier, bool Lowercase) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 14623 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field Kind, offset: 0x0, size: 0x1, def value: None
  ::Unity::Burst::BurstString_NumberFormatKind Kind;

  /// @brief Field AlignAndSize, offset: 0x1, size: 0x1, def value: None
  int8_t AlignAndSize;

  /// @brief Field Specifier, offset: 0x2, size: 0x1, def value: None
  uint8_t Specifier;

  /// @brief Field Lowercase, offset: 0x3, size: 0x1, def value: None
  bool Lowercase;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::Unity::Burst::BurstString_FormatOptions, Kind) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Burst::BurstString_FormatOptions, AlignAndSize) == 0x1, "Offset mismatch!");

static_assert(offsetof(::Unity::Burst::BurstString_FormatOptions, Specifier) == 0x2, "Offset mismatch!");

static_assert(offsetof(::Unity::Burst::BurstString_FormatOptions, Lowercase) == 0x3, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::Unity::Burst::BurstString_FormatOptions, 0x4>, "Size mismatch!");

} // namespace Unity::Burst
// Dependencies
namespace Unity::Burst {
// Is value type: true
// CS Name: Unity.Burst.BurstString/tBigInt/<m_blocks>e__FixedBuffer
#pragma pack(push, 0)
struct CORDL_TYPE tBigInt_BurstString__m_blocks_e__FixedBuffer {
public:
  // Declarations
  // Ctor Parameters []
  // @brief default ctor
  constexpr tBigInt_BurstString__m_blocks_e__FixedBuffer();

  // Ctor Parameters [CppParam { name: "FixedElementField", ty: "uint32_t", modifiers: "", def_value: None }]
  constexpr tBigInt_BurstString__m_blocks_e__FixedBuffer(uint32_t FixedElementField) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 14624 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x8c };

  /// @brief Field FixedElementField, offset: 0x0, size: 0x4, def value: None
  uint32_t FixedElementField;

  /// @brief Size padding 0x8c - 0x4 = 0x88, packed as 0x88
  uint8_t _cordl_size_padding[0x88];

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
#pragma pack(pop)
// Non member Declarations
static_assert(offsetof(::Unity::Burst::tBigInt_BurstString__m_blocks_e__FixedBuffer, FixedElementField) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::Unity::Burst::tBigInt_BurstString__m_blocks_e__FixedBuffer, 0x8c>, "Size mismatch!");

} // namespace Unity::Burst
// Dependencies Unity.Burst.BurstString::tBigInt::<m_blocks>e__FixedBuffer
namespace Unity::Burst {
// Is value type: true
// CS Name: Unity.Burst.BurstString/tBigInt
struct CORDL_TYPE BurstString_tBigInt {
public:
  // Declarations
  using _m_blocks_e__FixedBuffer = ::Unity::Burst::tBigInt_BurstString__m_blocks_e__FixedBuffer;

  /// @brief Method GetBlock, addr 0x450abc0, size 0xc, virtual false, abstract: false, final false
  inline uint32_t GetBlock(int32_t idx);

  /// @brief Method GetLength, addr 0x450b888, size 0x8, virtual false, abstract: false, final false
  inline int32_t GetLength();

  /// @brief Method GetU32, addr 0x450b898, size 0x18, virtual false, abstract: false, final false
  inline uint32_t GetU32();

  /// @brief Method IsZero, addr 0x450abcc, size 0x10, virtual false, abstract: false, final false
  inline bool IsZero();

  /// @brief Method SetU32, addr 0x4509ed8, size 0x1c, virtual false, abstract: false, final false
  inline void SetU32(uint32_t val);

  /// @brief Method SetU64, addr 0x450ab90, size 0x30, virtual false, abstract: false, final false
  inline void SetU64(uint64_t val);

  /// @brief Method SetZero, addr 0x450b890, size 0x8, virtual false, abstract: false, final false
  inline void SetZero();

  // Ctor Parameters []
  // @brief default ctor
  constexpr BurstString_tBigInt();

  // Ctor Parameters [CppParam { name: "m_length", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "m_blocks", ty: "::Unity::Burst::tBigInt_BurstString__m_blocks_e__FixedBuffer",
  // modifiers: "", def_value: None }]
  constexpr BurstString_tBigInt(int32_t m_length, ::Unity::Burst::tBigInt_BurstString__m_blocks_e__FixedBuffer m_blocks) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 14625 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x90 };

  /// @brief Field c_BigInt_MaxBlocks offset 0xffffffff size 0x4
  static constexpr int32_t c_BigInt_MaxBlocks{ static_cast<int32_t>(0x23) };

  /// @brief Field m_length, offset: 0x0, size: 0x4, def value: None
  int32_t m_length;

  /// @brief Field m_blocks, offset: 0x4, size: 0x8c, def value: None
  ::Unity::Burst::tBigInt_BurstString__m_blocks_e__FixedBuffer m_blocks;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::Unity::Burst::BurstString_tBigInt, m_length) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Burst::BurstString_tBigInt, m_blocks) == 0x4, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::Unity::Burst::BurstString_tBigInt, 0x90>, "Size mismatch!");

} // namespace Unity::Burst
// Dependencies
namespace Unity::Burst {
// Is value type: true
// CS Name: Unity.Burst.BurstString/CutoffMode
struct CORDL_TYPE BurstString_CutoffMode {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct __BurstString_CutoffMode_Unwrapped
  enum struct __BurstString_CutoffMode_Unwrapped : int32_t {
    __E_Unique = static_cast<int32_t>(0x0),
    __E_TotalLength = static_cast<int32_t>(0x1),
    __E_FractionLength = static_cast<int32_t>(0x2),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __BurstString_CutoffMode_Unwrapped() const noexcept {
    return static_cast<__BurstString_CutoffMode_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr BurstString_CutoffMode();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr BurstString_CutoffMode(int32_t value__) noexcept;

  /// @brief Field FractionLength value: I32(2)
  static ::Unity::Burst::BurstString_CutoffMode const FractionLength;

  /// @brief Field TotalLength value: I32(1)
  static ::Unity::Burst::BurstString_CutoffMode const TotalLength;

  /// @brief Field Unique value: I32(0)
  static ::Unity::Burst::BurstString_CutoffMode const Unique;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 14626 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::Unity::Burst::BurstString_CutoffMode, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::Unity::Burst::BurstString_CutoffMode, 0x4>, "Size mismatch!");

} // namespace Unity::Burst
// Dependencies
namespace Unity::Burst {
// Is value type: true
// CS Name: Unity.Burst.BurstString/PrintFloatFormat
struct CORDL_TYPE BurstString_PrintFloatFormat {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct __BurstString_PrintFloatFormat_Unwrapped
  enum struct __BurstString_PrintFloatFormat_Unwrapped : int32_t {
    __E_Positional = static_cast<int32_t>(0x0),
    __E_Scientific = static_cast<int32_t>(0x1),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __BurstString_PrintFloatFormat_Unwrapped() const noexcept {
    return static_cast<__BurstString_PrintFloatFormat_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr BurstString_PrintFloatFormat();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr BurstString_PrintFloatFormat(int32_t value__) noexcept;

  /// @brief Field Positional value: I32(0)
  static ::Unity::Burst::BurstString_PrintFloatFormat const Positional;

  /// @brief Field Scientific value: I32(1)
  static ::Unity::Burst::BurstString_PrintFloatFormat const Scientific;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 14627 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::Unity::Burst::BurstString_PrintFloatFormat, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::Unity::Burst::BurstString_PrintFloatFormat, 0x4>, "Size mismatch!");

} // namespace Unity::Burst
// Dependencies
namespace Unity::Burst {
// Is value type: true
// CS Name: Unity.Burst.BurstString/tFloatUnion32
struct CORDL_TYPE BurstString_tFloatUnion32 {
public:
  // Declarations
  /// @brief Field m_floatingPoint, offset 0x0, size 0x4
  __declspec(property(get = __cordl_internal_get_m_floatingPoint, put = __cordl_internal_set_m_floatingPoint)) float_t m_floatingPoint;

  /// @brief Field m_integer, offset 0x0, size 0x4
  __declspec(property(get = __cordl_internal_get_m_integer, put = __cordl_internal_set_m_integer)) uint32_t m_integer;

  /// @brief Method GetExponent, addr 0x450b390, size 0xc, virtual false, abstract: false, final false
  inline uint32_t GetExponent();

