#pragma once
// IWYU pragma private; include "Unity/Burst/BurstString.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__Attribute_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "Unity/Burst/zzzz__BurstString_def.hpp"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cmath>
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(BurstString)
namespace GlobalNamespace {
struct __BurstString__tBigInt___m_blocks_e__FixedBuffer;
}
namespace Unity::Burst {
struct __BurstString__CutoffMode;
}
namespace Unity::Burst {
struct __BurstString__FormatOptions;
}
namespace Unity::Burst {
struct __BurstString__NumberBufferKind;
}
namespace Unity::Burst {
struct __BurstString__NumberBuffer;
}
namespace Unity::Burst {
struct __BurstString__NumberFormatKind;
}
namespace Unity::Burst {
class __BurstString__PreserveAttribute;
}
namespace Unity::Burst {
struct __BurstString__PrintFloatFormat;
}
namespace Unity::Burst {
struct __BurstString__tBigInt;
}
namespace Unity::Burst {
struct __BurstString__tFloatUnion32;
}
namespace Unity::Burst {
struct __BurstString__tFloatUnion64;
}
// Forward declare root types
namespace Unity::Burst {
struct __BurstString__CutoffMode;
}
namespace Unity::Burst {
struct __BurstString__NumberBufferKind;
}
namespace Unity::Burst {
struct __BurstString__NumberFormatKind;
}
namespace Unity::Burst {
struct __BurstString__PrintFloatFormat;
}
namespace Unity::Burst {
class BurstString;
}
namespace Unity::Burst {
class __BurstString__PreserveAttribute;
}
namespace GlobalNamespace {
struct __BurstString__tBigInt___m_blocks_e__FixedBuffer;
}
namespace Unity::Burst {
struct __BurstString__FormatOptions;
}
namespace Unity::Burst {
struct __BurstString__NumberBuffer;
}
namespace Unity::Burst {
struct __BurstString__tBigInt;
}
namespace Unity::Burst {
struct __BurstString__tFloatUnion32;
}
namespace Unity::Burst {
struct __BurstString__tFloatUnion64;
}
// Write type traits
MARK_VAL_T(::Unity::Burst::__BurstString__CutoffMode);
MARK_VAL_T(::Unity::Burst::__BurstString__NumberBufferKind);
MARK_VAL_T(::Unity::Burst::__BurstString__NumberFormatKind);
MARK_VAL_T(::Unity::Burst::__BurstString__PrintFloatFormat);
MARK_REF_PTR_T(::Unity::Burst::BurstString);
MARK_REF_PTR_T(::Unity::Burst::__BurstString__PreserveAttribute);
MARK_VAL_T(::GlobalNamespace::__BurstString__tBigInt___m_blocks_e__FixedBuffer);
MARK_VAL_T(::Unity::Burst::__BurstString__FormatOptions);
MARK_VAL_T(::Unity::Burst::__BurstString__NumberBuffer);
MARK_VAL_T(::Unity::Burst::__BurstString__tBigInt);
MARK_VAL_T(::Unity::Burst::__BurstString__tFloatUnion32);
MARK_VAL_T(::Unity::Burst::__BurstString__tFloatUnion64);
// Type: ::PreserveAttribute
// SizeInfo { instance_size: 16, native_size: -1, calculated_instance_size: 16, calculated_native_size: 16, minimum_alignment: 8, natural_alignment: 0, packing: None, specified_packing: None }
namespace Unity::Burst {
// Is value type: false
// CS Name: ::BurstString::PreserveAttribute*
class CORDL_TYPE __BurstString__PreserveAttribute : public ::System::Attribute {
public:
  // Declarations
  static inline ::Unity::Burst::__BurstString__PreserveAttribute* New_ctor();

  /// @brief Method .ctor, addr 0x30711dc, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __BurstString__PreserveAttribute();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__BurstString__PreserveAttribute", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __BurstString__PreserveAttribute(__BurstString__PreserveAttribute&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__BurstString__PreserveAttribute", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __BurstString__PreserveAttribute(__BurstString__PreserveAttribute const&) = delete;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Burst::__BurstString__PreserveAttribute, 0x10>, "Size mismatch!");

} // namespace Unity::Burst
// Type: ::NumberBufferKind
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace Unity::Burst {
// Is value type: true
// CS Name: ::BurstString::NumberBufferKind
struct CORDL_TYPE __BurstString__NumberBufferKind {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____BurstString__NumberBufferKind_Unwrapped
  enum struct ____BurstString__NumberBufferKind_Unwrapped : int32_t {
    __E_Integer = static_cast<int32_t>(0x0),
    __E_Float = static_cast<int32_t>(0x1),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____BurstString__NumberBufferKind_Unwrapped() const noexcept {
    return static_cast<____BurstString__NumberBufferKind_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __BurstString__NumberBufferKind();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __BurstString__NumberBufferKind(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field Float value: static_cast<int32_t>(0x1)
  static ::Unity::Burst::__BurstString__NumberBufferKind const Float;

  /// @brief Field Integer value: static_cast<int32_t>(0x0)
  static ::Unity::Burst::__BurstString__NumberBufferKind const Integer;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Burst::__BurstString__NumberBufferKind, 0x4>, "Size mismatch!");

static_assert(offsetof(::Unity::Burst::__BurstString__NumberBufferKind, value__) == 0x0, "Offset mismatch!");

} // namespace Unity::Burst
// Type: ::NumberBuffer
// SizeInfo { instance_size: 24, native_size: 24, calculated_instance_size: 24, calculated_native_size: 37, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace Unity::Burst {
// Is value type: true
// CS Name: ::BurstString::NumberBuffer
struct CORDL_TYPE __BurstString__NumberBuffer {
public:
  // Declarations
  /// @brief Method GetDigitsPointer, addr 0x30711e4, size 0x8, virtual false, abstract: false, final false
  inline ::cordl_internals::Ptr<uint8_t> GetDigitsPointer();

  /// @brief Method .ctor, addr 0x306e58c, size 0x18, virtual false, abstract: false, final false
  inline void _ctor(::Unity::Burst::__BurstString__NumberBufferKind kind, ::cordl_internals::Ptr<uint8_t> buffer, int32_t digitsCount, int32_t scale, bool isNegative);

  // Ctor Parameters []
  // @brief default ctor
  constexpr __BurstString__NumberBuffer();

  // Ctor Parameters [CppParam { name: "_buffer", ty: "::cordl_internals::Ptr<uint8_t>", modifiers: "", def_value: None }, CppParam { name: "Kind", ty:
  // "::Unity::Burst::__BurstString__NumberBufferKind", modifiers: "", def_value: None }, CppParam { name: "DigitsCount", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "Scale", ty:
  // "int32_t", modifiers: "", def_value: None }, CppParam { name: "IsNegative", ty: "bool", modifiers: "", def_value: None }]
  constexpr __BurstString__NumberBuffer(::cordl_internals::Ptr<uint8_t> _buffer, ::Unity::Burst::__BurstString__NumberBufferKind Kind, int32_t DigitsCount, int32_t Scale, bool IsNegative) noexcept;

  /// @brief Field _buffer, offset: 0x0, size: 0x8, def value: None
  ::cordl_internals::Ptr<uint8_t> _buffer;

  /// @brief Field Kind, offset: 0x8, size: 0x4, def value: None
  ::Unity::Burst::__BurstString__NumberBufferKind Kind;

  /// @brief Field DigitsCount, offset: 0xc, size: 0x4, def value: None
  int32_t DigitsCount;

  /// @brief Field Scale, offset: 0x10, size: 0x4, def value: None
  int32_t Scale;

  /// @brief Field IsNegative, offset: 0x14, size: 0x1, def value: None
  bool IsNegative;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x18 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Burst::__BurstString__NumberBuffer, 0x18>, "Size mismatch!");

static_assert(offsetof(::Unity::Burst::__BurstString__NumberBuffer, _buffer) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Burst::__BurstString__NumberBuffer, Kind) == 0x8, "Offset mismatch!");

static_assert(offsetof(::Unity::Burst::__BurstString__NumberBuffer, DigitsCount) == 0xc, "Offset mismatch!");

static_assert(offsetof(::Unity::Burst::__BurstString__NumberBuffer, Scale) == 0x10, "Offset mismatch!");

static_assert(offsetof(::Unity::Burst::__BurstString__NumberBuffer, IsNegative) == 0x14, "Offset mismatch!");

} // namespace Unity::Burst
// Type: ::NumberFormatKind
// SizeInfo { instance_size: 1, native_size: 1, calculated_instance_size: 1, calculated_native_size: 17, minimum_alignment: 1, natural_alignment: 1, packing: None, specified_packing: None }
namespace Unity::Burst {
// Is value type: true
// CS Name: ::BurstString::NumberFormatKind
struct CORDL_TYPE __BurstString__NumberFormatKind {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = uint8_t;

  /// @brief Nested struct ____BurstString__NumberFormatKind_Unwrapped
  enum struct ____BurstString__NumberFormatKind_Unwrapped : uint8_t {
    __E_General = static_cast<uint8_t>(0x0u),
    __E_Decimal = static_cast<uint8_t>(0x1u),
    __E_DecimalForceSigned = static_cast<uint8_t>(0x2u),
    __E_Hexadecimal = static_cast<uint8_t>(0x3u),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____BurstString__NumberFormatKind_Unwrapped() const noexcept {
    return static_cast<____BurstString__NumberFormatKind_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator uint8_t() const noexcept {
    return static_cast<uint8_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __BurstString__NumberFormatKind();

  // Ctor Parameters [CppParam { name: "value__", ty: "uint8_t", modifiers: "", def_value: None }]
  constexpr __BurstString__NumberFormatKind(uint8_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x1, def value: None
  uint8_t value__;

  /// @brief Field Decimal value: static_cast<uint8_t>(0x1u)
  static ::Unity::Burst::__BurstString__NumberFormatKind const Decimal;

  /// @brief Field DecimalForceSigned value: static_cast<uint8_t>(0x2u)
  static ::Unity::Burst::__BurstString__NumberFormatKind const DecimalForceSigned;

  /// @brief Field General value: static_cast<uint8_t>(0x0u)
  static ::Unity::Burst::__BurstString__NumberFormatKind const General;

  /// @brief Field Hexadecimal value: static_cast<uint8_t>(0x3u)
  static ::Unity::Burst::__BurstString__NumberFormatKind const Hexadecimal;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x1 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Burst::__BurstString__NumberFormatKind, 0x1>, "Size mismatch!");

static_assert(offsetof(::Unity::Burst::__BurstString__NumberFormatKind, value__) == 0x0, "Offset mismatch!");

} // namespace Unity::Burst
// Type: ::FormatOptions
// SizeInfo { instance_size: 4, native_size: 8, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 1, natural_alignment: 1, packing: None, specified_packing: None }
namespace Unity::Burst {
// Is value type: true
// CS Name: ::BurstString::FormatOptions
struct CORDL_TYPE __BurstString__FormatOptions {
public:
  // Declarations
  __declspec(property(get = get_Uppercase)) bool Uppercase;

  /// @brief Method EncodeToRaw, addr 0x30711ec, size 0x8, virtual false, abstract: false, final false
  inline int32_t EncodeToRaw();

  /// @brief Method GetBase, addr 0x306e520, size 0x18, virtual false, abstract: false, final false
  inline int32_t GetBase();

  /// @brief Method ToString, addr 0x30711f4, size 0x2ec, virtual true, abstract: false, final false
  inline ::StringW ToString();

  /// @brief Method .ctor, addr 0x306f2ec, size 0x18, virtual false, abstract: false, final false
  inline void _ctor(::Unity::Burst::__BurstString__NumberFormatKind kind, int8_t alignAndSize, uint8_t specifier, bool lowercase);

  /// @brief Method get_Uppercase, addr 0x306e538, size 0x10, virtual false, abstract: false, final false
  inline bool get_Uppercase();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __BurstString__FormatOptions();

  // Ctor Parameters [CppParam { name: "Kind", ty: "::Unity::Burst::__BurstString__NumberFormatKind", modifiers: "", def_value: None }, CppParam { name: "AlignAndSize", ty: "int8_t", modifiers: "",
  // def_value: None }, CppParam { name: "Specifier", ty: "uint8_t", modifiers: "", def_value: None }, CppParam { name: "Lowercase", ty: "bool", modifiers: "", def_value: None }]
  constexpr __BurstString__FormatOptions(::Unity::Burst::__BurstString__NumberFormatKind Kind, int8_t AlignAndSize, uint8_t Specifier, bool Lowercase) noexcept;

  /// @brief Field Kind, offset: 0x0, size: 0x1, def value: None
  ::Unity::Burst::__BurstString__NumberFormatKind Kind;

  /// @brief Field AlignAndSize, offset: 0x1, size: 0x1, def value: None
  int8_t AlignAndSize;

  /// @brief Field Specifier, offset: 0x2, size: 0x1, def value: None
  uint8_t Specifier;

  /// @brief Field Lowercase, offset: 0x3, size: 0x1, def value: None
  bool Lowercase;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Burst::__BurstString__FormatOptions, 0x4>, "Size mismatch!");

static_assert(offsetof(::Unity::Burst::__BurstString__FormatOptions, Kind) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Burst::__BurstString__FormatOptions, AlignAndSize) == 0x1, "Offset mismatch!");

static_assert(offsetof(::Unity::Burst::__BurstString__FormatOptions, Specifier) == 0x2, "Offset mismatch!");

static_assert(offsetof(::Unity::Burst::__BurstString__FormatOptions, Lowercase) == 0x3, "Offset mismatch!");

} // namespace Unity::Burst
// Type: ::<m_blocks>e__FixedBuffer
// SizeInfo { instance_size: 140, native_size: 140, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: Some(0) }
namespace GlobalNamespace {
// Is value type: true
// CS Name: ::BurstString::tBigInt::<m_blocks>e__FixedBuffer
#pragma pack(push, 0)
struct CORDL_TYPE __BurstString__tBigInt___m_blocks_e__FixedBuffer {
public:
  // Declarations
  // Ctor Parameters []
  // @brief default ctor
  constexpr __BurstString__tBigInt___m_blocks_e__FixedBuffer();

  // Ctor Parameters [CppParam { name: "FixedElementField", ty: "uint32_t", modifiers: "", def_value: None }]
  constexpr __BurstString__tBigInt___m_blocks_e__FixedBuffer(uint32_t FixedElementField) noexcept;

  /// @brief Field FixedElementField, offset: 0x0, size: 0x4, def value: None
  uint32_t FixedElementField;

  /// @brief Size padding 0x8c - 0x4 = 0x88, packed as 0x88
  uint8_t _cordl_size_padding[0x88];

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x8c };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
#pragma pack(pop)
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__BurstString__tBigInt___m_blocks_e__FixedBuffer, 0x8c>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__BurstString__tBigInt___m_blocks_e__FixedBuffer, FixedElementField) == 0x0, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::tBigInt
// SizeInfo { instance_size: 144, native_size: 144, calculated_instance_size: 144, calculated_native_size: 160, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace Unity::Burst {
// Is value type: true
// CS Name: ::BurstString::tBigInt
struct CORDL_TYPE __BurstString__tBigInt {
public:
  // Declarations
  using _m_blocks_e__FixedBuffer = ::GlobalNamespace::__BurstString__tBigInt___m_blocks_e__FixedBuffer;

  /// @brief Method GetBlock, addr 0x3070918, size 0xc, virtual false, abstract: false, final false
  inline uint32_t GetBlock(int32_t idx);

  /// @brief Method GetLength, addr 0x30714e0, size 0x8, virtual false, abstract: false, final false
  inline int32_t GetLength();

  /// @brief Method GetU32, addr 0x30714f0, size 0x18, virtual false, abstract: false, final false
  inline uint32_t GetU32();

  /// @brief Method IsZero, addr 0x3070924, size 0x10, virtual false, abstract: false, final false
  inline bool IsZero();

  /// @brief Method SetU32, addr 0x306fc0c, size 0x1c, virtual false, abstract: false, final false
  inline void SetU32(uint32_t val);

  /// @brief Method SetU64, addr 0x30708e8, size 0x30, virtual false, abstract: false, final false
  inline void SetU64(uint64_t val);

  /// @brief Method SetZero, addr 0x30714e8, size 0x8, virtual false, abstract: false, final false
  inline void SetZero();

  // Ctor Parameters []
  // @brief default ctor
  constexpr __BurstString__tBigInt();

  // Ctor Parameters [CppParam { name: "m_length", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "m_blocks", ty:
  // "::GlobalNamespace::__BurstString__tBigInt___m_blocks_e__FixedBuffer", modifiers: "", def_value: None }]
  constexpr __BurstString__tBigInt(int32_t m_length, ::GlobalNamespace::__BurstString__tBigInt___m_blocks_e__FixedBuffer m_blocks) noexcept;

  /// @brief Field m_length, offset: 0x0, size: 0x4, def value: None
  int32_t m_length;

  /// @brief Field m_blocks, offset: 0x4, size: 0x8c, def value: None
  ::GlobalNamespace::__BurstString__tBigInt___m_blocks_e__FixedBuffer m_blocks;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x90 };

  /// @brief Field c_BigInt_MaxBlocks offset 0xffffffff size 0x4
  static constexpr int32_t c_BigInt_MaxBlocks{ static_cast<int32_t>(0x23) };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Burst::__BurstString__tBigInt, 0x90>, "Size mismatch!");

static_assert(offsetof(::Unity::Burst::__BurstString__tBigInt, m_length) == 0x0, "Offset mismatch!");

static_assert(offsetof(::Unity::Burst::__BurstString__tBigInt, m_blocks) == 0x4, "Offset mismatch!");

} // namespace Unity::Burst
// Type: ::CutoffMode
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace Unity::Burst {
// Is value type: true
// CS Name: ::BurstString::CutoffMode
struct CORDL_TYPE __BurstString__CutoffMode {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____BurstString__CutoffMode_Unwrapped
  enum struct ____BurstString__CutoffMode_Unwrapped : int32_t {
    __E_Unique = static_cast<int32_t>(0x0),
    __E_TotalLength = static_cast<int32_t>(0x1),
    __E_FractionLength = static_cast<int32_t>(0x2),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____BurstString__CutoffMode_Unwrapped() const noexcept {
    return static_cast<____BurstString__CutoffMode_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __BurstString__CutoffMode();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __BurstString__CutoffMode(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field FractionLength value: static_cast<int32_t>(0x2)
  static ::Unity::Burst::__BurstString__CutoffMode const FractionLength;

  /// @brief Field TotalLength value: static_cast<int32_t>(0x1)
  static ::Unity::Burst::__BurstString__CutoffMode const TotalLength;

  /// @brief Field Unique value: static_cast<int32_t>(0x0)
  static ::Unity::Burst::__BurstString__CutoffMode const Unique;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Burst::__BurstString__CutoffMode, 0x4>, "Size mismatch!");

static_assert(offsetof(::Unity::Burst::__BurstString__CutoffMode, value__) == 0x0, "Offset mismatch!");

} // namespace Unity::Burst
// Type: ::PrintFloatFormat
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, natural_alignment: 4, packing: None, specified_packing: None }
namespace Unity::Burst {
// Is value type: true
// CS Name: ::BurstString::PrintFloatFormat
struct CORDL_TYPE __BurstString__PrintFloatFormat {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____BurstString__PrintFloatFormat_Unwrapped
  enum struct ____BurstString__PrintFloatFormat_Unwrapped : int32_t {
    __E_Positional = static_cast<int32_t>(0x0),
    __E_Scientific = static_cast<int32_t>(0x1),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____BurstString__PrintFloatFormat_Unwrapped() const noexcept {
    return static_cast<____BurstString__PrintFloatFormat_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __BurstString__PrintFloatFormat();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __BurstString__PrintFloatFormat(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field Positional value: static_cast<int32_t>(0x0)
  static ::Unity::Burst::__BurstString__PrintFloatFormat const Positional;

  /// @brief Field Scientific value: static_cast<int32_t>(0x1)
  static ::Unity::Burst::__BurstString__PrintFloatFormat const Scientific;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::Unity::Burst::__BurstString__PrintFloatFormat, 0x4>, "Size mismatch!");

static_assert(offsetof(::Unity::Burst::__BurstString__PrintFloatFormat, value__) == 0x0, "Offset mismatch!");

} // namespace Unity::Burst
// Type: ::tFloatUnion32
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 1, natural_alignment: 4, packing: Some(1), specified_packing: None }
namespace Unity::Burst {
// Is value type: true
// CS Name: ::BurstString::tFloatUnion32
struct CORDL_TYPE __BurstString__tFloatUnion32 {
public:
  // Declarations
  /// @brief Field m_floatingPoint, offset 0x0, size 0x4
  __declspec(property(get = __cordl_internal_get_m_floatingPoint, put = __cordl_internal_set_m_floatingPoint)) float_t m_floatingPoint;

  /// @brief Field m_integer, offset 0x0, size 0x4
  __declspec(property(get = __cordl_internal_get_m_integer, put = __cordl_internal_set_m_integer)) uint32_t m_integer;

  /// @brief Method GetExponent, addr 0x3070fe8, size 0xc, virtual false, abstract: false, final false
