#pragma once
// IWYU pragma private; include "UnityEngine/InputSystem/Layouts/InputControlLayout.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__Exception_def.hpp"
#include "System/zzzz__Nullable_1_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "UnityEngine/InputSystem/Layouts/zzzz__InputControlLayout_def.hpp"
#include "UnityEngine/InputSystem/Layouts/zzzz__InputDeviceMatcher_def.hpp"
#include "UnityEngine/InputSystem/Utilities/zzzz__FourCC_def.hpp"
#include "UnityEngine/InputSystem/Utilities/zzzz__InlinedArray_1_def.hpp"
#include "UnityEngine/InputSystem/Utilities/zzzz__InternedString_def.hpp"
#include "UnityEngine/InputSystem/Utilities/zzzz__NameAndParameters_def.hpp"
#include "UnityEngine/InputSystem/Utilities/zzzz__NamedValue_def.hpp"
#include "UnityEngine/InputSystem/Utilities/zzzz__PrimitiveValue_def.hpp"
#include "UnityEngine/InputSystem/Utilities/zzzz__ReadOnlyArray_1_def.hpp"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cmath>
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(InputControlLayout)
namespace GlobalNamespace {
struct __InputControlLayout__Builder__ControlBuilder;
}
namespace GlobalNamespace {
class __InputControlLayout__Builder__ControlBuilder____c;
}
namespace GlobalNamespace {

class __InputControlLayout__ControlItemJson;
}
namespace UnityEngine::InputSystem::Layouts {
class __InputControlLayout__LayoutNotFoundException;
}
namespace UnityEngine::InputSystem::Layouts {
class __InputControlLayout____c;
}
namespace GlobalNamespace {
struct __InputControlLayout__Builder__ControlBuilder;
}
namespace GlobalNamespace {
struct __InputControlLayout__Collection__LayoutMatcher;
}
namespace GlobalNamespace {
struct __InputControlLayout__Collection__PrecompiledLayout;
}
namespace UnityEngine::InputSystem::Layouts {
struct __InputControlLayout__Cache;
}
namespace UnityEngine::InputSystem::Layouts {
struct __InputControlLayout__CacheRefInstance;
}
namespace UnityEngine::InputSystem::Layouts {
struct __InputControlLayout__Collection;
}
namespace UnityEngine::InputSystem::Layouts {
struct __InputControlLayout__ControlItem;
}
namespace UnityEngine::InputSystem::Layouts {
struct __InputControlLayout__LayoutJson;
}
namespace UnityEngine::InputSystem::Layouts {
struct __InputControlLayout__LayoutJsonNameAndDescriptorOnly;
}
// Write type traits
MARK_VAL_T(::GlobalNamespace::__InputControlLayout__ControlItem__Flags);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::__InputControlLayout__Flags);
MARK_REF_PTR_T(::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder____c);
MARK_REF_PTR_T(::GlobalNamespace::__InputControlLayout__Collection___GetBaseLayouts_d__24);
MARK_REF_PTR_T(::GlobalNamespace::__InputControlLayout__ControlItemJson____c);
MARK_REF_PTR_T(::GlobalNamespace::__InputControlLayout__LayoutJson____c);
MARK_REF_PTR_T(::UnityEngine::InputSystem::Layouts::InputControlLayout);
MARK_REF_PTR_T(::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder);
MARK_REF_PTR_T(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItemJson);
MARK_REF_PTR_T(::UnityEngine::InputSystem::Layouts::__InputControlLayout__LayoutNotFoundException);
MARK_REF_PTR_T(::UnityEngine::InputSystem::Layouts::__InputControlLayout____c);
MARK_VAL_T(::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder);
MARK_VAL_T(::GlobalNamespace::__InputControlLayout__Collection__LayoutMatcher);
MARK_VAL_T(::GlobalNamespace::__InputControlLayout__Collection__PrecompiledLayout);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::__InputControlLayout__Cache);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::__InputControlLayout__CacheRefInstance);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::__InputControlLayout__Collection);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::__InputControlLayout__LayoutJson);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::__InputControlLayout__LayoutJsonNameAndDescriptorOnly);
// Type: ::Flags
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: true
// CS Name: ::InputControlLayout::ControlItem::Flags
struct CORDL_TYPE __InputControlLayout__ControlItem__Flags {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____InputControlLayout__ControlItem__Flags_Unwrapped
  enum struct ____InputControlLayout__ControlItem__Flags_Unwrapped : int32_t {
    __E_isModifyingExistingControl = static_cast<int32_t>(0x1),
    __E_IsNoisy = static_cast<int32_t>(0x2),
    __E_IsSynthetic = static_cast<int32_t>(0x4),
    __E_IsFirstDefinedInThisLayout = static_cast<int32_t>(0x8),
    __E_DontReset = static_cast<int32_t>(0x10),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____InputControlLayout__ControlItem__Flags_Unwrapped() const noexcept {
    return static_cast<____InputControlLayout__ControlItem__Flags_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __InputControlLayout__ControlItem__Flags();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __InputControlLayout__ControlItem__Flags(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field DontReset value: static_cast<int32_t>(0x10)
  static ::GlobalNamespace::__InputControlLayout__ControlItem__Flags const DontReset;

  /// @brief Field IsFirstDefinedInThisLayout value: static_cast<int32_t>(0x8)
  static ::GlobalNamespace::__InputControlLayout__ControlItem__Flags const IsFirstDefinedInThisLayout;

  /// @brief Field IsNoisy value: static_cast<int32_t>(0x2)
  static ::GlobalNamespace::__InputControlLayout__ControlItem__Flags const IsNoisy;

  /// @brief Field IsSynthetic value: static_cast<int32_t>(0x4)
  static ::GlobalNamespace::__InputControlLayout__ControlItem__Flags const IsSynthetic;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 6971 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field isModifyingExistingControl value: static_cast<int32_t>(0x1)
  static ::GlobalNamespace::__InputControlLayout__ControlItem__Flags const isModifyingExistingControl;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__InputControlLayout__ControlItem__Flags, 0x4>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__InputControlLayout__ControlItem__Flags, value__) == 0x0, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::ControlItem
// SizeInfo { instance_size: 208, native_size: -1, calculated_instance_size: 208, calculated_native_size: 224, minimum_alignment: 8, packing: None, specified_packing: None }
namespace UnityEngine::InputSystem::Layouts {
// Is value type: true
// CS Name: ::InputControlLayout::ControlItem
struct CORDL_TYPE __InputControlLayout__ControlItem {
public:
  // Declarations
  using Flags = ::GlobalNamespace::__InputControlLayout__ControlItem__Flags;

  __declspec(property(get = get_aliases, put = set_aliases)) ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> aliases;

  __declspec(property(get = get_arraySize, put = set_arraySize)) int32_t arraySize;

  __declspec(property(get = get_bit, put = set_bit)) uint32_t bit;

  __declspec(property(get = get_defaultState, put = set_defaultState)) ::UnityEngine::InputSystem::Utilities::PrimitiveValue defaultState;

  __declspec(property(get = get_displayName, put = set_displayName)) ::StringW displayName;

  __declspec(property(get = get_dontReset, put = set_dontReset)) bool dontReset;

  __declspec(property(get = get_flags, put = set_flags)) ::GlobalNamespace::__InputControlLayout__ControlItem__Flags flags;

  __declspec(property(get = get_format, put = set_format)) ::UnityEngine::InputSystem::Utilities::FourCC format;

  __declspec(property(get = get_isArray)) bool isArray;

  __declspec(property(get = get_isFirstDefinedInThisLayout, put = set_isFirstDefinedInThisLayout)) bool isFirstDefinedInThisLayout;

  __declspec(property(get = get_isModifyingExistingControl, put = set_isModifyingExistingControl)) bool isModifyingExistingControl;

  __declspec(property(get = get_isNoisy, put = set_isNoisy)) bool isNoisy;

  __declspec(property(get = get_isSynthetic, put = set_isSynthetic)) bool isSynthetic;

  __declspec(property(get = get_layout, put = set_layout)) ::UnityEngine::InputSystem::Utilities::InternedString layout;

  __declspec(property(get = get_maxValue, put = set_maxValue)) ::UnityEngine::InputSystem::Utilities::PrimitiveValue maxValue;

  __declspec(property(get = get_minValue, put = set_minValue)) ::UnityEngine::InputSystem::Utilities::PrimitiveValue minValue;

  __declspec(property(get = get_name, put = set_name)) ::UnityEngine::InputSystem::Utilities::InternedString name;

  __declspec(property(get = get_offset, put = set_offset)) uint32_t offset;

  __declspec(property(get = get_parameters, put = set_parameters)) ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue> parameters;

  __declspec(property(get = get_processors, put = set_processors)) ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters> processors;

  __declspec(property(get = get_shortDisplayName, put = set_shortDisplayName)) ::StringW shortDisplayName;

  __declspec(property(get = get_sizeInBits, put = set_sizeInBits)) uint32_t sizeInBits;

  __declspec(property(get = get_usages, put = set_usages)) ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> usages;

  __declspec(property(get = get_useStateFrom, put = set_useStateFrom)) ::StringW useStateFrom;

  __declspec(property(get = get_variants, put = set_variants)) ::UnityEngine::InputSystem::Utilities::InternedString variants;

  /// @brief Method Merge, addr 0x45a73d0, size 0x39c, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem Merge(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem other);

  /// @brief Method get_aliases, addr 0x45a7cac, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> get_aliases();

  /// @brief Method get_arraySize, addr 0x45a7d38, size 0x8, virtual false, abstract: false, final false
  inline int32_t get_arraySize();

  /// @brief Method get_bit, addr 0x45a7cf8, size 0x8, virtual false, abstract: false, final false
  inline uint32_t get_bit();

  /// @brief Method get_defaultState, addr 0x45a7d48, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::PrimitiveValue get_defaultState();

  /// @brief Method get_displayName, addr 0x45a7c78, size 0x8, virtual false, abstract: false, final false
  inline ::StringW get_displayName();

  /// @brief Method get_dontReset, addr 0x45a7da8, size 0xc, virtual false, abstract: false, final false
  inline bool get_dontReset();

  /// @brief Method get_flags, addr 0x45a7d28, size 0x8, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__ControlItem__Flags get_flags();

  /// @brief Method get_format, addr 0x45a7d18, size 0x8, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::FourCC get_format();

  /// @brief Method get_isArray, addr 0x45a34dc, size 0x10, virtual false, abstract: false, final false
  inline bool get_isArray();

  /// @brief Method get_isFirstDefinedInThisLayout, addr 0x45a7db4, size 0xc, virtual false, abstract: false, final false
  inline bool get_isFirstDefinedInThisLayout();

  /// @brief Method get_isModifyingExistingControl, addr 0x45a7d84, size 0xc, virtual false, abstract: false, final false
  inline bool get_isModifyingExistingControl();

  /// @brief Method get_isNoisy, addr 0x45a7d90, size 0xc, virtual false, abstract: false, final false
  inline bool get_isNoisy();

  /// @brief Method get_isSynthetic, addr 0x45a7d9c, size 0xc, virtual false, abstract: false, final false
  inline bool get_isSynthetic();

  /// @brief Method get_layout, addr 0x45a7c40, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::InternedString get_layout();

  /// @brief Method get_maxValue, addr 0x45a7d70, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::PrimitiveValue get_maxValue();

  /// @brief Method get_minValue, addr 0x45a7d5c, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::PrimitiveValue get_minValue();

  /// @brief Method get_name, addr 0x45a7c2c, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::InternedString get_name();

  /// @brief Method get_offset, addr 0x45a7ce8, size 0x8, virtual false, abstract: false, final false
  inline uint32_t get_offset();

  /// @brief Method get_parameters, addr 0x45a7cc0, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue> get_parameters();

  /// @brief Method get_processors, addr 0x45a7cd4, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters> get_processors();

  /// @brief Method get_shortDisplayName, addr 0x45a7c88, size 0x8, virtual false, abstract: false, final false
  inline ::StringW get_shortDisplayName();

  /// @brief Method get_sizeInBits, addr 0x45a7d08, size 0x8, virtual false, abstract: false, final false
  inline uint32_t get_sizeInBits();

  /// @brief Method get_usages, addr 0x45a7c98, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> get_usages();

  /// @brief Method get_useStateFrom, addr 0x45a7c68, size 0x8, virtual false, abstract: false, final false
  inline ::StringW get_useStateFrom();

  /// @brief Method get_variants, addr 0x45a7c54, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::InternedString get_variants();

  /// @brief Method set_aliases, addr 0x45a7cb8, size 0x8, virtual false, abstract: false, final false
  inline void set_aliases(::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> value);

  /// @brief Method set_arraySize, addr 0x45a7d40, size 0x8, virtual false, abstract: false, final false
  inline void set_arraySize(int32_t value);

  /// @brief Method set_bit, addr 0x45a7d00, size 0x8, virtual false, abstract: false, final false
  inline void set_bit(uint32_t value);

  /// @brief Method set_defaultState, addr 0x45a7d54, size 0x8, virtual false, abstract: false, final false
  inline void set_defaultState(::UnityEngine::InputSystem::Utilities::PrimitiveValue value);

  /// @brief Method set_displayName, addr 0x45a7c80, size 0x8, virtual false, abstract: false, final false
  inline void set_displayName(::StringW value);

  /// @brief Method set_dontReset, addr 0x45a5b14, size 0x20, virtual false, abstract: false, final false
  inline void set_dontReset(bool value);

  /// @brief Method set_flags, addr 0x45a7d30, size 0x8, virtual false, abstract: false, final false
  inline void set_flags(::GlobalNamespace::__InputControlLayout__ControlItem__Flags value);

  /// @brief Method set_format, addr 0x45a7d20, size 0x8, virtual false, abstract: false, final false
  inline void set_format(::UnityEngine::InputSystem::Utilities::FourCC value);

  /// @brief Method set_isFirstDefinedInThisLayout, addr 0x45a5ad4, size 0x20, virtual false, abstract: false, final false
  inline void set_isFirstDefinedInThisLayout(bool value);

  /// @brief Method set_isModifyingExistingControl, addr 0x45a5ac4, size 0x10, virtual false, abstract: false, final false
  inline void set_isModifyingExistingControl(bool value);

  /// @brief Method set_isNoisy, addr 0x45a5af4, size 0x20, virtual false, abstract: false, final false
  inline void set_isNoisy(bool value);

  /// @brief Method set_isSynthetic, addr 0x45a5b34, size 0x20, virtual false, abstract: false, final false
  inline void set_isSynthetic(bool value);

  /// @brief Method set_layout, addr 0x45a7c4c, size 0x8, virtual false, abstract: false, final false
  inline void set_layout(::UnityEngine::InputSystem::Utilities::InternedString value);

  /// @brief Method set_maxValue, addr 0x45a7d7c, size 0x8, virtual false, abstract: false, final false
  inline void set_maxValue(::UnityEngine::InputSystem::Utilities::PrimitiveValue value);

  /// @brief Method set_minValue, addr 0x45a7d68, size 0x8, virtual false, abstract: false, final false
  inline void set_minValue(::UnityEngine::InputSystem::Utilities::PrimitiveValue value);

  /// @brief Method set_name, addr 0x45a7c38, size 0x8, virtual false, abstract: false, final false
  inline void set_name(::UnityEngine::InputSystem::Utilities::InternedString value);

  /// @brief Method set_offset, addr 0x45a7cf0, size 0x8, virtual false, abstract: false, final false
  inline void set_offset(uint32_t value);

  /// @brief Method set_parameters, addr 0x45a7ccc, size 0x8, virtual false, abstract: false, final false
  inline void set_parameters(::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue> value);

  /// @brief Method set_processors, addr 0x45a7ce0, size 0x8, virtual false, abstract: false, final false
  inline void set_processors(::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters> value);

  /// @brief Method set_shortDisplayName, addr 0x45a7c90, size 0x8, virtual false, abstract: false, final false
  inline void set_shortDisplayName(::StringW value);

  /// @brief Method set_sizeInBits, addr 0x45a7d10, size 0x8, virtual false, abstract: false, final false
  inline void set_sizeInBits(uint32_t value);

  /// @brief Method set_usages, addr 0x45a7ca4, size 0x8, virtual false, abstract: false, final false
  inline void set_usages(::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> value);

  /// @brief Method set_useStateFrom, addr 0x45a7c70, size 0x8, virtual false, abstract: false, final false
  inline void set_useStateFrom(::StringW value);

  /// @brief Method set_variants, addr 0x45a7c60, size 0x8, virtual false, abstract: false, final false
  inline void set_variants(::UnityEngine::InputSystem::Utilities::InternedString value);

  // Ctor Parameters []
  // @brief default ctor
  constexpr __InputControlLayout__ControlItem();

  // Ctor Parameters [CppParam { name: "_name_k__BackingField", ty: "::UnityEngine::InputSystem::Utilities::InternedString", modifiers: "", def_value: None }, CppParam { name:
  // "_layout_k__BackingField", ty: "::UnityEngine::InputSystem::Utilities::InternedString", modifiers: "", def_value: None }, CppParam { name: "_variants_k__BackingField", ty:
  // "::UnityEngine::InputSystem::Utilities::InternedString", modifiers: "", def_value: None }, CppParam { name: "_useStateFrom_k__BackingField", ty: "::StringW", modifiers: "", def_value: None },
  // CppParam { name: "_displayName_k__BackingField", ty: "::StringW", modifiers: "", def_value: None }, CppParam { name: "_shortDisplayName_k__BackingField", ty: "::StringW", modifiers: "",
  // def_value: None }, CppParam { name: "_usages_k__BackingField", ty: "::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString>", modifiers: "",
  // def_value: None }, CppParam { name: "_aliases_k__BackingField", ty: "::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString>", modifiers: "",
  // def_value: None }, CppParam { name: "_parameters_k__BackingField", ty: "::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue>", modifiers: "",
  // def_value: None }, CppParam { name: "_processors_k__BackingField", ty: "::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters>",
  // modifiers: "", def_value: None }, CppParam { name: "_offset_k__BackingField", ty: "uint32_t", modifiers: "", def_value: None }, CppParam { name: "_bit_k__BackingField", ty: "uint32_t", modifiers:
  // "", def_value: None }, CppParam { name: "_sizeInBits_k__BackingField", ty: "uint32_t", modifiers: "", def_value: None }, CppParam { name: "_format_k__BackingField", ty:
  // "::UnityEngine::InputSystem::Utilities::FourCC", modifiers: "", def_value: None }, CppParam { name: "_flags_k__BackingField", ty: "::GlobalNamespace::__InputControlLayout__ControlItem__Flags",
  // modifiers: "", def_value: None }, CppParam { name: "_arraySize_k__BackingField", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "_defaultState_k__BackingField", ty:
  // "::UnityEngine::InputSystem::Utilities::PrimitiveValue", modifiers: "", def_value: None }, CppParam { name: "_minValue_k__BackingField", ty:
  // "::UnityEngine::InputSystem::Utilities::PrimitiveValue", modifiers: "", def_value: None }, CppParam { name: "_maxValue_k__BackingField", ty:
  // "::UnityEngine::InputSystem::Utilities::PrimitiveValue", modifiers: "", def_value: None }]
  constexpr __InputControlLayout__ControlItem(::UnityEngine::InputSystem::Utilities::InternedString _name_k__BackingField,
                                              ::UnityEngine::InputSystem::Utilities::InternedString _layout_k__BackingField,
                                              ::UnityEngine::InputSystem::Utilities::InternedString _variants_k__BackingField, ::StringW _useStateFrom_k__BackingField,
                                              ::StringW _displayName_k__BackingField, ::StringW _shortDisplayName_k__BackingField,
                                              ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> _usages_k__BackingField,
                                              ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> _aliases_k__BackingField,
                                              ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue> _parameters_k__BackingField,
                                              ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters> _processors_k__BackingField,
                                              uint32_t _offset_k__BackingField, uint32_t _bit_k__BackingField, uint32_t _sizeInBits_k__BackingField,
                                              ::UnityEngine::InputSystem::Utilities::FourCC _format_k__BackingField, ::GlobalNamespace::__InputControlLayout__ControlItem__Flags _flags_k__BackingField,
                                              int32_t _arraySize_k__BackingField, ::UnityEngine::InputSystem::Utilities::PrimitiveValue _defaultState_k__BackingField,
                                              ::UnityEngine::InputSystem::Utilities::PrimitiveValue _minValue_k__BackingField,
                                              ::UnityEngine::InputSystem::Utilities::PrimitiveValue _maxValue_k__BackingField) noexcept;

  /// @brief Field <name>k__BackingField, offset: 0x0, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::InternedString _name_k__BackingField;

  /// @brief Field <layout>k__BackingField, offset: 0x10, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::InternedString _layout_k__BackingField;

  /// @brief Field <variants>k__BackingField, offset: 0x20, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::InternedString _variants_k__BackingField;

  /// @brief Field <useStateFrom>k__BackingField, offset: 0x30, size: 0x8, def value: None
  ::StringW _useStateFrom_k__BackingField;

  /// @brief Field <displayName>k__BackingField, offset: 0x38, size: 0x8, def value: None
  ::StringW _displayName_k__BackingField;

  /// @brief Field <shortDisplayName>k__BackingField, offset: 0x40, size: 0x8, def value: None
  ::StringW _shortDisplayName_k__BackingField;

  /// @brief Field <usages>k__BackingField, offset: 0x48, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> _usages_k__BackingField;

  /// @brief Field <aliases>k__BackingField, offset: 0x58, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> _aliases_k__BackingField;

  /// @brief Field <parameters>k__BackingField, offset: 0x68, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue> _parameters_k__BackingField;

  /// @brief Field <processors>k__BackingField, offset: 0x78, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters> _processors_k__BackingField;

  /// @brief Field <offset>k__BackingField, offset: 0x88, size: 0x4, def value: None
  uint32_t _offset_k__BackingField;

  /// @brief Field <bit>k__BackingField, offset: 0x8c, size: 0x4, def value: None
  uint32_t _bit_k__BackingField;

  /// @brief Field <sizeInBits>k__BackingField, offset: 0x90, size: 0x4, def value: None
  uint32_t _sizeInBits_k__BackingField;

  /// @brief Field <format>k__BackingField, offset: 0x94, size: 0x4, def value: None
  ::UnityEngine::InputSystem::Utilities::FourCC _format_k__BackingField;

  /// @brief Field <flags>k__BackingField, offset: 0x98, size: 0x4, def value: None
  ::GlobalNamespace::__InputControlLayout__ControlItem__Flags _flags_k__BackingField;

  /// @brief Field <arraySize>k__BackingField, offset: 0x9c, size: 0x4, def value: None
  int32_t _arraySize_k__BackingField;

  /// @brief Field <defaultState>k__BackingField, offset: 0xa0, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::PrimitiveValue _defaultState_k__BackingField;

  /// @brief Field <minValue>k__BackingField, offset: 0xb0, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::PrimitiveValue _minValue_k__BackingField;

  /// @brief Field <maxValue>k__BackingField, offset: 0xc0, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::PrimitiveValue _maxValue_k__BackingField;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 6972 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0xd0 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, 0xd0>, "Size mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _name_k__BackingField) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _layout_k__BackingField) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _variants_k__BackingField) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _useStateFrom_k__BackingField) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _displayName_k__BackingField) == 0x38, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _shortDisplayName_k__BackingField) == 0x40, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _usages_k__BackingField) == 0x48, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _aliases_k__BackingField) == 0x58, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _parameters_k__BackingField) == 0x68, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _processors_k__BackingField) == 0x78, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _offset_k__BackingField) == 0x88, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _bit_k__BackingField) == 0x8c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _sizeInBits_k__BackingField) == 0x90, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _format_k__BackingField) == 0x94, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _flags_k__BackingField) == 0x98, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _arraySize_k__BackingField) == 0x9c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _defaultState_k__BackingField) == 0xa0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _minValue_k__BackingField) == 0xb0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, _maxValue_k__BackingField) == 0xc0, "Offset mismatch!");

} // namespace UnityEngine::InputSystem::Layouts
// Type: ::<>c
// SizeInfo { instance_size: 16, native_size: -1, calculated_instance_size: 16, calculated_native_size: 16, minimum_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: false
// CS Name: ::InputControlLayout::Builder::ControlBuilder::<>c*
class CORDL_TYPE __InputControlLayout__Builder__ControlBuilder____c : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>9, offset 0xffffffff, size 0x8
  static __declspec(property(get = getStaticF___9, put = setStaticF___9)) ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder____c* __9;

  /// @brief Field <>9__14_0, offset 0xffffffff, size 0x8
  static __declspec(property(get = getStaticF___9__14_0, put = setStaticF___9__14_0)) ::System::Func_2<::StringW, ::UnityEngine::InputSystem::Utilities::InternedString>* __9__14_0;

  static inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder____c* New_ctor();

  /// @brief Method <WithUsages>b__14_0, addr 0x45a8d44, size 0x28, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::InternedString _WithUsages_b__14_0(::StringW x);

  /// @brief Method .ctor, addr 0x45a8d3c, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

  static inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder____c* getStaticF___9();

  static inline ::System::Func_2<::StringW, ::UnityEngine::InputSystem::Utilities::InternedString>* getStaticF___9__14_0();

  static inline void setStaticF___9(::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder____c* value);

  static inline void setStaticF___9__14_0(::System::Func_2<::StringW, ::UnityEngine::InputSystem::Utilities::InternedString>* value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __InputControlLayout__Builder__ControlBuilder____c();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__InputControlLayout__Builder__ControlBuilder____c", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __InputControlLayout__Builder__ControlBuilder____c(__InputControlLayout__Builder__ControlBuilder____c&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__InputControlLayout__Builder__ControlBuilder____c", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __InputControlLayout__Builder__ControlBuilder____c(__InputControlLayout__Builder__ControlBuilder____c const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 6973 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder____c, 0x10>, "Size mismatch!");

} // namespace GlobalNamespace
// Type: ::ControlBuilder
// SizeInfo { instance_size: 16, native_size: -1, calculated_instance_size: 16, calculated_native_size: 28, minimum_alignment: 8, packing: None, specified_packing: None }
namespace GlobalNamespace {
// Is value type: true
// CS Name: ::InputControlLayout::Builder::ControlBuilder
struct CORDL_TYPE __InputControlLayout__Builder__ControlBuilder {
public:
  // Declarations
  using __c = ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder____c;

  /// @brief Method AsArrayOfControlsWithSize, addr 0x45a8c98, size 0x48, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder AsArrayOfControlsWithSize(int32_t arraySize);

  /// @brief Method DontReset, addr 0x45a8624, size 0x60, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder DontReset(bool value);

  /// @brief Method IsNoisy, addr 0x45a85c4, size 0x60, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder IsNoisy(bool value);

  /// @brief Method IsSynthetic, addr 0x45a8564, size 0x60, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder IsSynthetic(bool value);

  /// @brief Method UsingStateFrom, addr 0x45a8c34, size 0x64, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder UsingStateFrom(::StringW path);

  /// @brief Method WithBitOffset, addr 0x45a851c, size 0x48, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder WithBitOffset(uint32_t bit);

  /// @brief Method WithByteOffset, addr 0x45a84d4, size 0x48, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder WithByteOffset(uint32_t offset);

  /// @brief Method WithDefaultState, addr 0x45a8bec, size 0x48, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder WithDefaultState(::UnityEngine::InputSystem::Utilities::PrimitiveValue value);

  /// @brief Method WithDisplayName, addr 0x45a8328, size 0x48, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder WithDisplayName(::StringW displayName);

  /// @brief Method WithFormat, addr 0x45a84a0, size 0x34, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder WithFormat(::StringW format);

  /// @brief Method WithFormat, addr 0x45a8458, size 0x48, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder WithFormat(::UnityEngine::InputSystem::Utilities::FourCC format);

  /// @brief Method WithLayout, addr 0x45a8370, size 0xe8, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder WithLayout(::StringW layout);

  /// @brief Method WithParameters, addr 0x45a8a60, size 0xb8, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder WithParameters(::StringW parameters);

  /// @brief Method WithProcessors, addr 0x45a8b18, size 0xd4, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder WithProcessors(::StringW processors);

  /// @brief Method WithRange, addr 0x45a86cc, size 0x9c, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder WithRange(float_t minValue, float_t maxValue);

  /// @brief Method WithSizeInBits, addr 0x45a8684, size 0x48, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder WithSizeInBits(uint32_t sizeInBits);

  /// @brief Method WithUsages, addr 0x45a8a5c, size 0x4, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder WithUsages(::ArrayW<::StringW, ::Array<::StringW>*> usages);

  /// @brief Method WithUsages, addr 0x45a8768, size 0x1d0, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder
  WithUsages(::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString, ::Array<::UnityEngine::InputSystem::Utilities::InternedString>*> usages);

  /// @brief Method WithUsages, addr 0x45a8938, size 0x124, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder WithUsages(::System::Collections::Generic::IEnumerable_1<::StringW>* usages);

  // Ctor Parameters []
  // @brief default ctor
  constexpr __InputControlLayout__Builder__ControlBuilder();

  // Ctor Parameters [CppParam { name: "builder", ty: "::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder*", modifiers: "", def_value: None }, CppParam { name: "index", ty: "int32_t",
  // modifiers: "", def_value: None }]
  constexpr __InputControlLayout__Builder__ControlBuilder(::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder* builder, int32_t index) noexcept;

  /// @brief Field builder, offset: 0x0, size: 0x8, def value: None
  ::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder* builder;

  /// @brief Field index, offset: 0x8, size: 0x4, def value: None
  int32_t index;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 6974 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x10 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder, 0x10>, "Size mismatch!");

static_assert(offsetof(::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder, builder) == 0x0, "Offset mismatch!");

static_assert(offsetof(::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder, index) == 0x8, "Offset mismatch!");

} // namespace GlobalNamespace
// Type: ::Builder
// SizeInfo { instance_size: 72, native_size: -1, calculated_instance_size: 72, calculated_native_size: 72, minimum_alignment: 8, packing: None, specified_packing: None }
namespace UnityEngine::InputSystem::Layouts {
// Is value type: false
// CS Name: ::InputControlLayout::Builder*
class CORDL_TYPE __InputControlLayout__Builder : public ::System::Object {
public:
  // Declarations
  using ControlBuilder = ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder;

  /// @brief Field <displayName>k__BackingField, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get__displayName_k__BackingField, put = __cordl_internal_set__displayName_k__BackingField)) ::StringW _displayName_k__BackingField;

  /// @brief Field <name>k__BackingField, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get__name_k__BackingField, put = __cordl_internal_set__name_k__BackingField)) ::StringW _name_k__BackingField;

  /// @brief Field <stateFormat>k__BackingField, offset 0x28, size 0x4
  __declspec(property(get = __cordl_internal_get__stateFormat_k__BackingField,
                      put = __cordl_internal_set__stateFormat_k__BackingField)) ::UnityEngine::InputSystem::Utilities::FourCC _stateFormat_k__BackingField;

  /// @brief Field <stateSizeInBytes>k__BackingField, offset 0x2c, size 0x4
  __declspec(property(get = __cordl_internal_get__stateSizeInBytes_k__BackingField, put = __cordl_internal_set__stateSizeInBytes_k__BackingField)) int32_t _stateSizeInBytes_k__BackingField;

  /// @brief Field <type>k__BackingField, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get__type_k__BackingField, put = __cordl_internal_set__type_k__BackingField)) ::System::Type* _type_k__BackingField;

  /// @brief Field <updateBeforeRender>k__BackingField, offset 0x38, size 0x2
  __declspec(property(get = __cordl_internal_get__updateBeforeRender_k__BackingField, put = __cordl_internal_set__updateBeforeRender_k__BackingField)) ::System::Nullable_1<bool>
      _updateBeforeRender_k__BackingField;

  __declspec(property(get = get_controls)) ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem> controls;

  __declspec(property(get = get_displayName, put = set_displayName)) ::StringW displayName;

  __declspec(property(get = get_extendsLayout, put = set_extendsLayout)) ::StringW extendsLayout;

  /// @brief Field m_ControlCount, offset 0x3c, size 0x4
  __declspec(property(get = __cordl_internal_get_m_ControlCount, put = __cordl_internal_set_m_ControlCount)) int32_t m_ControlCount;

  /// @brief Field m_Controls, offset 0x40, size 0x8
  __declspec(property(get = __cordl_internal_get_m_Controls, put = __cordl_internal_set_m_Controls)) ::ArrayW<::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem,
                                                                                                              ::Array<::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem>*>
      m_Controls;

  /// @brief Field m_ExtendsLayout, offset 0x30, size 0x8
  __declspec(property(get = __cordl_internal_get_m_ExtendsLayout, put = __cordl_internal_set_m_ExtendsLayout)) ::StringW m_ExtendsLayout;

  __declspec(property(get = get_name, put = set_name)) ::StringW name;

  __declspec(property(get = get_stateFormat, put = set_stateFormat)) ::UnityEngine::InputSystem::Utilities::FourCC stateFormat;

  __declspec(property(get = get_stateSizeInBytes, put = set_stateSizeInBytes)) int32_t stateSizeInBytes;

  __declspec(property(get = get_type, put = set_type)) ::System::Type* type;

  __declspec(property(get = get_updateBeforeRender, put = set_updateBeforeRender)) ::System::Nullable_1<bool> updateBeforeRender;

  /// @brief Method AddControl, addr 0x45a7ec4, size 0x1a4, virtual false, abstract: false, final false
  inline ::GlobalNamespace::__InputControlLayout__Builder__ControlBuilder AddControl(::StringW name);

  /// @brief Method Build, addr 0x45a80f4, size 0x22c, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::InputControlLayout* Build();

  /// @brief Method Extend, addr 0x45a80bc, size 0x38, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder* Extend(::StringW baseLayoutName);

  static inline ::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder* New_ctor();

  /// @brief Method WithDisplayName, addr 0x45a8070, size 0x8, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder* WithDisplayName(::StringW displayName);

  /// @brief Method WithFormat, addr 0x45a8080, size 0x34, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder* WithFormat(::StringW format);

  /// @brief Method WithFormat, addr 0x45a8078, size 0x8, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder* WithFormat(::UnityEngine::InputSystem::Utilities::FourCC format);

  /// @brief Method WithName, addr 0x45a8068, size 0x8, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder* WithName(::StringW name);

  /// @brief Method WithSizeInBytes, addr 0x45a80b4, size 0x8, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder* WithSizeInBytes(int32_t sizeInBytes);

  /// @brief Method WithType, addr 0x0, size 0xffffffffffffffff, virtual false, abstract: false, final false
  template <typename T> inline ::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder* WithType();

  constexpr ::StringW const& __cordl_internal_get__displayName_k__BackingField() const;

  constexpr ::StringW& __cordl_internal_get__displayName_k__BackingField();

  constexpr ::StringW const& __cordl_internal_get__name_k__BackingField() const;

  constexpr ::StringW& __cordl_internal_get__name_k__BackingField();

  constexpr ::UnityEngine::InputSystem::Utilities::FourCC const& __cordl_internal_get__stateFormat_k__BackingField() const;

  constexpr ::UnityEngine::InputSystem::Utilities::FourCC& __cordl_internal_get__stateFormat_k__BackingField();

  constexpr int32_t const& __cordl_internal_get__stateSizeInBytes_k__BackingField() const;

  constexpr int32_t& __cordl_internal_get__stateSizeInBytes_k__BackingField();

  constexpr ::System::Type*& __cordl_internal_get__type_k__BackingField();

  constexpr ::cordl_internals::to_const_pointer<::System::Type*> const& __cordl_internal_get__type_k__BackingField() const;

  constexpr ::System::Nullable_1<bool> const& __cordl_internal_get__updateBeforeRender_k__BackingField() const;

  constexpr ::System::Nullable_1<bool>& __cordl_internal_get__updateBeforeRender_k__BackingField();

  constexpr int32_t const& __cordl_internal_get_m_ControlCount() const;

  constexpr int32_t& __cordl_internal_get_m_ControlCount();

  constexpr ::ArrayW<::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, ::Array<::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem>*> const&
  __cordl_internal_get_m_Controls() const;

  constexpr ::ArrayW<::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, ::Array<::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem>*>&
  __cordl_internal_get_m_Controls();

  constexpr ::StringW const& __cordl_internal_get_m_ExtendsLayout() const;

  constexpr ::StringW& __cordl_internal_get_m_ExtendsLayout();

  constexpr void __cordl_internal_set__displayName_k__BackingField(::StringW value);

  constexpr void __cordl_internal_set__name_k__BackingField(::StringW value);

  constexpr void __cordl_internal_set__stateFormat_k__BackingField(::UnityEngine::InputSystem::Utilities::FourCC value);

  constexpr void __cordl_internal_set__stateSizeInBytes_k__BackingField(int32_t value);

  constexpr void __cordl_internal_set__type_k__BackingField(::System::Type* value);

  constexpr void __cordl_internal_set__updateBeforeRender_k__BackingField(::System::Nullable_1<bool> value);

  constexpr void __cordl_internal_set_m_ControlCount(int32_t value);

  constexpr void __cordl_internal_set_m_Controls(
      ::ArrayW<::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, ::Array<::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem>*> value);

  constexpr void __cordl_internal_set_m_ExtendsLayout(::StringW value);

  /// @brief Method .ctor, addr 0x45a8320, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_controls, addr 0x45a7e5c, size 0x68, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem> get_controls();

  /// @brief Method get_displayName, addr 0x45a7dd0, size 0x8, virtual false, abstract: false, final false
  inline ::StringW get_displayName();

  /// @brief Method get_extendsLayout, addr 0x45a7e10, size 0x8, virtual false, abstract: false, final false
  inline ::StringW get_extendsLayout();

  /// @brief Method get_name, addr 0x45a7dc0, size 0x8, virtual false, abstract: false, final false
  inline ::StringW get_name();

  /// @brief Method get_stateFormat, addr 0x45a7df0, size 0x8, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::FourCC get_stateFormat();

  /// @brief Method get_stateSizeInBytes, addr 0x45a7e00, size 0x8, virtual false, abstract: false, final false
  inline int32_t get_stateSizeInBytes();

  /// @brief Method get_type, addr 0x45a7de0, size 0x8, virtual false, abstract: false, final false
  inline ::System::Type* get_type();

  /// @brief Method get_updateBeforeRender, addr 0x45a7e4c, size 0x8, virtual false, abstract: false, final false
  inline ::System::Nullable_1<bool> get_updateBeforeRender();

  /// @brief Method set_displayName, addr 0x45a7dd8, size 0x8, virtual false, abstract: false, final false
  inline void set_displayName(::StringW value);

  /// @brief Method set_extendsLayout, addr 0x45a7e18, size 0x34, virtual false, abstract: false, final false
  inline void set_extendsLayout(::StringW value);

  /// @brief Method set_name, addr 0x45a7dc8, size 0x8, virtual false, abstract: false, final false
  inline void set_name(::StringW value);

  /// @brief Method set_stateFormat, addr 0x45a7df8, size 0x8, virtual false, abstract: false, final false
  inline void set_stateFormat(::UnityEngine::InputSystem::Utilities::FourCC value);

  /// @brief Method set_stateSizeInBytes, addr 0x45a7e08, size 0x8, virtual false, abstract: false, final false
  inline void set_stateSizeInBytes(int32_t value);

  /// @brief Method set_type, addr 0x45a7de8, size 0x8, virtual false, abstract: false, final false
  inline void set_type(::System::Type* value);

  /// @brief Method set_updateBeforeRender, addr 0x45a7e54, size 0x8, virtual false, abstract: false, final false
  inline void set_updateBeforeRender(::System::Nullable_1<bool> value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __InputControlLayout__Builder();

public:
  // Ctor Parameters [CppParam { name: "", ty: "__InputControlLayout__Builder", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __InputControlLayout__Builder(__InputControlLayout__Builder&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__InputControlLayout__Builder", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __InputControlLayout__Builder(__InputControlLayout__Builder const&) = delete;

  /// @brief Field <name>k__BackingField, offset: 0x10, size: 0x8, def value: None
  ::StringW ____name_k__BackingField;

  /// @brief Field <displayName>k__BackingField, offset: 0x18, size: 0x8, def value: None
  ::StringW ____displayName_k__BackingField;

  /// @brief Field <type>k__BackingField, offset: 0x20, size: 0x8, def value: None
  ::System::Type* ____type_k__BackingField;

  /// @brief Field <stateFormat>k__BackingField, offset: 0x28, size: 0x4, def value: None
  ::UnityEngine::InputSystem::Utilities::FourCC ____stateFormat_k__BackingField;

  /// @brief Field <stateSizeInBytes>k__BackingField, offset: 0x2c, size: 0x4, def value: None
  int32_t ____stateSizeInBytes_k__BackingField;

  /// @brief Field m_ExtendsLayout, offset: 0x30, size: 0x8, def value: None
  ::StringW ___m_ExtendsLayout;

  /// @brief Field <updateBeforeRender>k__BackingField, offset: 0x38, size: 0x2, def value: None
  ::System::Nullable_1<bool> ____updateBeforeRender_k__BackingField;

  /// @brief Field m_ControlCount, offset: 0x3c, size: 0x4, def value: None
  int32_t ___m_ControlCount;

  /// @brief Field m_Controls, offset: 0x40, size: 0x8, def value: None
  ::ArrayW<::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem, ::Array<::UnityEngine::InputSystem::Layouts::__InputControlLayout__ControlItem>*> ___m_Controls;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 6975 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder, 0x48>, "Size mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder, ____name_k__BackingField) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder, ____displayName_k__BackingField) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder, ____type_k__BackingField) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder, ____stateFormat_k__BackingField) == 0x28, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder, ____stateSizeInBytes_k__BackingField) == 0x2c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder, ___m_ExtendsLayout) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder, ____updateBeforeRender_k__BackingField) == 0x38, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder, ___m_ControlCount) == 0x3c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__Builder, ___m_Controls) == 0x40, "Offset mismatch!");

} // namespace UnityEngine::InputSystem::Layouts
// Type: ::Flags
// SizeInfo { instance_size: 4, native_size: 4, calculated_instance_size: 4, calculated_native_size: 20, minimum_alignment: 4, packing: None, specified_packing: None }
namespace UnityEngine::InputSystem::Layouts {
// Is value type: true
// CS Name: ::InputControlLayout::Flags
struct CORDL_TYPE __InputControlLayout__Flags {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct ____InputControlLayout__Flags_Unwrapped
  enum struct ____InputControlLayout__Flags_Unwrapped : int32_t {
    __E_IsGenericTypeOfDevice = static_cast<int32_t>(0x1),
    __E_HideInUI = static_cast<int32_t>(0x2),
    __E_IsOverride = static_cast<int32_t>(0x4),
    __E_CanRunInBackground = static_cast<int32_t>(0x8),
    __E_CanRunInBackgroundIsSet = static_cast<int32_t>(0x10),
    __E_IsNoisy = static_cast<int32_t>(0x20),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator ____InputControlLayout__Flags_Unwrapped() const noexcept {
    return static_cast<____InputControlLayout__Flags_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr __InputControlLayout__Flags();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __InputControlLayout__Flags(int32_t value__) noexcept;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  /// @brief Field CanRunInBackground value: static_cast<int32_t>(0x8)
  static ::UnityEngine::InputSystem::Layouts::__InputControlLayout__Flags const CanRunInBackground;

  /// @brief Field CanRunInBackgroundIsSet value: static_cast<int32_t>(0x10)
  static ::UnityEngine::InputSystem::Layouts::__InputControlLayout__Flags const CanRunInBackgroundIsSet;

  /// @brief Field HideInUI value: static_cast<int32_t>(0x2)
  static ::UnityEngine::InputSystem::Layouts::__InputControlLayout__Flags const HideInUI;

  /// @brief Field IsGenericTypeOfDevice value: static_cast<int32_t>(0x1)
  static ::UnityEngine::InputSystem::Layouts::__InputControlLayout__Flags const IsGenericTypeOfDevice;

  /// @brief Field IsNoisy value: static_cast<int32_t>(0x20)
  static ::UnityEngine::InputSystem::Layouts::__InputControlLayout__Flags const IsNoisy;

  /// @brief Field IsOverride value: static_cast<int32_t>(0x4)
  static ::UnityEngine::InputSystem::Layouts::__InputControlLayout__Flags const IsOverride;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 6976 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::InputSystem::Layouts::__InputControlLayout__Flags, 0x4>, "Size mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::__InputControlLayout__Flags, value__) == 0x0, "Offset mismatch!");

} // namespace UnityEngine::InputSystem::Layouts
// Type: ::LayoutJsonNameAndDescriptorOnly
// SizeInfo { instance_size: 112, native_size: -1, calculated_instance_size: 112, calculated_native_size: 128, minimum_alignment: 8, packing: None, specified_packing: None }
namespace UnityEngine::InputSystem::Layouts {
// Is value type: true
// CS Name: ::InputControlLayout::LayoutJsonNameAndDescriptorOnly
struct CORDL_TYPE __InputControlLayout__LayoutJsonNameAndDescriptorOnly {
public:
  // Declarations
  // Ctor Parameters []
  // @brief default ctor
  constexpr __InputControlLayout__LayoutJsonNameAndDescriptorOnly();

  // Ctor Parameters [CppParam { name: "name", ty: "::StringW", modifiers: "", def_value: None }, CppParam { name: "extend", ty: "::StringW", modifiers: "", def_value: None }, CppParam { name:
  // "extendMultiple", ty: "::ArrayW<::StringW,::Array<::StringW>*>", modifiers: "", def_value: None }, CppParam { name: "device", ty:
  // "::UnityEngine::InputSystem::Layouts::__InputDeviceMatcher__MatcherJson", modifiers: "", def_value: None }]
  constexpr __InputControlLayout__LayoutJsonNameAndDescriptorOnly(::StringW name, ::StringW extend, ::ArrayW<::StringW, ::Array<::StringW>*> extendMultiple,
                                                                  ::UnityEngine::InputSystem::Layouts::__InputDeviceMatcher__MatcherJson device) noexcept;

  /// @brief Field name, offset: 0x0, size: 0x8, def value: None
  ::StringW name;

  /// @brief Field extend, offset: 0x8, size: 0x8, def value: None
  ::StringW extend;

  /// @brief Field extendMultiple, offset: 0x10, size: 0x8, def value: None
