#pragma once
// IWYU pragma private; include "UnityEngine/InputSystem/Layouts/InputControlLayout.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/Collections/Generic/zzzz__IEnumerable_1_def.hpp"
#include "System/Collections/Generic/zzzz__IEnumerator_1_def.hpp"
#include "System/Collections/zzzz__IEnumerable_def.hpp"
#include "System/Collections/zzzz__IEnumerator_def.hpp"
#include "System/zzzz__Exception_def.hpp"
#include "System/zzzz__IDisposable_def.hpp"
#include "System/zzzz__Nullable_1_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "UnityEngine/InputSystem/Layouts/zzzz__InputDeviceMatcher_def.hpp"
#include "UnityEngine/InputSystem/Utilities/zzzz__FourCC_def.hpp"
#include "UnityEngine/InputSystem/Utilities/zzzz__InlinedArray_1_def.hpp"
#include "UnityEngine/InputSystem/Utilities/zzzz__InternedString_def.hpp"
#include "UnityEngine/InputSystem/Utilities/zzzz__NameAndParameters_def.hpp"
#include "UnityEngine/InputSystem/Utilities/zzzz__NamedValue_def.hpp"
#include "UnityEngine/InputSystem/Utilities/zzzz__PrimitiveValue_def.hpp"
#include "UnityEngine/InputSystem/Utilities/zzzz__ReadOnlyArray_1_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cmath>
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(InputControlLayout)
namespace System::Collections::Generic {
template <typename TKey, typename TValue> class Dictionary_2;
}

class InputControlLayout_LayoutNotFoundException;
}
namespace UnityEngine::InputSystem::Layouts {
class InputControlLayout___c;
}
namespace UnityEngine::InputSystem::Layouts {
class LayoutJson_InputControlLayout___c;
}
namespace UnityEngine::InputSystem::Layouts {
struct Builder_InputControlLayout_ControlBuilder;
}
namespace UnityEngine::InputSystem::Layouts {
struct Collection_InputControlLayout_LayoutMatcher;
}
namespace UnityEngine::InputSystem::Layouts {
struct Collection_InputControlLayout_PrecompiledLayout;
}
namespace UnityEngine::InputSystem::Layouts {
struct InputControlLayout_Cache;
}
namespace UnityEngine::InputSystem::Layouts {
struct InputControlLayout_CacheRefInstance;
}
namespace UnityEngine::InputSystem::Layouts {
struct InputControlLayout_Collection;
}
namespace UnityEngine::InputSystem::Layouts {
struct InputControlLayout_ControlItem;
}
namespace UnityEngine::InputSystem::Layouts {
struct InputControlLayout_LayoutJson;
}
namespace UnityEngine::InputSystem::Layouts {
struct InputControlLayout_LayoutJsonNameAndDescriptorOnly;
}
// Write type traits
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::ControlItem_InputControlLayout_Flags);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::InputControlLayout_Flags);
MARK_REF_PTR_T(::UnityEngine::InputSystem::Layouts::Collection_InputControlLayout__GetBaseLayouts_d__24);
MARK_REF_PTR_T(::UnityEngine::InputSystem::Layouts::ControlBuilder_Builder_InputControlLayout___c);
MARK_REF_PTR_T(::UnityEngine::InputSystem::Layouts::ControlItemJson_InputControlLayout___c);
MARK_REF_PTR_T(::UnityEngine::InputSystem::Layouts::InputControlLayout);
MARK_REF_PTR_T(::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder);
MARK_REF_PTR_T(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItemJson);
MARK_REF_PTR_T(::UnityEngine::InputSystem::Layouts::InputControlLayout_LayoutNotFoundException);
MARK_REF_PTR_T(::UnityEngine::InputSystem::Layouts::InputControlLayout___c);
MARK_REF_PTR_T(::UnityEngine::InputSystem::Layouts::LayoutJson_InputControlLayout___c);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::Collection_InputControlLayout_LayoutMatcher);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::Collection_InputControlLayout_PrecompiledLayout);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::InputControlLayout_Cache);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::InputControlLayout_CacheRefInstance);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::InputControlLayout_Collection);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::InputControlLayout_LayoutJson);
MARK_VAL_T(::UnityEngine::InputSystem::Layouts::InputControlLayout_LayoutJsonNameAndDescriptorOnly);
// Dependencies
namespace UnityEngine::InputSystem::Layouts {
// Is value type: true
// CS Name: UnityEngine.InputSystem.Layouts.InputControlLayout/ControlItem/Flags
struct CORDL_TYPE ControlItem_InputControlLayout_Flags {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct __ControlItem_InputControlLayout_Flags_Unwrapped
  enum struct __ControlItem_InputControlLayout_Flags_Unwrapped : int32_t {
    __E_isModifyingExistingControl = static_cast<int32_t>(0x1),
    __E_IsNoisy = static_cast<int32_t>(0x2),
    __E_IsSynthetic = static_cast<int32_t>(0x4),
    __E_IsFirstDefinedInThisLayout = static_cast<int32_t>(0x8),
    __E_DontReset = static_cast<int32_t>(0x10),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __ControlItem_InputControlLayout_Flags_Unwrapped() const noexcept {
    return static_cast<__ControlItem_InputControlLayout_Flags_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr ControlItem_InputControlLayout_Flags();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr ControlItem_InputControlLayout_Flags(int32_t value__) noexcept;

  /// @brief Field DontReset value: I32(16)
  static ::UnityEngine::InputSystem::Layouts::ControlItem_InputControlLayout_Flags const DontReset;

  /// @brief Field IsFirstDefinedInThisLayout value: I32(8)
  static ::UnityEngine::InputSystem::Layouts::ControlItem_InputControlLayout_Flags const IsFirstDefinedInThisLayout;

  /// @brief Field IsNoisy value: I32(2)
  static ::UnityEngine::InputSystem::Layouts::ControlItem_InputControlLayout_Flags const IsNoisy;

  /// @brief Field IsSynthetic value: I32(4)
  static ::UnityEngine::InputSystem::Layouts::ControlItem_InputControlLayout_Flags const IsSynthetic;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 7006 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field isModifyingExistingControl value: I32(1)
  static ::UnityEngine::InputSystem::Layouts::ControlItem_InputControlLayout_Flags const isModifyingExistingControl;

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::InputSystem::Layouts::ControlItem_InputControlLayout_Flags, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::InputSystem::Layouts::ControlItem_InputControlLayout_Flags, 0x4>, "Size mismatch!");

} // namespace UnityEngine::InputSystem::Layouts
// Dependencies UnityEngine.InputSystem.Layouts.InputControlLayout::ControlItem::Flags, UnityEngine.InputSystem.Utilities.FourCC, UnityEngine.InputSystem.Utilities.InternedString,
// UnityEngine.InputSystem.Utilities.NameAndParameters, UnityEngine.InputSystem.Utilities.NamedValue, UnityEngine.InputSystem.Utilities.PrimitiveValue,
// UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<TValue>
namespace UnityEngine::InputSystem::Layouts {
// Is value type: true
// CS Name: UnityEngine.InputSystem.Layouts.InputControlLayout/ControlItem
struct CORDL_TYPE InputControlLayout_ControlItem {
public:
  // Declarations
  using Flags = ::UnityEngine::InputSystem::Layouts::ControlItem_InputControlLayout_Flags;

  __declspec(property(get = get_aliases, put = set_aliases)) ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> aliases;

  __declspec(property(get = get_arraySize, put = set_arraySize)) int32_t arraySize;

  __declspec(property(get = get_bit, put = set_bit)) uint32_t bit;

  __declspec(property(get = get_defaultState, put = set_defaultState)) ::UnityEngine::InputSystem::Utilities::PrimitiveValue defaultState;

  __declspec(property(get = get_displayName, put = set_displayName)) ::StringW displayName;

  __declspec(property(get = get_dontReset, put = set_dontReset)) bool dontReset;

  __declspec(property(get = get_flags, put = set_flags)) ::UnityEngine::InputSystem::Layouts::ControlItem_InputControlLayout_Flags flags;

  __declspec(property(get = get_format, put = set_format)) ::UnityEngine::InputSystem::Utilities::FourCC format;

  __declspec(property(get = get_isArray)) bool isArray;

  __declspec(property(get = get_isFirstDefinedInThisLayout, put = set_isFirstDefinedInThisLayout)) bool isFirstDefinedInThisLayout;

  __declspec(property(get = get_isModifyingExistingControl, put = set_isModifyingExistingControl)) bool isModifyingExistingControl;

  __declspec(property(get = get_isNoisy, put = set_isNoisy)) bool isNoisy;

  __declspec(property(get = get_isSynthetic, put = set_isSynthetic)) bool isSynthetic;

  __declspec(property(get = get_layout, put = set_layout)) ::UnityEngine::InputSystem::Utilities::InternedString layout;

  __declspec(property(get = get_maxValue, put = set_maxValue)) ::UnityEngine::InputSystem::Utilities::PrimitiveValue maxValue;

  __declspec(property(get = get_minValue, put = set_minValue)) ::UnityEngine::InputSystem::Utilities::PrimitiveValue minValue;

  __declspec(property(get = get_name, put = set_name)) ::UnityEngine::InputSystem::Utilities::InternedString name;

  __declspec(property(get = get_offset, put = set_offset)) uint32_t offset;

  __declspec(property(get = get_parameters, put = set_parameters)) ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue> parameters;

  __declspec(property(get = get_processors, put = set_processors)) ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters> processors;

  __declspec(property(get = get_shortDisplayName, put = set_shortDisplayName)) ::StringW shortDisplayName;

  __declspec(property(get = get_sizeInBits, put = set_sizeInBits)) uint32_t sizeInBits;

  __declspec(property(get = get_usages, put = set_usages)) ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> usages;

  __declspec(property(get = get_useStateFrom, put = set_useStateFrom)) ::StringW useStateFrom;

  __declspec(property(get = get_variants, put = set_variants)) ::UnityEngine::InputSystem::Utilities::InternedString variants;

  /// @brief Method Merge, addr 0x461e45c, size 0x39c, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem Merge(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem other);

  /// @brief Method get_aliases, addr 0x461ed38, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> get_aliases();

  /// @brief Method get_arraySize, addr 0x461edc4, size 0x8, virtual false, abstract: false, final false
  inline int32_t get_arraySize();

  /// @brief Method get_bit, addr 0x461ed84, size 0x8, virtual false, abstract: false, final false
  inline uint32_t get_bit();

  /// @brief Method get_defaultState, addr 0x461edd4, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::PrimitiveValue get_defaultState();

  /// @brief Method get_displayName, addr 0x461ed04, size 0x8, virtual false, abstract: false, final false
  inline ::StringW get_displayName();

  /// @brief Method get_dontReset, addr 0x461ee34, size 0xc, virtual false, abstract: false, final false
  inline bool get_dontReset();

  /// @brief Method get_flags, addr 0x461edb4, size 0x8, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::ControlItem_InputControlLayout_Flags get_flags();

  /// @brief Method get_format, addr 0x461eda4, size 0x8, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::FourCC get_format();

  /// @brief Method get_isArray, addr 0x461a568, size 0x10, virtual false, abstract: false, final false
  inline bool get_isArray();

  /// @brief Method get_isFirstDefinedInThisLayout, addr 0x461ee40, size 0xc, virtual false, abstract: false, final false
  inline bool get_isFirstDefinedInThisLayout();

  /// @brief Method get_isModifyingExistingControl, addr 0x461ee10, size 0xc, virtual false, abstract: false, final false
  inline bool get_isModifyingExistingControl();

  /// @brief Method get_isNoisy, addr 0x461ee1c, size 0xc, virtual false, abstract: false, final false
  inline bool get_isNoisy();

  /// @brief Method get_isSynthetic, addr 0x461ee28, size 0xc, virtual false, abstract: false, final false
  inline bool get_isSynthetic();

  /// @brief Method get_layout, addr 0x461eccc, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::InternedString get_layout();

  /// @brief Method get_maxValue, addr 0x461edfc, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::PrimitiveValue get_maxValue();

  /// @brief Method get_minValue, addr 0x461ede8, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::PrimitiveValue get_minValue();

  /// @brief Method get_name, addr 0x461ecb8, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::InternedString get_name();

  /// @brief Method get_offset, addr 0x461ed74, size 0x8, virtual false, abstract: false, final false
  inline uint32_t get_offset();

  /// @brief Method get_parameters, addr 0x461ed4c, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue> get_parameters();

  /// @brief Method get_processors, addr 0x461ed60, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters> get_processors();

  /// @brief Method get_shortDisplayName, addr 0x461ed14, size 0x8, virtual false, abstract: false, final false
  inline ::StringW get_shortDisplayName();

  /// @brief Method get_sizeInBits, addr 0x461ed94, size 0x8, virtual false, abstract: false, final false
  inline uint32_t get_sizeInBits();

  /// @brief Method get_usages, addr 0x461ed24, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> get_usages();

  /// @brief Method get_useStateFrom, addr 0x461ecf4, size 0x8, virtual false, abstract: false, final false
  inline ::StringW get_useStateFrom();

  /// @brief Method get_variants, addr 0x461ece0, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::InternedString get_variants();

  /// @brief Method set_aliases, addr 0x461ed44, size 0x8, virtual false, abstract: false, final false
  inline void set_aliases(::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> value);

  /// @brief Method set_arraySize, addr 0x461edcc, size 0x8, virtual false, abstract: false, final false
  inline void set_arraySize(int32_t value);

  /// @brief Method set_bit, addr 0x461ed8c, size 0x8, virtual false, abstract: false, final false
  inline void set_bit(uint32_t value);

  /// @brief Method set_defaultState, addr 0x461ede0, size 0x8, virtual false, abstract: false, final false
  inline void set_defaultState(::UnityEngine::InputSystem::Utilities::PrimitiveValue value);

  /// @brief Method set_displayName, addr 0x461ed0c, size 0x8, virtual false, abstract: false, final false
  inline void set_displayName(::StringW value);

  /// @brief Method set_dontReset, addr 0x461cba0, size 0x20, virtual false, abstract: false, final false
  inline void set_dontReset(bool value);

  /// @brief Method set_flags, addr 0x461edbc, size 0x8, virtual false, abstract: false, final false
  inline void set_flags(::UnityEngine::InputSystem::Layouts::ControlItem_InputControlLayout_Flags value);

  /// @brief Method set_format, addr 0x461edac, size 0x8, virtual false, abstract: false, final false
  inline void set_format(::UnityEngine::InputSystem::Utilities::FourCC value);

  /// @brief Method set_isFirstDefinedInThisLayout, addr 0x461cb60, size 0x20, virtual false, abstract: false, final false
  inline void set_isFirstDefinedInThisLayout(bool value);

  /// @brief Method set_isModifyingExistingControl, addr 0x461cb50, size 0x10, virtual false, abstract: false, final false
  inline void set_isModifyingExistingControl(bool value);

  /// @brief Method set_isNoisy, addr 0x461cb80, size 0x20, virtual false, abstract: false, final false
  inline void set_isNoisy(bool value);

  /// @brief Method set_isSynthetic, addr 0x461cbc0, size 0x20, virtual false, abstract: false, final false
  inline void set_isSynthetic(bool value);

  /// @brief Method set_layout, addr 0x461ecd8, size 0x8, virtual false, abstract: false, final false
  inline void set_layout(::UnityEngine::InputSystem::Utilities::InternedString value);

  /// @brief Method set_maxValue, addr 0x461ee08, size 0x8, virtual false, abstract: false, final false
  inline void set_maxValue(::UnityEngine::InputSystem::Utilities::PrimitiveValue value);

  /// @brief Method set_minValue, addr 0x461edf4, size 0x8, virtual false, abstract: false, final false
  inline void set_minValue(::UnityEngine::InputSystem::Utilities::PrimitiveValue value);

  /// @brief Method set_name, addr 0x461ecc4, size 0x8, virtual false, abstract: false, final false
  inline void set_name(::UnityEngine::InputSystem::Utilities::InternedString value);

  /// @brief Method set_offset, addr 0x461ed7c, size 0x8, virtual false, abstract: false, final false
  inline void set_offset(uint32_t value);

  /// @brief Method set_parameters, addr 0x461ed58, size 0x8, virtual false, abstract: false, final false
  inline void set_parameters(::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue> value);

  /// @brief Method set_processors, addr 0x461ed6c, size 0x8, virtual false, abstract: false, final false
  inline void set_processors(::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters> value);

  /// @brief Method set_shortDisplayName, addr 0x461ed1c, size 0x8, virtual false, abstract: false, final false
  inline void set_shortDisplayName(::StringW value);

  /// @brief Method set_sizeInBits, addr 0x461ed9c, size 0x8, virtual false, abstract: false, final false
  inline void set_sizeInBits(uint32_t value);

  /// @brief Method set_usages, addr 0x461ed30, size 0x8, virtual false, abstract: false, final false
  inline void set_usages(::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> value);

  /// @brief Method set_useStateFrom, addr 0x461ecfc, size 0x8, virtual false, abstract: false, final false
  inline void set_useStateFrom(::StringW value);

  /// @brief Method set_variants, addr 0x461ecec, size 0x8, virtual false, abstract: false, final false
  inline void set_variants(::UnityEngine::InputSystem::Utilities::InternedString value);

  // Ctor Parameters []
  // @brief default ctor
  constexpr InputControlLayout_ControlItem();

  // Ctor Parameters [CppParam { name: "_name_k__BackingField", ty: "::UnityEngine::InputSystem::Utilities::InternedString", modifiers: "", def_value: None }, CppParam { name:
  // "_layout_k__BackingField", ty: "::UnityEngine::InputSystem::Utilities::InternedString", modifiers: "", def_value: None }, CppParam { name: "_variants_k__BackingField", ty:
  // "::UnityEngine::InputSystem::Utilities::InternedString", modifiers: "", def_value: None }, CppParam { name: "_useStateFrom_k__BackingField", ty: "::StringW", modifiers: "", def_value: None },
  // CppParam { name: "_displayName_k__BackingField", ty: "::StringW", modifiers: "", def_value: None }, CppParam { name: "_shortDisplayName_k__BackingField", ty: "::StringW", modifiers: "",
  // def_value: None }, CppParam { name: "_usages_k__BackingField", ty: "::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString>", modifiers: "",
  // def_value: None }, CppParam { name: "_aliases_k__BackingField", ty: "::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString>", modifiers: "",
  // def_value: None }, CppParam { name: "_parameters_k__BackingField", ty: "::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue>", modifiers: "",
  // def_value: None }, CppParam { name: "_processors_k__BackingField", ty: "::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters>",
  // modifiers: "", def_value: None }, CppParam { name: "_offset_k__BackingField", ty: "uint32_t", modifiers: "", def_value: None }, CppParam { name: "_bit_k__BackingField", ty: "uint32_t", modifiers:
  // "", def_value: None }, CppParam { name: "_sizeInBits_k__BackingField", ty: "uint32_t", modifiers: "", def_value: None }, CppParam { name: "_format_k__BackingField", ty:
  // "::UnityEngine::InputSystem::Utilities::FourCC", modifiers: "", def_value: None }, CppParam { name: "_flags_k__BackingField", ty:
  // "::UnityEngine::InputSystem::Layouts::ControlItem_InputControlLayout_Flags", modifiers: "", def_value: None }, CppParam { name: "_arraySize_k__BackingField", ty: "int32_t", modifiers: "",
  // def_value: None }, CppParam { name: "_defaultState_k__BackingField", ty: "::UnityEngine::InputSystem::Utilities::PrimitiveValue", modifiers: "", def_value: None }, CppParam { name:
  // "_minValue_k__BackingField", ty: "::UnityEngine::InputSystem::Utilities::PrimitiveValue", modifiers: "", def_value: None }, CppParam { name: "_maxValue_k__BackingField", ty:
  // "::UnityEngine::InputSystem::Utilities::PrimitiveValue", modifiers: "", def_value: None }]
  constexpr InputControlLayout_ControlItem(::UnityEngine::InputSystem::Utilities::InternedString _name_k__BackingField, ::UnityEngine::InputSystem::Utilities::InternedString _layout_k__BackingField,
                                           ::UnityEngine::InputSystem::Utilities::InternedString _variants_k__BackingField, ::StringW _useStateFrom_k__BackingField,
                                           ::StringW _displayName_k__BackingField, ::StringW _shortDisplayName_k__BackingField,
                                           ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> _usages_k__BackingField,
                                           ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> _aliases_k__BackingField,
                                           ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue> _parameters_k__BackingField,
                                           ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters> _processors_k__BackingField,
                                           uint32_t _offset_k__BackingField, uint32_t _bit_k__BackingField, uint32_t _sizeInBits_k__BackingField,
                                           ::UnityEngine::InputSystem::Utilities::FourCC _format_k__BackingField,
                                           ::UnityEngine::InputSystem::Layouts::ControlItem_InputControlLayout_Flags _flags_k__BackingField, int32_t _arraySize_k__BackingField,
                                           ::UnityEngine::InputSystem::Utilities::PrimitiveValue _defaultState_k__BackingField,
                                           ::UnityEngine::InputSystem::Utilities::PrimitiveValue _minValue_k__BackingField,
                                           ::UnityEngine::InputSystem::Utilities::PrimitiveValue _maxValue_k__BackingField) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 7007 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0xd0 };

  /// @brief Field <name>k__BackingField, offset: 0x0, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::InternedString _name_k__BackingField;

  /// @brief Field <layout>k__BackingField, offset: 0x10, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::InternedString _layout_k__BackingField;

  /// @brief Field <variants>k__BackingField, offset: 0x20, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::InternedString _variants_k__BackingField;

  /// @brief Field <useStateFrom>k__BackingField, offset: 0x30, size: 0x8, def value: None
  ::StringW _useStateFrom_k__BackingField;

  /// @brief Field <displayName>k__BackingField, offset: 0x38, size: 0x8, def value: None
  ::StringW _displayName_k__BackingField;

  /// @brief Field <shortDisplayName>k__BackingField, offset: 0x40, size: 0x8, def value: None
  ::StringW _shortDisplayName_k__BackingField;

  /// @brief Field <usages>k__BackingField, offset: 0x48, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> _usages_k__BackingField;

  /// @brief Field <aliases>k__BackingField, offset: 0x58, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::InternedString> _aliases_k__BackingField;

  /// @brief Field <parameters>k__BackingField, offset: 0x68, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NamedValue> _parameters_k__BackingField;

  /// @brief Field <processors>k__BackingField, offset: 0x78, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Utilities::NameAndParameters> _processors_k__BackingField;

  /// @brief Field <offset>k__BackingField, offset: 0x88, size: 0x4, def value: None
  uint32_t _offset_k__BackingField;

  /// @brief Field <bit>k__BackingField, offset: 0x8c, size: 0x4, def value: None
  uint32_t _bit_k__BackingField;

  /// @brief Field <sizeInBits>k__BackingField, offset: 0x90, size: 0x4, def value: None
  uint32_t _sizeInBits_k__BackingField;

  /// @brief Field <format>k__BackingField, offset: 0x94, size: 0x4, def value: None
  ::UnityEngine::InputSystem::Utilities::FourCC _format_k__BackingField;

  /// @brief Field <flags>k__BackingField, offset: 0x98, size: 0x4, def value: None
  ::UnityEngine::InputSystem::Layouts::ControlItem_InputControlLayout_Flags _flags_k__BackingField;

  /// @brief Field <arraySize>k__BackingField, offset: 0x9c, size: 0x4, def value: None
  int32_t _arraySize_k__BackingField;

  /// @brief Field <defaultState>k__BackingField, offset: 0xa0, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::PrimitiveValue _defaultState_k__BackingField;

  /// @brief Field <minValue>k__BackingField, offset: 0xb0, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::PrimitiveValue _minValue_k__BackingField;

  /// @brief Field <maxValue>k__BackingField, offset: 0xc0, size: 0x10, def value: None
  ::UnityEngine::InputSystem::Utilities::PrimitiveValue _maxValue_k__BackingField;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _name_k__BackingField) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _layout_k__BackingField) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _variants_k__BackingField) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _useStateFrom_k__BackingField) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _displayName_k__BackingField) == 0x38, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _shortDisplayName_k__BackingField) == 0x40, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _usages_k__BackingField) == 0x48, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _aliases_k__BackingField) == 0x58, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _parameters_k__BackingField) == 0x68, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _processors_k__BackingField) == 0x78, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _offset_k__BackingField) == 0x88, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _bit_k__BackingField) == 0x8c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _sizeInBits_k__BackingField) == 0x90, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _format_k__BackingField) == 0x94, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _flags_k__BackingField) == 0x98, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _arraySize_k__BackingField) == 0x9c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _defaultState_k__BackingField) == 0xa0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _minValue_k__BackingField) == 0xb0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, _maxValue_k__BackingField) == 0xc0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, 0xd0>, "Size mismatch!");

} // namespace UnityEngine::InputSystem::Layouts
// Dependencies System.Object
namespace UnityEngine::InputSystem::Layouts {
// Is value type: false
// CS Name: UnityEngine.InputSystem.Layouts.InputControlLayout/Builder/ControlBuilder/<>c
class CORDL_TYPE ControlBuilder_Builder_InputControlLayout___c : public ::System::Object {
public:
  // Declarations
  /// @brief Field <>9, offset 0xffffffff, size 0x8
  __declspec(property(get = getStaticF___9, put = setStaticF___9)) ::UnityEngine::InputSystem::Layouts::ControlBuilder_Builder_InputControlLayout___c* __9;

  /// @brief Field <>9__14_0, offset 0xffffffff, size 0x8
  __declspec(property(get = getStaticF___9__14_0, put = setStaticF___9__14_0)) ::System::Func_2<::StringW, ::UnityEngine::InputSystem::Utilities::InternedString>* __9__14_0;

  static inline ::UnityEngine::InputSystem::Layouts::ControlBuilder_Builder_InputControlLayout___c* New_ctor();

  /// @brief Method <WithUsages>b__14_0, addr 0x461fdd0, size 0x28, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::InternedString _WithUsages_b__14_0(::StringW x);

  /// @brief Method .ctor, addr 0x461fdc8, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

  static inline ::UnityEngine::InputSystem::Layouts::ControlBuilder_Builder_InputControlLayout___c* getStaticF___9();

  static inline ::System::Func_2<::StringW, ::UnityEngine::InputSystem::Utilities::InternedString>* getStaticF___9__14_0();

  static inline void setStaticF___9(::UnityEngine::InputSystem::Layouts::ControlBuilder_Builder_InputControlLayout___c* value);

  static inline void setStaticF___9__14_0(::System::Func_2<::StringW, ::UnityEngine::InputSystem::Utilities::InternedString>* value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr ControlBuilder_Builder_InputControlLayout___c();

public:
  // Ctor Parameters [CppParam { name: "", ty: "ControlBuilder_Builder_InputControlLayout___c", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  ControlBuilder_Builder_InputControlLayout___c(ControlBuilder_Builder_InputControlLayout___c&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "ControlBuilder_Builder_InputControlLayout___c", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  ControlBuilder_Builder_InputControlLayout___c(ControlBuilder_Builder_InputControlLayout___c const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 7008 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::InputSystem::Layouts::ControlBuilder_Builder_InputControlLayout___c, 0x10>, "Size mismatch!");

} // namespace UnityEngine::InputSystem::Layouts
// Dependencies
namespace UnityEngine::InputSystem::Layouts {
// Is value type: true
// CS Name: UnityEngine.InputSystem.Layouts.InputControlLayout/Builder/ControlBuilder
struct CORDL_TYPE Builder_InputControlLayout_ControlBuilder {
public:
  // Declarations
  using __c = ::UnityEngine::InputSystem::Layouts::ControlBuilder_Builder_InputControlLayout___c;

  /// @brief Method AsArrayOfControlsWithSize, addr 0x461fd24, size 0x48, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder AsArrayOfControlsWithSize(int32_t arraySize);

  /// @brief Method DontReset, addr 0x461f6b0, size 0x60, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder DontReset(bool value);

  /// @brief Method IsNoisy, addr 0x461f650, size 0x60, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder IsNoisy(bool value);

  /// @brief Method IsSynthetic, addr 0x461f5f0, size 0x60, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder IsSynthetic(bool value);

  /// @brief Method UsingStateFrom, addr 0x461fcc0, size 0x64, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder UsingStateFrom(::StringW path);

  /// @brief Method WithBitOffset, addr 0x461f5a8, size 0x48, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder WithBitOffset(uint32_t bit);

  /// @brief Method WithByteOffset, addr 0x461f560, size 0x48, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder WithByteOffset(uint32_t offset);

  /// @brief Method WithDefaultState, addr 0x461fc78, size 0x48, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder WithDefaultState(::UnityEngine::InputSystem::Utilities::PrimitiveValue value);

  /// @brief Method WithDisplayName, addr 0x461f3b4, size 0x48, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder WithDisplayName(::StringW displayName);

  /// @brief Method WithFormat, addr 0x461f52c, size 0x34, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder WithFormat(::StringW format);

  /// @brief Method WithFormat, addr 0x461f4e4, size 0x48, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder WithFormat(::UnityEngine::InputSystem::Utilities::FourCC format);

  /// @brief Method WithLayout, addr 0x461f3fc, size 0xe8, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder WithLayout(::StringW layout);

  /// @brief Method WithParameters, addr 0x461faec, size 0xb8, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder WithParameters(::StringW parameters);

  /// @brief Method WithProcessors, addr 0x461fba4, size 0xd4, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder WithProcessors(::StringW processors);

  /// @brief Method WithRange, addr 0x461f758, size 0x9c, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder WithRange(float_t minValue, float_t maxValue);

  /// @brief Method WithSizeInBits, addr 0x461f710, size 0x48, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder WithSizeInBits(uint32_t sizeInBits);

  /// @brief Method WithUsages, addr 0x461fae8, size 0x4, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder WithUsages(::ArrayW<::StringW, ::Array<::StringW>*> usages);

  /// @brief Method WithUsages, addr 0x461f7f4, size 0x1d0, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder
  WithUsages(::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString, ::Array<::UnityEngine::InputSystem::Utilities::InternedString>*> usages);

  /// @brief Method WithUsages, addr 0x461f9c4, size 0x124, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder WithUsages(::System::Collections::Generic::IEnumerable_1<::StringW>* usages);

  // Ctor Parameters []
  // @brief default ctor
  constexpr Builder_InputControlLayout_ControlBuilder();

  // Ctor Parameters [CppParam { name: "builder", ty: "::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder*", modifiers: "", def_value: None }, CppParam { name: "index", ty: "int32_t",
  // modifiers: "", def_value: None }]
  constexpr Builder_InputControlLayout_ControlBuilder(::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder* builder, int32_t index) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 7009 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x10 };

  /// @brief Field builder, offset: 0x0, size: 0x8, def value: None
  ::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder* builder;

  /// @brief Field index, offset: 0x8, size: 0x4, def value: None
  int32_t index;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder, builder) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder, index) == 0x8, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder, 0x10>, "Size mismatch!");

} // namespace UnityEngine::InputSystem::Layouts
// Dependencies System.Nullable`1<T>, System.Object, UnityEngine.InputSystem.Utilities.FourCC
namespace UnityEngine::InputSystem::Layouts {
// Is value type: false
// CS Name: UnityEngine.InputSystem.Layouts.InputControlLayout/Builder
class CORDL_TYPE InputControlLayout_Builder : public ::System::Object {
public:
  // Declarations
  using ControlBuilder = ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder;

  /// @brief Field <displayName>k__BackingField, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get__displayName_k__BackingField, put = __cordl_internal_set__displayName_k__BackingField)) ::StringW _displayName_k__BackingField;

  /// @brief Field <name>k__BackingField, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get__name_k__BackingField, put = __cordl_internal_set__name_k__BackingField)) ::StringW _name_k__BackingField;

  /// @brief Field <stateFormat>k__BackingField, offset 0x28, size 0x4
  __declspec(property(get = __cordl_internal_get__stateFormat_k__BackingField,
                      put = __cordl_internal_set__stateFormat_k__BackingField)) ::UnityEngine::InputSystem::Utilities::FourCC _stateFormat_k__BackingField;

  /// @brief Field <stateSizeInBytes>k__BackingField, offset 0x2c, size 0x4
  __declspec(property(get = __cordl_internal_get__stateSizeInBytes_k__BackingField, put = __cordl_internal_set__stateSizeInBytes_k__BackingField)) int32_t _stateSizeInBytes_k__BackingField;

  /// @brief Field <type>k__BackingField, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get__type_k__BackingField, put = __cordl_internal_set__type_k__BackingField)) ::System::Type* _type_k__BackingField;

  /// @brief Field <updateBeforeRender>k__BackingField, offset 0x38, size 0x2
  __declspec(property(get = __cordl_internal_get__updateBeforeRender_k__BackingField, put = __cordl_internal_set__updateBeforeRender_k__BackingField)) ::System::Nullable_1<bool>
      _updateBeforeRender_k__BackingField;

  __declspec(property(get = get_controls)) ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem> controls;

  __declspec(property(get = get_displayName, put = set_displayName)) ::StringW displayName;

  __declspec(property(get = get_extendsLayout, put = set_extendsLayout)) ::StringW extendsLayout;

  /// @brief Field m_ControlCount, offset 0x3c, size 0x4
  __declspec(property(get = __cordl_internal_get_m_ControlCount, put = __cordl_internal_set_m_ControlCount)) int32_t m_ControlCount;

  /// @brief Field m_Controls, offset 0x40, size 0x8
  __declspec(property(
      get = __cordl_internal_get_m_Controls,
      put =
          __cordl_internal_set_m_Controls)) ::ArrayW<::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, ::Array<::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem>*>
      m_Controls;

  /// @brief Field m_ExtendsLayout, offset 0x30, size 0x8
  __declspec(property(get = __cordl_internal_get_m_ExtendsLayout, put = __cordl_internal_set_m_ExtendsLayout)) ::StringW m_ExtendsLayout;

  __declspec(property(get = get_name, put = set_name)) ::StringW name;

  __declspec(property(get = get_stateFormat, put = set_stateFormat)) ::UnityEngine::InputSystem::Utilities::FourCC stateFormat;

  __declspec(property(get = get_stateSizeInBytes, put = set_stateSizeInBytes)) int32_t stateSizeInBytes;

  __declspec(property(get = get_type, put = set_type)) ::System::Type* type;

  __declspec(property(get = get_updateBeforeRender, put = set_updateBeforeRender)) ::System::Nullable_1<bool> updateBeforeRender;

  /// @brief Method AddControl, addr 0x461ef50, size 0x1a4, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::Builder_InputControlLayout_ControlBuilder AddControl(::StringW name);

  /// @brief Method Build, addr 0x461f180, size 0x22c, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::InputControlLayout* Build();

  /// @brief Method Extend, addr 0x461f148, size 0x38, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder* Extend(::StringW baseLayoutName);

  static inline ::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder* New_ctor();

  /// @brief Method WithDisplayName, addr 0x461f0fc, size 0x8, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder* WithDisplayName(::StringW displayName);

  /// @brief Method WithFormat, addr 0x461f10c, size 0x34, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder* WithFormat(::StringW format);

  /// @brief Method WithFormat, addr 0x461f104, size 0x8, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder* WithFormat(::UnityEngine::InputSystem::Utilities::FourCC format);

  /// @brief Method WithName, addr 0x461f0f4, size 0x8, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder* WithName(::StringW name);

  /// @brief Method WithSizeInBytes, addr 0x461f140, size 0x8, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder* WithSizeInBytes(int32_t sizeInBytes);

  /// @brief Method WithType, addr 0x0, size 0xffffffffffffffff, virtual false, abstract: false, final false
  template <typename T> inline ::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder* WithType();

  constexpr ::StringW const& __cordl_internal_get__displayName_k__BackingField() const;

  constexpr ::StringW& __cordl_internal_get__displayName_k__BackingField();

  constexpr ::StringW const& __cordl_internal_get__name_k__BackingField() const;

  constexpr ::StringW& __cordl_internal_get__name_k__BackingField();

  constexpr ::UnityEngine::InputSystem::Utilities::FourCC const& __cordl_internal_get__stateFormat_k__BackingField() const;

  constexpr ::UnityEngine::InputSystem::Utilities::FourCC& __cordl_internal_get__stateFormat_k__BackingField();

  constexpr int32_t const& __cordl_internal_get__stateSizeInBytes_k__BackingField() const;

  constexpr int32_t& __cordl_internal_get__stateSizeInBytes_k__BackingField();

  constexpr ::System::Type* const& __cordl_internal_get__type_k__BackingField() const;

  constexpr ::System::Type*& __cordl_internal_get__type_k__BackingField();

  constexpr ::System::Nullable_1<bool> const& __cordl_internal_get__updateBeforeRender_k__BackingField() const;

  constexpr ::System::Nullable_1<bool>& __cordl_internal_get__updateBeforeRender_k__BackingField();

  constexpr int32_t const& __cordl_internal_get_m_ControlCount() const;

  constexpr int32_t& __cordl_internal_get_m_ControlCount();

  constexpr ::ArrayW<::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, ::Array<::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem>*> const&
  __cordl_internal_get_m_Controls() const;

  constexpr ::ArrayW<::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, ::Array<::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem>*>&
  __cordl_internal_get_m_Controls();

  constexpr ::StringW const& __cordl_internal_get_m_ExtendsLayout() const;

  constexpr ::StringW& __cordl_internal_get_m_ExtendsLayout();

  constexpr void __cordl_internal_set__displayName_k__BackingField(::StringW value);

  constexpr void __cordl_internal_set__name_k__BackingField(::StringW value);

  constexpr void __cordl_internal_set__stateFormat_k__BackingField(::UnityEngine::InputSystem::Utilities::FourCC value);

  constexpr void __cordl_internal_set__stateSizeInBytes_k__BackingField(int32_t value);

  constexpr void __cordl_internal_set__type_k__BackingField(::System::Type* value);

  constexpr void __cordl_internal_set__updateBeforeRender_k__BackingField(::System::Nullable_1<bool> value);

  constexpr void __cordl_internal_set_m_ControlCount(int32_t value);

  constexpr void
  __cordl_internal_set_m_Controls(::ArrayW<::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, ::Array<::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem>*> value);

  constexpr void __cordl_internal_set_m_ExtendsLayout(::StringW value);

  /// @brief Method .ctor, addr 0x461f3ac, size 0x8, virtual false, abstract: false, final false
  inline void _ctor();

  /// @brief Method get_controls, addr 0x461eee8, size 0x68, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem> get_controls();

  /// @brief Method get_displayName, addr 0x461ee5c, size 0x8, virtual false, abstract: false, final false
  inline ::StringW get_displayName();

  /// @brief Method get_extendsLayout, addr 0x461ee9c, size 0x8, virtual false, abstract: false, final false
  inline ::StringW get_extendsLayout();

  /// @brief Method get_name, addr 0x461ee4c, size 0x8, virtual false, abstract: false, final false
  inline ::StringW get_name();

  /// @brief Method get_stateFormat, addr 0x461ee7c, size 0x8, virtual false, abstract: false, final false
  inline ::UnityEngine::InputSystem::Utilities::FourCC get_stateFormat();

  /// @brief Method get_stateSizeInBytes, addr 0x461ee8c, size 0x8, virtual false, abstract: false, final false
  inline int32_t get_stateSizeInBytes();

  /// @brief Method get_type, addr 0x461ee6c, size 0x8, virtual false, abstract: false, final false
  inline ::System::Type* get_type();

  /// @brief Method get_updateBeforeRender, addr 0x461eed8, size 0x8, virtual false, abstract: false, final false
  inline ::System::Nullable_1<bool> get_updateBeforeRender();

  /// @brief Method set_displayName, addr 0x461ee64, size 0x8, virtual false, abstract: false, final false
  inline void set_displayName(::StringW value);

  /// @brief Method set_extendsLayout, addr 0x461eea4, size 0x34, virtual false, abstract: false, final false
  inline void set_extendsLayout(::StringW value);

  /// @brief Method set_name, addr 0x461ee54, size 0x8, virtual false, abstract: false, final false
  inline void set_name(::StringW value);

  /// @brief Method set_stateFormat, addr 0x461ee84, size 0x8, virtual false, abstract: false, final false
  inline void set_stateFormat(::UnityEngine::InputSystem::Utilities::FourCC value);

  /// @brief Method set_stateSizeInBytes, addr 0x461ee94, size 0x8, virtual false, abstract: false, final false
  inline void set_stateSizeInBytes(int32_t value);

  /// @brief Method set_type, addr 0x461ee74, size 0x8, virtual false, abstract: false, final false
  inline void set_type(::System::Type* value);

  /// @brief Method set_updateBeforeRender, addr 0x461eee0, size 0x8, virtual false, abstract: false, final false
  inline void set_updateBeforeRender(::System::Nullable_1<bool> value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr InputControlLayout_Builder();

public:
  // Ctor Parameters [CppParam { name: "", ty: "InputControlLayout_Builder", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  InputControlLayout_Builder(InputControlLayout_Builder&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "InputControlLayout_Builder", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  InputControlLayout_Builder(InputControlLayout_Builder const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 7010 };

  /// @brief Field <name>k__BackingField, offset: 0x10, size: 0x8, def value: None
  ::StringW ____name_k__BackingField;

  /// @brief Field <displayName>k__BackingField, offset: 0x18, size: 0x8, def value: None
  ::StringW ____displayName_k__BackingField;

  /// @brief Field <type>k__BackingField, offset: 0x20, size: 0x8, def value: None
  ::System::Type* ____type_k__BackingField;

  /// @brief Field <stateFormat>k__BackingField, offset: 0x28, size: 0x4, def value: None
  ::UnityEngine::InputSystem::Utilities::FourCC ____stateFormat_k__BackingField;

  /// @brief Field <stateSizeInBytes>k__BackingField, offset: 0x2c, size: 0x4, def value: None
  int32_t ____stateSizeInBytes_k__BackingField;

  /// @brief Field m_ExtendsLayout, offset: 0x30, size: 0x8, def value: None
  ::StringW ___m_ExtendsLayout;

  /// @brief Field <updateBeforeRender>k__BackingField, offset: 0x38, size: 0x2, def value: None
  ::System::Nullable_1<bool> ____updateBeforeRender_k__BackingField;

  /// @brief Field m_ControlCount, offset: 0x3c, size: 0x4, def value: None
  int32_t ___m_ControlCount;

  /// @brief Field m_Controls, offset: 0x40, size: 0x8, def value: None
  ::ArrayW<::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem, ::Array<::UnityEngine::InputSystem::Layouts::InputControlLayout_ControlItem>*> ___m_Controls;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder, ____name_k__BackingField) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder, ____displayName_k__BackingField) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder, ____type_k__BackingField) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder, ____stateFormat_k__BackingField) == 0x28, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder, ____stateSizeInBytes_k__BackingField) == 0x2c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder, ___m_ExtendsLayout) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder, ____updateBeforeRender_k__BackingField) == 0x38, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder, ___m_ControlCount) == 0x3c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder, ___m_Controls) == 0x40, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::InputSystem::Layouts::InputControlLayout_Builder, 0x48>, "Size mismatch!");

} // namespace UnityEngine::InputSystem::Layouts
// Dependencies
namespace UnityEngine::InputSystem::Layouts {
// Is value type: true
// CS Name: UnityEngine.InputSystem.Layouts.InputControlLayout/Flags
struct CORDL_TYPE InputControlLayout_Flags {
public:
  // Declarations
  using __CORDL_BACKING_ENUM_TYPE = int32_t;

  /// @brief Nested struct __InputControlLayout_Flags_Unwrapped
  enum struct __InputControlLayout_Flags_Unwrapped : int32_t {
    __E_IsGenericTypeOfDevice = static_cast<int32_t>(0x1),
    __E_HideInUI = static_cast<int32_t>(0x2),
    __E_IsOverride = static_cast<int32_t>(0x4),
    __E_CanRunInBackground = static_cast<int32_t>(0x8),
    __E_CanRunInBackgroundIsSet = static_cast<int32_t>(0x10),
    __E_IsNoisy = static_cast<int32_t>(0x20),
  };

  /// @brief Conversion into unwrapped enum value
  constexpr operator __InputControlLayout_Flags_Unwrapped() const noexcept {
    return static_cast<__InputControlLayout_Flags_Unwrapped>(this->value__);
  }

  /// @brief Conversion into unwrapped enum value
  constexpr explicit operator int32_t() const noexcept {
    return static_cast<int32_t>(this->value__);
  }

  // Ctor Parameters []
  // @brief default ctor
  constexpr InputControlLayout_Flags();

  // Ctor Parameters [CppParam { name: "value__", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr InputControlLayout_Flags(int32_t value__) noexcept;

  /// @brief Field CanRunInBackground value: I32(8)
  static ::UnityEngine::InputSystem::Layouts::InputControlLayout_Flags const CanRunInBackground;

  /// @brief Field CanRunInBackgroundIsSet value: I32(16)
  static ::UnityEngine::InputSystem::Layouts::InputControlLayout_Flags const CanRunInBackgroundIsSet;

  /// @brief Field HideInUI value: I32(2)
  static ::UnityEngine::InputSystem::Layouts::InputControlLayout_Flags const HideInUI;

  /// @brief Field IsGenericTypeOfDevice value: I32(1)
  static ::UnityEngine::InputSystem::Layouts::InputControlLayout_Flags const IsGenericTypeOfDevice;

  /// @brief Field IsNoisy value: I32(32)
  static ::UnityEngine::InputSystem::Layouts::InputControlLayout_Flags const IsNoisy;

  /// @brief Field IsOverride value: I32(4)
  static ::UnityEngine::InputSystem::Layouts::InputControlLayout_Flags const IsOverride;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 7011 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x4 };

  /// @brief Field value__, offset: 0x0, size: 0x4, def value: None
  int32_t value__;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::InputSystem::Layouts::InputControlLayout_Flags, value__) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::InputSystem::Layouts::InputControlLayout_Flags, 0x4>, "Size mismatch!");

} // namespace UnityEngine::InputSystem::Layouts
// Dependencies UnityEngine.InputSystem.Layouts.InputDeviceMatcher::MatcherJson
namespace UnityEngine::InputSystem::Layouts {
// Is value type: true
// CS Name: UnityEngine.InputSystem.Layouts.InputControlLayout/LayoutJsonNameAndDescriptorOnly
struct CORDL_TYPE InputControlLayout_LayoutJsonNameAndDescriptorOnly {
public:
  // Declarations
  // Ctor Parameters []
  // @brief default ctor
  constexpr InputControlLayout_LayoutJsonNameAndDescriptorOnly();

  // Ctor Parameters [CppParam { name: "name", ty: "::StringW", modifiers: "", def_value: None }, CppParam { name: "extend", ty: "::StringW", modifiers: "", def_value: None }, CppParam { name:
  // "extendMultiple", ty: "::ArrayW<::StringW,::Array<::StringW>*>", modifiers: "", def_value: None }, CppParam { name: "device", ty:
  // "::UnityEngine::InputSystem::Layouts::InputDeviceMatcher_MatcherJson", modifiers: "", def_value: None }]
  constexpr InputControlLayout_LayoutJsonNameAndDescriptorOnly(::StringW name, ::StringW extend, ::ArrayW<::StringW, ::Array<::StringW>*> extendMultiple,
                                                               ::UnityEngine::InputSystem::Layouts::InputDeviceMatcher_MatcherJson device) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 7012 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x70 };

  /// @brief Field name, offset: 0x0, size: 0x8, def value: None
  ::StringW name;

  /// @brief Field extend, offset: 0x8, size: 0x8, def value: None
  ::StringW extend;

  /// @brief Field extendMultiple, offset: 0x10, size: 0x8, def value: None
  ::ArrayW<::StringW, ::Array<::StringW>*> extendMultiple;

  /// @brief Field device, offset: 0x18, size: 0x58, def value: None
  ::UnityEngine::InputSystem::Layouts::InputDeviceMatcher_MatcherJson device;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
