#pragma once
// IWYU pragma private; include "UnityEngine/ParticleSystem.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__IntPtr_def.hpp"
#include "UnityEngine/zzzz__Color32_def.hpp"
#include "UnityEngine/zzzz__Color_def.hpp"
#include "UnityEngine/zzzz__Component_def.hpp"
#include "UnityEngine/zzzz__ParticleSystemCurveMode_def.hpp"
#include "UnityEngine/zzzz__ParticleSystemGradientMode_def.hpp"
#include "UnityEngine/zzzz__Vector3_def.hpp"
#include <cmath>
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(ParticleSystem)
namespace System::Collections::Generic {
template <typename T> class List_1;
}
namespace System {
struct IntPtr;
}
namespace Unity::Collections {
template <typename T> struct NativeArray_1;
}
namespace Unity::Jobs::LowLevel::Unsafe {
struct JobsUtility_JobScheduleParameters;
}
namespace Unity::Jobs {
struct JobHandle;
}
namespace UnityEngine::Bindings {
struct BlittableArrayWrapper;
}
namespace UnityEngine::Bindings {
struct BlittableListWrapper;
}
namespace UnityEngine::ParticleSystemJobs {
struct NativeParticleData;
}
namespace UnityEngine {
class AnimationCurve;
}
namespace UnityEngine {
struct Color32;
}
namespace UnityEngine {
struct Color;
}
namespace UnityEngine {
class Gradient;
}
namespace UnityEngine {
class MeshRenderer;
}
namespace UnityEngine {
struct ParticleSystemCustomData;
}
namespace UnityEngine {
struct ParticleSystemScalingMode;
}

struct PlaybackState_ParticleSystem_Noise;
}
namespace UnityEngine {
struct PlaybackState_ParticleSystem_Seed;
}
namespace UnityEngine {
struct PlaybackState_ParticleSystem_Seed4;
}
namespace UnityEngine {
struct PlaybackState_ParticleSystem_Shape;
}
namespace UnityEngine {
struct PlaybackState_ParticleSystem_Trail;
}
// Write type traits
MARK_REF_PTR_T(::UnityEngine::ParticleSystem);
MARK_VAL_T(::UnityEngine::ParticleSystem_CollisionModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_ColorBySpeedModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_ColorOverLifetimeModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_CustomDataModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_EmissionModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_EmitParams);
MARK_VAL_T(::UnityEngine::ParticleSystem_ExternalForcesModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_ForceOverLifetimeModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_InheritVelocityModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_LifetimeByEmitterSpeedModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_LightsModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_LimitVelocityOverLifetimeModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_MainModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_MinMaxCurve);
MARK_VAL_T(::UnityEngine::ParticleSystem_MinMaxCurveBlittable);
MARK_VAL_T(::UnityEngine::ParticleSystem_MinMaxGradient);
MARK_VAL_T(::UnityEngine::ParticleSystem_MinMaxGradientBlittable);
MARK_VAL_T(::UnityEngine::ParticleSystem_NoiseModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_Particle);
MARK_VAL_T(::UnityEngine::ParticleSystem_PlaybackState);
MARK_VAL_T(::UnityEngine::ParticleSystem_RotationBySpeedModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_RotationOverLifetimeModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_ShapeModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_SizeBySpeedModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_SizeOverLifetimeModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_SubEmittersModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_TextureSheetAnimationModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_TrailModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_Trails);
MARK_VAL_T(::UnityEngine::ParticleSystem_TriggerModule);
MARK_VAL_T(::UnityEngine::ParticleSystem_VelocityOverLifetimeModule);
MARK_VAL_T(::UnityEngine::PlaybackState_ParticleSystem_Collision);
MARK_VAL_T(::UnityEngine::PlaybackState_ParticleSystem_Emission);
MARK_VAL_T(::UnityEngine::PlaybackState_ParticleSystem_Force);
MARK_VAL_T(::UnityEngine::PlaybackState_ParticleSystem_Initial);
MARK_VAL_T(::UnityEngine::PlaybackState_ParticleSystem_Lights);
MARK_VAL_T(::UnityEngine::PlaybackState_ParticleSystem_Noise);
MARK_VAL_T(::UnityEngine::PlaybackState_ParticleSystem_Seed);
MARK_VAL_T(::UnityEngine::PlaybackState_ParticleSystem_Seed4);
MARK_VAL_T(::UnityEngine::PlaybackState_ParticleSystem_Shape);
MARK_VAL_T(::UnityEngine::PlaybackState_ParticleSystem_Trail);
// Dependencies
namespace UnityEngine {
// Is value type: true
// CS Name: UnityEngine.ParticleSystem/MainModule
struct CORDL_TYPE ParticleSystem_MainModule {
public:
  // Declarations
  __declspec(property(get = get_duration)) float_t duration;

  __declspec(property(get = get_gravityModifierMultiplier, put = set_gravityModifierMultiplier)) float_t gravityModifierMultiplier;

  __declspec(property(get = get_loop, put = set_loop)) bool loop;

  __declspec(property(get = get_maxParticles, put = set_maxParticles)) int32_t maxParticles;

  __declspec(property(get = get_playOnAwake, put = set_playOnAwake)) bool playOnAwake;

  __declspec(property(get = get_scalingMode, put = set_scalingMode)) ::UnityEngine::ParticleSystemScalingMode scalingMode;

  __declspec(property(get = get_simulationSpace, put = set_simulationSpace)) ::UnityEngine::ParticleSystemSimulationSpace simulationSpace;

  __declspec(property(get = get_simulationSpeed, put = set_simulationSpeed)) float_t simulationSpeed;

  __declspec(property(get = get_startColor, put = set_startColor)) ::UnityEngine::ParticleSystem_MinMaxGradient startColor;

  __declspec(property(get = get_startColorBlittable, put = set_startColorBlittable)) ::UnityEngine::ParticleSystem_MinMaxGradientBlittable startColorBlittable;

  __declspec(property(get = get_startDelayMultiplier, put = set_startDelayMultiplier)) float_t startDelayMultiplier;

  __declspec(property(put = set_startLifetime)) ::UnityEngine::ParticleSystem_MinMaxCurve startLifetime;

  __declspec(property(put = set_startLifetimeBlittable)) ::UnityEngine::ParticleSystem_MinMaxCurveBlittable startLifetimeBlittable;

  __declspec(property(get = get_startLifetimeMultiplier, put = set_startLifetimeMultiplier)) float_t startLifetimeMultiplier;

  __declspec(property(get = get_startRotationMultiplier, put = set_startRotationMultiplier)) float_t startRotationMultiplier;

  __declspec(property(get = get_startRotationXMultiplier, put = set_startRotationXMultiplier)) float_t startRotationXMultiplier;

  __declspec(property(get = get_startRotationYMultiplier, put = set_startRotationYMultiplier)) float_t startRotationYMultiplier;

  __declspec(property(get = get_startRotationZMultiplier, put = set_startRotationZMultiplier)) float_t startRotationZMultiplier;

  __declspec(property(get = get_startSizeMultiplier, put = set_startSizeMultiplier)) float_t startSizeMultiplier;

  __declspec(property(put = set_startSpeed)) ::UnityEngine::ParticleSystem_MinMaxCurve startSpeed;

  __declspec(property(put = set_startSpeedBlittable)) ::UnityEngine::ParticleSystem_MinMaxCurveBlittable startSpeedBlittable;

  __declspec(property(get = get_startSpeedMultiplier, put = set_startSpeedMultiplier)) float_t startSpeedMultiplier;

  /// @brief Method .ctor, addr 0x6934d90, size 0x8, virtual false, abstract: false, final false
  inline void _ctor(::UnityEngine::ParticleSystem* particleSystem);

  /// @brief Method get_duration, addr 0x6930a10, size 0x3c, virtual false, abstract: false, final false
  inline float_t get_duration();

  /// @brief Method get_gravityModifierMultiplier, addr 0x69316bc, size 0x3c, virtual false, abstract: false, final false
  inline float_t get_gravityModifierMultiplier();

  /// @brief Method get_loop, addr 0x69307fc, size 0x3c, virtual false, abstract: false, final false
  inline bool get_loop();

  /// @brief Method get_maxParticles, addr 0x69317cc, size 0x3c, virtual false, abstract: false, final false
  inline int32_t get_maxParticles();

  /// @brief Method get_playOnAwake, addr 0x6930908, size 0x3c, virtual false, abstract: false, final false
  inline bool get_playOnAwake();

  /// @brief Method get_scalingMode, addr 0x69319dc, size 0x3c, virtual false, abstract: false, final false
  inline ::UnityEngine::ParticleSystemScalingMode get_scalingMode();

  /// @brief Method get_simulationSpace, addr 0x69318d4, size 0x3c, virtual false, abstract: false, final false
  inline ::UnityEngine::ParticleSystemSimulationSpace get_simulationSpace();

  /// @brief Method get_simulationSpeed, addr 0x6930a8c, size 0x3c, virtual false, abstract: false, final false
  inline float_t get_simulationSpeed();

  /// @brief Method get_startColor, addr 0x6930fe4, size 0x9c, virtual false, abstract: false, final false
  inline ::UnityEngine::ParticleSystem_MinMaxGradient get_startColor();

  /// @brief Method get_startColorBlittable, addr 0x69350bc, size 0x78, virtual false, abstract: false, final false
  inline ::UnityEngine::ParticleSystem_MinMaxGradientBlittable get_startColorBlittable();

  /// @brief Method get_startColorBlittable_Injected, addr 0x69351f8, size 0x44, virtual false, abstract: false, final false
  static inline void get_startColorBlittable_Injected(::ByRef<::UnityEngine::ParticleSystem_MainModule> _unity_self, ::ByRef<::UnityEngine::ParticleSystem_MinMaxGradientBlittable> ret);

  /// @brief Method get_startDelayMultiplier, addr 0x69306e8, size 0x3c, virtual false, abstract: false, final false
  inline float_t get_startDelayMultiplier();

  /// @brief Method get_startLifetimeMultiplier, addr 0x69315ac, size 0x3c, virtual false, abstract: false, final false
  inline float_t get_startLifetimeMultiplier();

  /// @brief Method get_startRotationMultiplier, addr 0x69311a0, size 0x3c, virtual false, abstract: false, final false
  inline float_t get_startRotationMultiplier();

  /// @brief Method get_startRotationXMultiplier, addr 0x6931324, size 0x3c, virtual false, abstract: false, final false
  inline float_t get_startRotationXMultiplier();

  /// @brief Method get_startRotationYMultiplier, addr 0x6931360, size 0x3c, virtual false, abstract: false, final false
  inline float_t get_startRotationYMultiplier();

  /// @brief Method get_startRotationZMultiplier, addr 0x693139c, size 0x3c, virtual false, abstract: false, final false
  inline float_t get_startRotationZMultiplier();

  /// @brief Method get_startSizeMultiplier, addr 0x6930eec, size 0x3c, virtual false, abstract: false, final false
  inline float_t get_startSizeMultiplier();

  /// @brief Method get_startSpeedMultiplier, addr 0x6930ddc, size 0x3c, virtual false, abstract: false, final false
  inline float_t get_startSpeedMultiplier();

  /// @brief Method set_gravityModifierMultiplier, addr 0x6931740, size 0x4c, virtual false, abstract: false, final false
  inline void set_gravityModifierMultiplier(float_t value);

  /// @brief Method set_loop, addr 0x6930880, size 0x44, virtual false, abstract: false, final false
  inline void set_loop(bool value);

  /// @brief Method set_maxParticles, addr 0x6931850, size 0x44, virtual false, abstract: false, final false
  inline void set_maxParticles(int32_t value);

  /// @brief Method set_playOnAwake, addr 0x693098c, size 0x44, virtual false, abstract: false, final false
  inline void set_playOnAwake(bool value);

  /// @brief Method set_scalingMode, addr 0x6931a60, size 0x44, virtual false, abstract: false, final false
  inline void set_scalingMode(::UnityEngine::ParticleSystemScalingMode value);

  /// @brief Method set_simulationSpace, addr 0x6931958, size 0x44, virtual false, abstract: false, final false
  inline void set_simulationSpace(::UnityEngine::ParticleSystemSimulationSpace value);

  /// @brief Method set_simulationSpeed, addr 0x6930b10, size 0x4c, virtual false, abstract: false, final false
  inline void set_simulationSpeed(float_t value);

  /// @brief Method set_startColor, addr 0x69310e0, size 0x80, virtual false, abstract: false, final false
  inline void set_startColor(::UnityEngine::ParticleSystem_MinMaxGradient value);

  /// @brief Method set_startColorBlittable, addr 0x69351b4, size 0x44, virtual false, abstract: false, final false
  inline void set_startColorBlittable(::UnityEngine::ParticleSystem_MinMaxGradientBlittable value);

  /// @brief Method set_startColorBlittable_Injected, addr 0x693523c, size 0x44, virtual false, abstract: false, final false
  static inline void set_startColorBlittable_Injected(::ByRef<::UnityEngine::ParticleSystem_MainModule> _unity_self, ::ByRef<::UnityEngine::ParticleSystem_MinMaxGradientBlittable> value);

  /// @brief Method set_startDelayMultiplier, addr 0x693076c, size 0x4c, virtual false, abstract: false, final false
  inline void set_startDelayMultiplier(float_t value);

  /// @brief Method set_startLifetime, addr 0x6934ea4, size 0x70, virtual false, abstract: false, final false
  inline void set_startLifetime(::UnityEngine::ParticleSystem_MinMaxCurve value);

  /// @brief Method set_startLifetimeBlittable, addr 0x6934f3c, size 0x44, virtual false, abstract: false, final false
  inline void set_startLifetimeBlittable(::UnityEngine::ParticleSystem_MinMaxCurveBlittable value);

  /// @brief Method set_startLifetimeBlittable_Injected, addr 0x6934f80, size 0x44, virtual false, abstract: false, final false
  static inline void set_startLifetimeBlittable_Injected(::ByRef<::UnityEngine::ParticleSystem_MainModule> _unity_self, ::ByRef<::UnityEngine::ParticleSystem_MinMaxCurveBlittable> value);

  /// @brief Method set_startLifetimeMultiplier, addr 0x6931630, size 0x4c, virtual false, abstract: false, final false
  inline void set_startLifetimeMultiplier(float_t value);

  /// @brief Method set_startRotationMultiplier, addr 0x6931224, size 0x4c, virtual false, abstract: false, final false
  inline void set_startRotationMultiplier(float_t value);

  /// @brief Method set_startRotationXMultiplier, addr 0x6931488, size 0x4c, virtual false, abstract: false, final false
  inline void set_startRotationXMultiplier(float_t value);

  /// @brief Method set_startRotationYMultiplier, addr 0x69314d4, size 0x4c, virtual false, abstract: false, final false
  inline void set_startRotationYMultiplier(float_t value);

  /// @brief Method set_startRotationZMultiplier, addr 0x6931520, size 0x4c, virtual false, abstract: false, final false
  inline void set_startRotationZMultiplier(float_t value);

  /// @brief Method set_startSizeMultiplier, addr 0x6930f70, size 0x4c, virtual false, abstract: false, final false
  inline void set_startSizeMultiplier(float_t value);

  /// @brief Method set_startSpeed, addr 0x6934fc4, size 0x70, virtual false, abstract: false, final false
  inline void set_startSpeed(::UnityEngine::ParticleSystem_MinMaxCurve value);

  /// @brief Method set_startSpeedBlittable, addr 0x6935034, size 0x44, virtual false, abstract: false, final false
  inline void set_startSpeedBlittable(::UnityEngine::ParticleSystem_MinMaxCurveBlittable value);

  /// @brief Method set_startSpeedBlittable_Injected, addr 0x6935078, size 0x44, virtual false, abstract: false, final false
  static inline void set_startSpeedBlittable_Injected(::ByRef<::UnityEngine::ParticleSystem_MainModule> _unity_self, ::ByRef<::UnityEngine::ParticleSystem_MinMaxCurveBlittable> value);

  /// @brief Method set_startSpeedMultiplier, addr 0x6930e60, size 0x4c, virtual false, abstract: false, final false
  inline void set_startSpeedMultiplier(float_t value);

  // Ctor Parameters []
  // @brief default ctor
  constexpr ParticleSystem_MainModule();

  // Ctor Parameters [CppParam { name: "m_ParticleSystem", ty: "::UnityW<::UnityEngine::ParticleSystem>", modifiers: "", def_value: None }]
  constexpr ParticleSystem_MainModule(::UnityW<::UnityEngine::ParticleSystem> m_ParticleSystem) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 20578 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x8 };

  /// @brief Field m_ParticleSystem, offset: 0x0, size: 0x8, def value: None
  ::UnityW<::UnityEngine::ParticleSystem> m_ParticleSystem;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::ParticleSystem_MainModule, m_ParticleSystem) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::ParticleSystem_MainModule, 0x8>, "Size mismatch!");

} // namespace UnityEngine
// Dependencies
namespace UnityEngine {
// Is value type: true
// CS Name: UnityEngine.ParticleSystem/EmissionModule
struct CORDL_TYPE ParticleSystem_EmissionModule {
public:
  // Declarations
  __declspec(property(get = get_enabled, put = set_enabled)) bool enabled;

  __declspec(property(put = set_rateOverTime)) ::UnityEngine::ParticleSystem_MinMaxCurve rateOverTime;

  __declspec(property(put = set_rateOverTimeBlittable)) ::UnityEngine::ParticleSystem_MinMaxCurveBlittable rateOverTimeBlittable;

  __declspec(property(get = get_rateOverTimeMultiplier)) float_t rateOverTimeMultiplier;

  /// @brief Method .ctor, addr 0x6934d98, size 0x8, virtual false, abstract: false, final false
  inline void _ctor(::UnityEngine::ParticleSystem* particleSystem);

  /// @brief Method get_enabled, addr 0x6930ba4, size 0x3c, virtual false, abstract: false, final false
  inline bool get_enabled();

  /// @brief Method get_rateOverTimeMultiplier, addr 0x6930cac, size 0x3c, virtual false, abstract: false, final false
  inline float_t get_rateOverTimeMultiplier();

  /// @brief Method set_enabled, addr 0x6930c28, size 0x44, virtual false, abstract: false, final false
  inline void set_enabled(bool value);

  /// @brief Method set_rateOverTime, addr 0x6930d2c, size 0x70, virtual false, abstract: false, final false
  inline void set_rateOverTime(::UnityEngine::ParticleSystem_MinMaxCurve value);

  /// @brief Method set_rateOverTimeBlittable, addr 0x6935280, size 0x44, virtual false, abstract: false, final false
  inline void set_rateOverTimeBlittable(::UnityEngine::ParticleSystem_MinMaxCurveBlittable value);

  /// @brief Method set_rateOverTimeBlittable_Injected, addr 0x69352c4, size 0x44, virtual false, abstract: false, final false
  static inline void set_rateOverTimeBlittable_Injected(::ByRef<::UnityEngine::ParticleSystem_EmissionModule> _unity_self, ::ByRef<::UnityEngine::ParticleSystem_MinMaxCurveBlittable> value);

  // Ctor Parameters []
  // @brief default ctor
  constexpr ParticleSystem_EmissionModule();

  // Ctor Parameters [CppParam { name: "m_ParticleSystem", ty: "::UnityW<::UnityEngine::ParticleSystem>", modifiers: "", def_value: None }]
  constexpr ParticleSystem_EmissionModule(::UnityW<::UnityEngine::ParticleSystem> m_ParticleSystem) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 20579 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x8 };

  /// @brief Field m_ParticleSystem, offset: 0x0, size: 0x8, def value: None
  ::UnityW<::UnityEngine::ParticleSystem> m_ParticleSystem;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::ParticleSystem_EmissionModule, m_ParticleSystem) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::ParticleSystem_EmissionModule, 0x8>, "Size mismatch!");

} // namespace UnityEngine
// Dependencies
namespace UnityEngine {
// Is value type: true
// CS Name: UnityEngine.ParticleSystem/ShapeModule
struct CORDL_TYPE ParticleSystem_ShapeModule {
public:
  // Declarations
  __declspec(property(get = get_meshRenderer, put = set_meshRenderer)) ::UnityW<::UnityEngine::MeshRenderer> meshRenderer;

  __declspec(property(put = set_rotation)) ::UnityEngine::Vector3 rotation;

  /// @brief Method .ctor, addr 0x6934da4, size 0x8, virtual false, abstract: false, final false
  inline void _ctor(::UnityEngine::ParticleSystem* particleSystem);

  /// @brief Method get_meshRenderer, addr 0x6935308, size 0x120, virtual false, abstract: false, final false
  inline ::UnityW<::UnityEngine::MeshRenderer> get_meshRenderer();

  /// @brief Method get_meshRenderer_Injected, addr 0x6935428, size 0x3c, virtual false, abstract: false, final false
  static inline ::System::IntPtr get_meshRenderer_Injected(::ByRef<::UnityEngine::ParticleSystem_ShapeModule> _unity_self);

  /// @brief Method set_meshRenderer, addr 0x6935464, size 0x90, virtual false, abstract: false, final false
  inline void set_meshRenderer(::UnityEngine::MeshRenderer* value);

  /// @brief Method set_meshRenderer_Injected, addr 0x69354f4, size 0x44, virtual false, abstract: false, final false
  static inline void set_meshRenderer_Injected(::ByRef<::UnityEngine::ParticleSystem_ShapeModule> _unity_self, ::System::IntPtr value);

  /// @brief Method set_rotation, addr 0x6935538, size 0x54, virtual false, abstract: false, final false
  inline void set_rotation(::UnityEngine::Vector3 value);

  /// @brief Method set_rotation_Injected, addr 0x693558c, size 0x44, virtual false, abstract: false, final false
  static inline void set_rotation_Injected(::ByRef<::UnityEngine::ParticleSystem_ShapeModule> _unity_self, ::ByRef<::UnityEngine::Vector3> value);

  // Ctor Parameters []
  // @brief default ctor
  constexpr ParticleSystem_ShapeModule();

  // Ctor Parameters [CppParam { name: "m_ParticleSystem", ty: "::UnityW<::UnityEngine::ParticleSystem>", modifiers: "", def_value: None }]
  constexpr ParticleSystem_ShapeModule(::UnityW<::UnityEngine::ParticleSystem> m_ParticleSystem) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 20580 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x8 };

  /// @brief Field m_ParticleSystem, offset: 0x0, size: 0x8, def value: None
  ::UnityW<::UnityEngine::ParticleSystem> m_ParticleSystem;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::ParticleSystem_ShapeModule, m_ParticleSystem) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::ParticleSystem_ShapeModule, 0x8>, "Size mismatch!");

} // namespace UnityEngine
// Dependencies
namespace UnityEngine {
// Is value type: true
// CS Name: UnityEngine.ParticleSystem/CollisionModule
struct CORDL_TYPE ParticleSystem_CollisionModule {
public:
  // Declarations
  /// @brief Method .ctor, addr 0x6934e4c, size 0x8, virtual false, abstract: false, final false
  inline void _ctor(::UnityEngine::ParticleSystem* particleSystem);

  // Ctor Parameters []
  // @brief default ctor
  constexpr ParticleSystem_CollisionModule();

  // Ctor Parameters [CppParam { name: "m_ParticleSystem", ty: "::UnityW<::UnityEngine::ParticleSystem>", modifiers: "", def_value: None }]
  constexpr ParticleSystem_CollisionModule(::UnityW<::UnityEngine::ParticleSystem> m_ParticleSystem) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 20581 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x8 };

  /// @brief Field m_ParticleSystem, offset: 0x0, size: 0x8, def value: None
  ::UnityW<::UnityEngine::ParticleSystem> m_ParticleSystem;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::ParticleSystem_CollisionModule, m_ParticleSystem) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::ParticleSystem_CollisionModule, 0x8>, "Size mismatch!");

} // namespace UnityEngine
// Dependencies
namespace UnityEngine {
// Is value type: true
// CS Name: UnityEngine.ParticleSystem/TriggerModule
struct CORDL_TYPE ParticleSystem_TriggerModule {
public:
  // Declarations
  /// @brief Method .ctor, addr 0x6934e58, size 0x8, virtual false, abstract: false, final false
  inline void _ctor(::UnityEngine::ParticleSystem* particleSystem);

  // Ctor Parameters []
  // @brief default ctor
  constexpr ParticleSystem_TriggerModule();

  // Ctor Parameters [CppParam { name: "m_ParticleSystem", ty: "::UnityW<::UnityEngine::ParticleSystem>", modifiers: "", def_value: None }]
  constexpr ParticleSystem_TriggerModule(::UnityW<::UnityEngine::ParticleSystem> m_ParticleSystem) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 20582 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x8 };

  /// @brief Field m_ParticleSystem, offset: 0x0, size: 0x8, def value: None
  ::UnityW<::UnityEngine::ParticleSystem> m_ParticleSystem;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::ParticleSystem_TriggerModule, m_ParticleSystem) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::ParticleSystem_TriggerModule, 0x8>, "Size mismatch!");

} // namespace UnityEngine
// Dependencies
namespace UnityEngine {
// Is value type: true
// CS Name: UnityEngine.ParticleSystem/SubEmittersModule
struct CORDL_TYPE ParticleSystem_SubEmittersModule {
public:
  // Declarations
  __declspec(property(get = get_subEmittersCount)) int32_t subEmittersCount;

  /// @brief Method GetSubEmitterSystem, addr 0x693560c, size 0x128, virtual false, abstract: false, final false
  inline ::UnityW<::UnityEngine::ParticleSystem> GetSubEmitterSystem(int32_t index);

  /// @brief Method GetSubEmitterSystem_Injected, addr 0x6935734, size 0x44, virtual false, abstract: false, final false
  static inline ::System::IntPtr GetSubEmitterSystem_Injected(::ByRef<::UnityEngine::ParticleSystem_SubEmittersModule> _unity_self, int32_t index);

  /// @brief Method .ctor, addr 0x6934e64, size 0x8, virtual false, abstract: false, final false
  inline void _ctor(::UnityEngine::ParticleSystem* particleSystem);

  /// @brief Method get_subEmittersCount, addr 0x69355d0, size 0x3c, virtual false, abstract: false, final false
  inline int32_t get_subEmittersCount();

  // Ctor Parameters []
  // @brief default ctor
  constexpr ParticleSystem_SubEmittersModule();

  // Ctor Parameters [CppParam { name: "m_ParticleSystem", ty: "::UnityW<::UnityEngine::ParticleSystem>", modifiers: "", def_value: None }]
  constexpr ParticleSystem_SubEmittersModule(::UnityW<::UnityEngine::ParticleSystem> m_ParticleSystem) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 20583 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x8 };

  /// @brief Field m_ParticleSystem, offset: 0x0, size: 0x8, def value: None
  ::UnityW<::UnityEngine::ParticleSystem> m_ParticleSystem;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::ParticleSystem_SubEmittersModule, m_ParticleSystem) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::ParticleSystem_SubEmittersModule, 0x8>, "Size mismatch!");

} // namespace UnityEngine
// Dependencies
namespace UnityEngine {
// Is value type: true
// CS Name: UnityEngine.ParticleSystem/TextureSheetAnimationModule
struct CORDL_TYPE ParticleSystem_TextureSheetAnimationModule {
public:
  // Declarations
  /// @brief Method .ctor, addr 0x6934e70, size 0x8, virtual false, abstract: false, final false
  inline void _ctor(::UnityEngine::ParticleSystem* particleSystem);

  // Ctor Parameters []
  // @brief default ctor
  constexpr ParticleSystem_TextureSheetAnimationModule();

  // Ctor Parameters [CppParam { name: "m_ParticleSystem", ty: "::UnityW<::UnityEngine::ParticleSystem>", modifiers: "", def_value: None }]
  constexpr ParticleSystem_TextureSheetAnimationModule(::UnityW<::UnityEngine::ParticleSystem> m_ParticleSystem) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 20584 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x8 };

  /// @brief Field m_ParticleSystem, offset: 0x0, size: 0x8, def value: None
  ::UnityW<::UnityEngine::ParticleSystem> m_ParticleSystem;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::ParticleSystem_TextureSheetAnimationModule, m_ParticleSystem) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::ParticleSystem_TextureSheetAnimationModule, 0x8>, "Size mismatch!");

} // namespace UnityEngine
// Dependencies UnityEngine.Color32, UnityEngine.Vector3
namespace UnityEngine {
// Is value type: true
// CS Name: UnityEngine.ParticleSystem/Particle
struct CORDL_TYPE ParticleSystem_Particle {
public:
  // Declarations
  __declspec(property(put = set_angularVelocity3D)) ::UnityEngine::Vector3 angularVelocity3D;

  __declspec(property(put = set_lifetime)) float_t lifetime;

  __declspec(property(put = set_position)) ::UnityEngine::Vector3 position;

  __declspec(property(put = set_randomSeed)) uint32_t randomSeed;

  __declspec(property(put = set_remainingLifetime)) float_t remainingLifetime;

  __declspec(property(put = set_rotation3D)) ::UnityEngine::Vector3 rotation3D;

  __declspec(property(put = set_startColor)) ::UnityEngine::Color32 startColor;

  __declspec(property(put = set_startLifetime)) float_t startLifetime;

  __declspec(property(put = set_startSize)) float_t startSize;

  __declspec(property(put = set_velocity)) ::UnityEngine::Vector3 velocity;

  /// @brief Method set_angularVelocity3D, addr 0x69305c8, size 0x38, virtual false, abstract: false, final false
  inline void set_angularVelocity3D(::UnityEngine::Vector3 value);

  /// @brief Method set_lifetime, addr 0x6930574, size 0x8, virtual false, abstract: false, final false
  inline void set_lifetime(float_t value);

  /// @brief Method set_position, addr 0x693055c, size 0xc, virtual false, abstract: false, final false
  inline void set_position(::UnityEngine::Vector3 value);

  /// @brief Method set_randomSeed, addr 0x6930608, size 0x8, virtual false, abstract: false, final false
  inline void set_randomSeed(uint32_t value);

  /// @brief Method set_remainingLifetime, addr 0x6935778, size 0x8, virtual false, abstract: false, final false
  inline void set_remainingLifetime(float_t value);

  /// @brief Method set_rotation3D, addr 0x6930590, size 0x38, virtual false, abstract: false, final false
  inline void set_rotation3D(::UnityEngine::Vector3 value);

  /// @brief Method set_startColor, addr 0x6930600, size 0x8, virtual false, abstract: false, final false
  inline void set_startColor(::UnityEngine::Color32 value);

  /// @brief Method set_startLifetime, addr 0x693057c, size 0x8, virtual false, abstract: false, final false
  inline void set_startLifetime(float_t value);

  /// @brief Method set_startSize, addr 0x6930584, size 0xc, virtual false, abstract: false, final false
  inline void set_startSize(float_t value);

  /// @brief Method set_velocity, addr 0x6930568, size 0xc, virtual false, abstract: false, final false
  inline void set_velocity(::UnityEngine::Vector3 value);

  // Ctor Parameters []
  // @brief default ctor
  constexpr ParticleSystem_Particle();

  // Ctor Parameters [CppParam { name: "m_Position", ty: "::UnityEngine::Vector3", modifiers: "", def_value: None }, CppParam { name: "m_Velocity", ty: "::UnityEngine::Vector3", modifiers: "",
  // def_value: None }, CppParam { name: "m_AnimatedVelocity", ty: "::UnityEngine::Vector3", modifiers: "", def_value: None }, CppParam { name: "m_InitialVelocity", ty: "::UnityEngine::Vector3",
  // modifiers: "", def_value: None }, CppParam { name: "m_AxisOfRotation", ty: "::UnityEngine::Vector3", modifiers: "", def_value: None }, CppParam { name: "m_Rotation", ty: "::UnityEngine::Vector3",
  // modifiers: "", def_value: None }, CppParam { name: "m_AngularVelocity", ty: "::UnityEngine::Vector3", modifiers: "", def_value: None }, CppParam { name: "m_StartSize", ty:
  // "::UnityEngine::Vector3", modifiers: "", def_value: None }, CppParam { name: "m_StartColor", ty: "::UnityEngine::Color32", modifiers: "", def_value: None }, CppParam { name: "m_RandomSeed", ty:
  // "uint32_t", modifiers: "", def_value: None }, CppParam { name: "m_ParentRandomSeed", ty: "uint32_t", modifiers: "", def_value: None }, CppParam { name: "m_Lifetime", ty: "float_t", modifiers: "",
  // def_value: None }, CppParam { name: "m_StartLifetime", ty: "float_t", modifiers: "", def_value: None }, CppParam { name: "m_MeshIndex", ty: "int32_t", modifiers: "", def_value: None }, CppParam {
  // name: "m_EmitAccumulator0", ty: "float_t", modifiers: "", def_value: None }, CppParam { name: "m_EmitAccumulator1", ty: "float_t", modifiers: "", def_value: None }, CppParam { name: "m_Flags",
  // ty: "uint32_t", modifiers: "", def_value: None }]
  constexpr ParticleSystem_Particle(::UnityEngine::Vector3 m_Position, ::UnityEngine::Vector3 m_Velocity, ::UnityEngine::Vector3 m_AnimatedVelocity, ::UnityEngine::Vector3 m_InitialVelocity,
                                    ::UnityEngine::Vector3 m_AxisOfRotation, ::UnityEngine::Vector3 m_Rotation, ::UnityEngine::Vector3 m_AngularVelocity, ::UnityEngine::Vector3 m_StartSize,
                                    ::UnityEngine::Color32 m_StartColor, uint32_t m_RandomSeed, uint32_t m_ParentRandomSeed, float_t m_Lifetime, float_t m_StartLifetime, int32_t m_MeshIndex,
                                    float_t m_EmitAccumulator0, float_t m_EmitAccumulator1, uint32_t m_Flags) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 20585 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x84 };

  /// @brief Field m_Position, offset: 0x0, size: 0xc, def value: None
  ::UnityEngine::Vector3 m_Position;

  /// @brief Field m_Velocity, offset: 0xc, size: 0xc, def value: None
  ::UnityEngine::Vector3 m_Velocity;

  /// @brief Field m_AnimatedVelocity, offset: 0x18, size: 0xc, def value: None
  ::UnityEngine::Vector3 m_AnimatedVelocity;

  /// @brief Field m_InitialVelocity, offset: 0x24, size: 0xc, def value: None
  ::UnityEngine::Vector3 m_InitialVelocity;

  /// @brief Field m_AxisOfRotation, offset: 0x30, size: 0xc, def value: None
  ::UnityEngine::Vector3 m_AxisOfRotation;

  /// @brief Field m_Rotation, offset: 0x3c, size: 0xc, def value: None
  ::UnityEngine::Vector3 m_Rotation;

  /// @brief Field m_AngularVelocity, offset: 0x48, size: 0xc, def value: None
  ::UnityEngine::Vector3 m_AngularVelocity;

  /// @brief Field m_StartSize, offset: 0x54, size: 0xc, def value: None
  ::UnityEngine::Vector3 m_StartSize;

  /// @brief Field m_StartColor, offset: 0x60, size: 0x4, def value: None
  ::UnityEngine::Color32 m_StartColor;

  /// @brief Field m_RandomSeed, offset: 0x64, size: 0x4, def value: None
  uint32_t m_RandomSeed;

  /// @brief Field m_ParentRandomSeed, offset: 0x68, size: 0x4, def value: None
  uint32_t m_ParentRandomSeed;

  /// @brief Field m_Lifetime, offset: 0x6c, size: 0x4, def value: None
  float_t m_Lifetime;

  /// @brief Field m_StartLifetime, offset: 0x70, size: 0x4, def value: None
  float_t m_StartLifetime;

  /// @brief Field m_MeshIndex, offset: 0x74, size: 0x4, def value: None
  int32_t m_MeshIndex;

  /// @brief Field m_EmitAccumulator0, offset: 0x78, size: 0x4, def value: None
  float_t m_EmitAccumulator0;

  /// @brief Field m_EmitAccumulator1, offset: 0x7c, size: 0x4, def value: None
  float_t m_EmitAccumulator1;

  /// @brief Field m_Flags, offset: 0x80, size: 0x4, def value: None
  uint32_t m_Flags;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_Position) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_Velocity) == 0xc, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_AnimatedVelocity) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_InitialVelocity) == 0x24, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_AxisOfRotation) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_Rotation) == 0x3c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_AngularVelocity) == 0x48, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_StartSize) == 0x54, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_StartColor) == 0x60, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_RandomSeed) == 0x64, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_ParentRandomSeed) == 0x68, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_Lifetime) == 0x6c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_StartLifetime) == 0x70, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_MeshIndex) == 0x74, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_EmitAccumulator0) == 0x78, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_EmitAccumulator1) == 0x7c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_Particle, m_Flags) == 0x80, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::ParticleSystem_Particle, 0x84>, "Size mismatch!");

} // namespace UnityEngine
// Dependencies UnityEngine.ParticleSystemCurveMode
namespace UnityEngine {
// Is value type: true
// CS Name: UnityEngine.ParticleSystem/MinMaxCurve
struct CORDL_TYPE ParticleSystem_MinMaxCurve {
public:
  // Declarations
  __declspec(property(put = set_constantMax)) float_t constantMax;

  __declspec(property(put = set_constantMin)) float_t constantMin;

  /// @brief Method .ctor, addr 0x6935780, size 0x14, virtual false, abstract: false, final false
  inline void _ctor(float_t constant);

  /// @brief Method .ctor, addr 0x6935794, size 0x1c, virtual false, abstract: false, final false
  inline void _ctor(float_t min, float_t max);

  /// @brief Method op_Implicit, addr 0x6930d18, size 0x14, virtual false, abstract: false, final false
  static inline ::UnityEngine::ParticleSystem_MinMaxCurve op_Implicit___UnityEngine__ParticleSystem_MinMaxCurve(float_t constant);

  /// @brief Method set_constantMax, addr 0x69357b0, size 0x8, virtual false, abstract: false, final false
  inline void set_constantMax(float_t value);

  /// @brief Method set_constantMin, addr 0x69357b8, size 0x8, virtual false, abstract: false, final false
  inline void set_constantMin(float_t value);

  // Ctor Parameters []
  // @brief default ctor
  constexpr ParticleSystem_MinMaxCurve();

  // Ctor Parameters [CppParam { name: "m_Mode", ty: "::UnityEngine::ParticleSystemCurveMode", modifiers: "", def_value: None }, CppParam { name: "m_CurveMultiplier", ty: "float_t", modifiers: "",
  // def_value: None }, CppParam { name: "m_CurveMin", ty: "::UnityEngine::AnimationCurve*", modifiers: "", def_value: None }, CppParam { name: "m_CurveMax", ty: "::UnityEngine::AnimationCurve*",
  // modifiers: "", def_value: None }, CppParam { name: "m_ConstantMin", ty: "float_t", modifiers: "", def_value: None }, CppParam { name: "m_ConstantMax", ty: "float_t", modifiers: "", def_value:
  // None }]
  constexpr ParticleSystem_MinMaxCurve(::UnityEngine::ParticleSystemCurveMode m_Mode, float_t m_CurveMultiplier, ::UnityEngine::AnimationCurve* m_CurveMin, ::UnityEngine::AnimationCurve* m_CurveMax,
                                       float_t m_ConstantMin, float_t m_ConstantMax) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 20586 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x20 };

  /// @brief Field m_Mode, offset: 0x0, size: 0x4, def value: None
  ::UnityEngine::ParticleSystemCurveMode m_Mode;

  /// @brief Field m_CurveMultiplier, offset: 0x4, size: 0x4, def value: None
  float_t m_CurveMultiplier;

  /// @brief Field m_CurveMin, offset: 0x8, size: 0x8, def value: None
  ::UnityEngine::AnimationCurve* m_CurveMin;

  /// @brief Field m_CurveMax, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::AnimationCurve* m_CurveMax;

  /// @brief Field m_ConstantMin, offset: 0x18, size: 0x4, def value: None
  float_t m_ConstantMin;

  /// @brief Field m_ConstantMax, offset: 0x1c, size: 0x4, def value: None
  float_t m_ConstantMax;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxCurve, m_Mode) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxCurve, m_CurveMultiplier) == 0x4, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxCurve, m_CurveMin) == 0x8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxCurve, m_CurveMax) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxCurve, m_ConstantMin) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxCurve, m_ConstantMax) == 0x1c, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::ParticleSystem_MinMaxCurve, 0x20>, "Size mismatch!");

} // namespace UnityEngine
// Dependencies System.IntPtr, UnityEngine.ParticleSystemCurveMode
namespace UnityEngine {
// Is value type: true
// CS Name: UnityEngine.ParticleSystem/MinMaxCurveBlittable
struct CORDL_TYPE ParticleSystem_MinMaxCurveBlittable {
public:
  // Declarations
  /// @brief Method FromMixMaxCurve, addr 0x69357c0, size 0x28, virtual false, abstract: false, final false
  static inline ::UnityEngine::ParticleSystem_MinMaxCurveBlittable FromMixMaxCurve(::ByRef<::UnityEngine::ParticleSystem_MinMaxCurve> minMaxCurve);

  /// @brief Method op_Implicit, addr 0x6934f14, size 0x28, virtual false, abstract: false, final false
  static inline ::UnityEngine::ParticleSystem_MinMaxCurveBlittable op_Implicit___UnityEngine__ParticleSystem_MinMaxCurveBlittable(::UnityEngine::ParticleSystem_MinMaxCurve minMaxCurve);

  // Ctor Parameters []
  // @brief default ctor
  constexpr ParticleSystem_MinMaxCurveBlittable();

  // Ctor Parameters [CppParam { name: "m_Mode", ty: "::UnityEngine::ParticleSystemCurveMode", modifiers: "", def_value: None }, CppParam { name: "m_CurveMultiplier", ty: "float_t", modifiers: "",
  // def_value: None }, CppParam { name: "m_CurveMin", ty: "::System::IntPtr", modifiers: "", def_value: None }, CppParam { name: "m_CurveMax", ty: "::System::IntPtr", modifiers: "", def_value: None
  // }, CppParam { name: "m_ConstantMin", ty: "float_t", modifiers: "", def_value: None }, CppParam { name: "m_ConstantMax", ty: "float_t", modifiers: "", def_value: None }]
  constexpr ParticleSystem_MinMaxCurveBlittable(::UnityEngine::ParticleSystemCurveMode m_Mode, float_t m_CurveMultiplier, ::System::IntPtr m_CurveMin, ::System::IntPtr m_CurveMax,
                                                float_t m_ConstantMin, float_t m_ConstantMax) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 20587 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x20 };

  /// @brief Field m_Mode, offset: 0x0, size: 0x4, def value: None
  ::UnityEngine::ParticleSystemCurveMode m_Mode;

  /// @brief Field m_CurveMultiplier, offset: 0x4, size: 0x4, def value: None
  float_t m_CurveMultiplier;

  /// @brief Field m_CurveMin, offset: 0x8, size: 0x8, def value: None
  ::System::IntPtr m_CurveMin;

  /// @brief Field m_CurveMax, offset: 0x10, size: 0x8, def value: None
  ::System::IntPtr m_CurveMax;

  /// @brief Field m_ConstantMin, offset: 0x18, size: 0x4, def value: None
  float_t m_ConstantMin;

  /// @brief Field m_ConstantMax, offset: 0x1c, size: 0x4, def value: None
  float_t m_ConstantMax;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxCurveBlittable, m_Mode) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxCurveBlittable, m_CurveMultiplier) == 0x4, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxCurveBlittable, m_CurveMin) == 0x8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxCurveBlittable, m_CurveMax) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxCurveBlittable, m_ConstantMin) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxCurveBlittable, m_ConstantMax) == 0x1c, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::ParticleSystem_MinMaxCurveBlittable, 0x20>, "Size mismatch!");

} // namespace UnityEngine
// Dependencies UnityEngine.Color, UnityEngine.ParticleSystemGradientMode
namespace UnityEngine {
// Is value type: true
// CS Name: UnityEngine.ParticleSystem/MinMaxGradient
struct CORDL_TYPE ParticleSystem_MinMaxGradient {
public:
  // Declarations
  __declspec(property(get = get_color)) ::UnityEngine::Color color;

  /// @brief Method .ctor, addr 0x69357e8, size 0x1c, virtual false, abstract: false, final false
  inline void _ctor(::UnityEngine::Color color);

  /// @brief Method get_color, addr 0x6931080, size 0xc, virtual false, abstract: false, final false
  inline ::UnityEngine::Color get_color();

  /// @brief Method op_Implicit, addr 0x69310c4, size 0x1c, virtual false, abstract: false, final false
  static inline ::UnityEngine::ParticleSystem_MinMaxGradient op_Implicit___UnityEngine__ParticleSystem_MinMaxGradient(::UnityEngine::Color color);

  // Ctor Parameters []
  // @brief default ctor
  constexpr ParticleSystem_MinMaxGradient();

  // Ctor Parameters [CppParam { name: "m_Mode", ty: "::UnityEngine::ParticleSystemGradientMode", modifiers: "", def_value: None }, CppParam { name: "m_GradientMin", ty: "::UnityEngine::Gradient*",
  // modifiers: "", def_value: None }, CppParam { name: "m_GradientMax", ty: "::UnityEngine::Gradient*", modifiers: "", def_value: None }, CppParam { name: "m_ColorMin", ty: "::UnityEngine::Color",
  // modifiers: "", def_value: None }, CppParam { name: "m_ColorMax", ty: "::UnityEngine::Color", modifiers: "", def_value: None }]
  constexpr ParticleSystem_MinMaxGradient(::UnityEngine::ParticleSystemGradientMode m_Mode, ::UnityEngine::Gradient* m_GradientMin, ::UnityEngine::Gradient* m_GradientMax,
                                          ::UnityEngine::Color m_ColorMin, ::UnityEngine::Color m_ColorMax) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 20588 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x38 };

  /// @brief Field m_Mode, offset: 0x0, size: 0x4, def value: None
  ::UnityEngine::ParticleSystemGradientMode m_Mode;

  /// @brief Field m_GradientMin, offset: 0x8, size: 0x8, def value: None
  ::UnityEngine::Gradient* m_GradientMin;

  /// @brief Field m_GradientMax, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::Gradient* m_GradientMax;

  /// @brief Field m_ColorMin, offset: 0x18, size: 0x10, def value: None
  ::UnityEngine::Color m_ColorMin;

  /// @brief Field m_ColorMax, offset: 0x28, size: 0x10, def value: None
  ::UnityEngine::Color m_ColorMax;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxGradient, m_Mode) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxGradient, m_GradientMin) == 0x8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxGradient, m_GradientMax) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxGradient, m_ColorMin) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxGradient, m_ColorMax) == 0x28, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::ParticleSystem_MinMaxGradient, 0x38>, "Size mismatch!");

} // namespace UnityEngine
// Dependencies System.IntPtr, UnityEngine.Color, UnityEngine.ParticleSystemGradientMode
namespace UnityEngine {
// Is value type: true
// CS Name: UnityEngine.ParticleSystem/MinMaxGradientBlittable
struct CORDL_TYPE ParticleSystem_MinMaxGradientBlittable {
public:
  // Declarations
  /// @brief Method FromMixMaxGradient, addr 0x69358bc, size 0x44, virtual false, abstract: false, final false
  static inline ::UnityEngine::ParticleSystem_MinMaxGradientBlittable FromMixMaxGradient(::ByRef<::UnityEngine::ParticleSystem_MinMaxGradient> minMaxGradient);

  /// @brief Method ToMinMaxGradient, addr 0x6935804, size 0xb8, virtual false, abstract: false, final false
  static inline ::UnityEngine::ParticleSystem_MinMaxGradient ToMinMaxGradient(::ByRef<::UnityEngine::ParticleSystem_MinMaxGradientBlittable> minMaxGradientBlittable);

  /// @brief Method op_Implicit, addr 0x6935134, size 0x3c, virtual false, abstract: false, final false
  static inline ::UnityEngine::ParticleSystem_MinMaxGradient op_Implicit___UnityEngine__ParticleSystem_MinMaxGradient(::UnityEngine::ParticleSystem_MinMaxGradientBlittable minMaxGradientBlittable);

  /// @brief Method op_Implicit, addr 0x6935170, size 0x44, virtual false, abstract: false, final false
  static inline ::UnityEngine::ParticleSystem_MinMaxGradientBlittable op_Implicit___UnityEngine__ParticleSystem_MinMaxGradientBlittable(::UnityEngine::ParticleSystem_MinMaxGradient minMaxGradient);

  // Ctor Parameters []
  // @brief default ctor
  constexpr ParticleSystem_MinMaxGradientBlittable();

  // Ctor Parameters [CppParam { name: "m_Mode", ty: "::UnityEngine::ParticleSystemGradientMode", modifiers: "", def_value: None }, CppParam { name: "m_GradientMin", ty: "::System::IntPtr", modifiers:
  // "", def_value: None }, CppParam { name: "m_GradientMax", ty: "::System::IntPtr", modifiers: "", def_value: None }, CppParam { name: "m_ColorMin", ty: "::UnityEngine::Color", modifiers: "",
  // def_value: None }, CppParam { name: "m_ColorMax", ty: "::UnityEngine::Color", modifiers: "", def_value: None }]
  constexpr ParticleSystem_MinMaxGradientBlittable(::UnityEngine::ParticleSystemGradientMode m_Mode, ::System::IntPtr m_GradientMin, ::System::IntPtr m_GradientMax, ::UnityEngine::Color m_ColorMin,
                                                   ::UnityEngine::Color m_ColorMax) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 20589 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x38 };

  /// @brief Field m_Mode, offset: 0x0, size: 0x4, def value: None
  ::UnityEngine::ParticleSystemGradientMode m_Mode;

  /// @brief Field m_GradientMin, offset: 0x8, size: 0x8, def value: None
  ::System::IntPtr m_GradientMin;

  /// @brief Field m_GradientMax, offset: 0x10, size: 0x8, def value: None
  ::System::IntPtr m_GradientMax;

  /// @brief Field m_ColorMin, offset: 0x18, size: 0x10, def value: None
  ::UnityEngine::Color m_ColorMin;

  /// @brief Field m_ColorMax, offset: 0x28, size: 0x10, def value: None
  ::UnityEngine::Color m_ColorMax;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxGradientBlittable, m_Mode) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxGradientBlittable, m_GradientMin) == 0x8, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxGradientBlittable, m_GradientMax) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxGradientBlittable, m_ColorMin) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_MinMaxGradientBlittable, m_ColorMax) == 0x28, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::ParticleSystem_MinMaxGradientBlittable, 0x38>, "Size mismatch!");

} // namespace UnityEngine
// Dependencies UnityEngine.ParticleSystem::Particle
namespace UnityEngine {
// Is value type: true
// CS Name: UnityEngine.ParticleSystem/EmitParams
struct CORDL_TYPE ParticleSystem_EmitParams {
public:
  // Declarations
  __declspec(property(put = set_applyShapeToPosition)) bool applyShapeToPosition;

  __declspec(property(put = set_position)) ::UnityEngine::Vector3 position;

  __declspec(property(put = set_rotation3D)) ::UnityEngine::Vector3 rotation3D;

  __declspec(property(put = set_startColor)) ::UnityEngine::Color32 startColor;

  /// @brief Method set_applyShapeToPosition, addr 0x6935914, size 0x8, virtual false, abstract: false, final false
  inline void set_applyShapeToPosition(bool value);

  /// @brief Method set_position, addr 0x6935900, size 0x14, virtual false, abstract: false, final false
  inline void set_position(::UnityEngine::Vector3 value);

  /// @brief Method set_rotation3D, addr 0x693591c, size 0x40, virtual false, abstract: false, final false
  inline void set_rotation3D(::UnityEngine::Vector3 value);

  /// @brief Method set_startColor, addr 0x693595c, size 0x10, virtual false, abstract: false, final false
  inline void set_startColor(::UnityEngine::Color32 value);

  // Ctor Parameters []
  // @brief default ctor
  constexpr ParticleSystem_EmitParams();

  // Ctor Parameters [CppParam { name: "m_Particle", ty: "::UnityEngine::ParticleSystem_Particle", modifiers: "", def_value: None }, CppParam { name: "m_PositionSet", ty: "bool", modifiers: "",
  // def_value: None }, CppParam { name: "m_VelocitySet", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "m_AxisOfRotationSet", ty: "bool", modifiers: "", def_value: None }, CppParam {
  // name: "m_RotationSet", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "m_AngularVelocitySet", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "m_StartSizeSet", ty:
  // "bool", modifiers: "", def_value: None }, CppParam { name: "m_StartColorSet", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "m_RandomSeedSet", ty: "bool", modifiers: "",
  // def_value: None }, CppParam { name: "m_StartLifetimeSet", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "m_MeshIndexSet", ty: "bool", modifiers: "", def_value: None }, CppParam {
  // name: "m_ApplyShapeToPosition", ty: "bool", modifiers: "", def_value: None }]
  constexpr ParticleSystem_EmitParams(::UnityEngine::ParticleSystem_Particle m_Particle, bool m_PositionSet, bool m_VelocitySet, bool m_AxisOfRotationSet, bool m_RotationSet,
                                      bool m_AngularVelocitySet, bool m_StartSizeSet, bool m_StartColorSet, bool m_RandomSeedSet, bool m_StartLifetimeSet, bool m_MeshIndexSet,
                                      bool m_ApplyShapeToPosition) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 20590 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x90 };

  /// @brief Field m_Particle, offset: 0x0, size: 0x84, def value: None
  ::UnityEngine::ParticleSystem_Particle m_Particle;

  /// @brief Field m_PositionSet, offset: 0x84, size: 0x1, def value: None
  bool m_PositionSet;

  /// @brief Field m_VelocitySet, offset: 0x85, size: 0x1, def value: None
  bool m_VelocitySet;

  /// @brief Field m_AxisOfRotationSet, offset: 0x86, size: 0x1, def value: None
  bool m_AxisOfRotationSet;

  /// @brief Field m_RotationSet, offset: 0x87, size: 0x1, def value: None
  bool m_RotationSet;

  /// @brief Field m_AngularVelocitySet, offset: 0x88, size: 0x1, def value: None
  bool m_AngularVelocitySet;

  /// @brief Field m_StartSizeSet, offset: 0x89, size: 0x1, def value: None
  bool m_StartSizeSet;

  /// @brief Field m_StartColorSet, offset: 0x8a, size: 0x1, def value: None
  bool m_StartColorSet;

  /// @brief Field m_RandomSeedSet, offset: 0x8b, size: 0x1, def value: None
  bool m_RandomSeedSet;

  /// @brief Field m_StartLifetimeSet, offset: 0x8c, size: 0x1, def value: None
  bool m_StartLifetimeSet;

  /// @brief Field m_MeshIndexSet, offset: 0x8d, size: 0x1, def value: None
  bool m_MeshIndexSet;

  /// @brief Field m_ApplyShapeToPosition, offset: 0x8e, size: 0x1, def value: None
  bool m_ApplyShapeToPosition;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::ParticleSystem_EmitParams, m_Particle) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_EmitParams, m_PositionSet) == 0x84, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_EmitParams, m_VelocitySet) == 0x85, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_EmitParams, m_AxisOfRotationSet) == 0x86, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_EmitParams, m_RotationSet) == 0x87, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_EmitParams, m_AngularVelocitySet) == 0x88, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_EmitParams, m_StartSizeSet) == 0x89, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_EmitParams, m_StartColorSet) == 0x8a, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_EmitParams, m_RandomSeedSet) == 0x8b, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_EmitParams, m_StartLifetimeSet) == 0x8c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_EmitParams, m_MeshIndexSet) == 0x8d, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::ParticleSystem_EmitParams, m_ApplyShapeToPosition) == 0x8e, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::ParticleSystem_EmitParams, 0x90>, "Size mismatch!");

} // namespace UnityEngine
// Dependencies
namespace UnityEngine {
// Is value type: true
// CS Name: UnityEngine.ParticleSystem/PlaybackState/Seed
struct CORDL_TYPE PlaybackState_ParticleSystem_Seed {
public:
  // Declarations
  // Ctor Parameters []
  // @brief default ctor
  constexpr PlaybackState_ParticleSystem_Seed();

  // Ctor Parameters [CppParam { name: "x", ty: "uint32_t", modifiers: "", def_value: None }, CppParam { name: "y", ty: "uint32_t", modifiers: "", def_value: None }, CppParam { name: "z", ty:
  // "uint32_t", modifiers: "", def_value: None }, CppParam { name: "w", ty: "uint32_t", modifiers: "", def_value: None }]
  constexpr PlaybackState_ParticleSystem_Seed(uint32_t x, uint32_t y, uint32_t z, uint32_t w) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 20591 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x10 };

  /// @brief Field x, offset: 0x0, size: 0x4, def value: None
  uint32_t x;

  /// @brief Field y, offset: 0x4, size: 0x4, def value: None
  uint32_t y;

  /// @brief Field z, offset: 0x8, size: 0x4, def value: None
  uint32_t z;

  /// @brief Field w, offset: 0xc, size: 0x4, def value: None
  uint32_t w;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::PlaybackState_ParticleSystem_Seed, x) == 0x0, "Offset mismatch!");

