#pragma once
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__IntPtr_def.hpp"
#include "System/zzzz__Object_def.hpp"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(Array)
namespace System {
struct __Array__SorterObjectArray;
}
namespace System {
class ArrayTypeMismatchException;
}
namespace System {
template <typename TInput, typename TOutput> class Converter_2;
}
namespace System::Collections {
class IStructuralComparable;
}
namespace System {
template <typename T> struct __Array__InternalEnumerator_1;
}
namespace System {
template <typename T> class __Array__EmptyInternalEnumerator_1;
}
namespace System {
struct __Array__SorterGenericArray;
}
namespace System::Collections {
class IList;
}
namespace System::Collections {
class ICollection;
}
namespace System::Collections {
class IEnumerable;
}
namespace System {
class __Array__ArrayEnumerator;
}
namespace System {
class Type;
}
namespace System {
class ICloneable;
}
namespace System::Collections {
class IComparer;
}
namespace System::Collections::ObjectModel {
template <typename T> class ReadOnlyCollection_1;
}
namespace System::Collections {
class IEqualityComparer;
}
namespace System {
template <typename T> class Action_1;
}
namespace System {
template <typename T> class Comparison_1;
}
namespace System {
template <typename T> class Predicate_1;
}
namespace System::Collections {
class IEnumerator;
}
namespace System {
class __Array__RawData;
}
namespace System::Collections::Generic {
template <typename T> class IEnumerator_1;
}
namespace System {
class Object;
}
namespace System::Collections::Generic {
template <typename T> class IComparer_1;
}
namespace System::Collections {
class IStructuralEquatable;
}
namespace System {
class IDisposable;
}
// Forward declare root types
namespace System {
class Array;
}
namespace System {
class __Array__ArrayEnumerator;
}
namespace System {
template <typename T> class __Array__EmptyInternalEnumerator_1;
}
namespace System {
class __Array__RawData;
}
namespace System {
template <typename T> struct __Array__InternalEnumerator_1;
}
namespace System {
struct __Array__SorterGenericArray;
}
namespace System {
struct __Array__SorterObjectArray;
}
// Write type traits
MARK_REF_PTR_T(::System::Array);
MARK_REF_PTR_T(::System::__Array__ArrayEnumerator);
MARK_GEN_REF_PTR_T(::System::__Array__EmptyInternalEnumerator_1);
MARK_REF_PTR_T(::System::__Array__RawData);
MARK_GEN_VAL_T(::System::__Array__InternalEnumerator_1);
MARK_VAL_T(::System::__Array__SorterGenericArray);
MARK_VAL_T(::System::__Array__SorterObjectArray);
// Type: ::ArrayEnumerator
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 32, calculated_native_size: 32, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace System {
// Is value type: false
// Dependencies: {TypeDefinitionIndex(TypeDefinitionIndex(2611))}
// Self: TypeDefinitionIndex(TypeDefinitionIndex(2528))
// CS Name: ::Array::ArrayEnumerator*
class CORDL_TYPE __Array__ArrayEnumerator : public ::System::Object {
public:
  // Declarations
  /// @brief Field _array, offset 0x10, size 0x8
  __declspec(property(get = __get__array, put = __set__array))::System::Array* _array;

  /// @brief Field _index, offset 0x18, size 0x4
  __declspec(property(get = __get__index, put = __set__index)) int32_t _index;

  /// @brief Field _endIndex, offset 0x1c, size 0x4
  __declspec(property(get = __get__endIndex, put = __set__endIndex)) int32_t _endIndex;

  __declspec(property(get = get_Current))::System::Object* Current;

  /// @brief Convert operator to "::System::Collections::IEnumerator"
  constexpr operator ::System::Collections::IEnumerator*() noexcept;

  /// @brief Convert operator to "::System::ICloneable"
  constexpr operator ::System::ICloneable*() noexcept;

  constexpr ::System::Array*& __get__array();

  constexpr ::cordl_internals::to_const_pointer<::System::Array*> const& __get__array() const;

  constexpr void __set__array(::System::Array* value);

  constexpr int32_t& __get__index();

  constexpr int32_t const& __get__index() const;

  constexpr void __set__index(int32_t value);

  constexpr int32_t& __get__endIndex();

  constexpr int32_t const& __get__endIndex() const;

  constexpr void __set__endIndex(int32_t value);

  static inline ::System::__Array__ArrayEnumerator* New_ctor(::System::Array* array);

  /// @brief Method .ctor addr 0x2479da0 size 0x48 virtual false final false
  inline void _ctor(::System::Array* array);

  /// @brief Method MoveNext addr 0x2479de8 size 0x28 virtual true final true
  inline bool MoveNext();

  /// @brief Method Reset addr 0x2479e10 size 0xc virtual true final true
  inline void Reset();

  /// @brief Method Clone addr 0x2479e1c size 0x8 virtual true final true
  inline ::System::Object* Clone();

  /// @brief Method get_Current addr 0x2479e24 size 0x118 virtual true final true
  inline ::System::Object* get_Current();

  // Ctor Parameters [CppParam { name: "", ty: "__Array__ArrayEnumerator", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __Array__ArrayEnumerator(__Array__ArrayEnumerator&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__Array__ArrayEnumerator", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __Array__ArrayEnumerator(__Array__ArrayEnumerator const&) = delete;

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __Array__ArrayEnumerator();

public:
  /// @brief Field _array, offset: 0x10, size: 0x8, def value: None
  ::System::Array* ____array;

  /// @brief Field _index, offset: 0x18, size: 0x4, def value: None
  int32_t ____index;

  /// @brief Field _endIndex, offset: 0x1c, size: 0x4, def value: None
  int32_t ____endIndex;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::System::__Array__ArrayEnumerator, 0x20>, "Size mismatch!");

static_assert(offsetof(::System::__Array__ArrayEnumerator, ____array) == 0x10, "Offset mismatch!");

static_assert(offsetof(::System::__Array__ArrayEnumerator, ____index) == 0x18, "Offset mismatch!");

static_assert(offsetof(::System::__Array__ArrayEnumerator, ____endIndex) == 0x1c, "Offset mismatch!");

} // namespace System
// Type: ::RawData
// SizeInfo { instance_size: 40, native_size: 24, calculated_instance_size: 40, calculated_native_size: 33, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace System {
// Is value type: false
// Dependencies: {TypeDefinitionIndex(TypeDefinitionIndex(2611)), TypeDefinitionIndex(TypeDefinitionIndex(2601))}
// Self: TypeDefinitionIndex(TypeDefinitionIndex(2529))
// CS Name: ::Array::RawData*
class CORDL_TYPE __Array__RawData : public ::System::Object {
public:
  // Declarations
  /// @brief Field Bounds, offset 0x10, size 0x8
  __declspec(property(get = __get_Bounds, put = __set_Bounds)) void* Bounds;

  /// @brief Field Count, offset 0x18, size 0x8
  __declspec(property(get = __get_Count, put = __set_Count)) void* Count;

  /// @brief Field Data, offset 0x20, size 0x1
  __declspec(property(get = __get_Data, put = __set_Data)) uint8_t Data;

  constexpr void*& __get_Bounds();

  constexpr void* const& __get_Bounds() const;

  constexpr void __set_Bounds(void* value);

  constexpr void*& __get_Count();

  constexpr void* const& __get_Count() const;

  constexpr void __set_Count(void* value);

  constexpr uint8_t& __get_Data();

  constexpr uint8_t const& __get_Data() const;

  constexpr void __set_Data(uint8_t value);

  // Ctor Parameters [CppParam { name: "", ty: "__Array__RawData", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __Array__RawData(__Array__RawData&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__Array__RawData", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __Array__RawData(__Array__RawData const&) = delete;

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __Array__RawData();

public:
  /// @brief Field Bounds, offset: 0x10, size: 0x8, def value: None
  void* ___Bounds;

  /// @brief Field Count, offset: 0x18, size: 0x8, def value: None
  void* ___Count;

  /// @brief Field Data, offset: 0x20, size: 0x1, def value: None
  uint8_t ___Data;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::System::__Array__RawData, 0x28>, "Size mismatch!");

static_assert(offsetof(::System::__Array__RawData, ___Bounds) == 0x10, "Offset mismatch!");

static_assert(offsetof(::System::__Array__RawData, ___Count) == 0x18, "Offset mismatch!");

static_assert(offsetof(::System::__Array__RawData, ___Data) == 0x20, "Offset mismatch!");

} // namespace System
// Type: ::InternalEnumerator`1
// SizeInfo { instance_size: 16, native_size: 28, calculated_instance_size: 16, calculated_native_size: 28, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace System {
// cpp template
template <typename T>
// Is value type: true
// Dependencies: {}
// Self: TypeDefinitionIndex(TypeDefinitionIndex(2530))
// CS Name: ::Array::InternalEnumerator`1<T>
struct CORDL_TYPE __Array__InternalEnumerator_1 {
public:
  // Declarations
  __declspec(property(get = get_Current)) T Current;

  __declspec(property(get = System_Collections_IEnumerator_get_Current))::System::Object* System_Collections_IEnumerator_Current;

  /// @brief Convert operator to "::System::Collections::Generic::IEnumerator_1<T>"
  constexpr operator ::System::Collections::Generic::IEnumerator_1<T>*();

  /// @brief Convert operator to "::System::IDisposable"
  constexpr operator ::System::IDisposable*();

  /// @brief Convert operator to "::System::Collections::IEnumerator"
  constexpr operator ::System::Collections::IEnumerator*();

  /// @brief Method .ctor addr 0x0 size 0xffffffffffffffff virtual false final false
  inline void _ctor(::System::Array* array);

  /// @brief Method Dispose addr 0x0 size 0xffffffffffffffff virtual true final true
  inline void Dispose();

  /// @brief Method MoveNext addr 0x0 size 0xffffffffffffffff virtual true final true
  inline bool MoveNext();

  /// @brief Method get_Current addr 0x0 size 0xffffffffffffffff virtual true final true
  inline T get_Current();

  /// @brief Method System.Collections.IEnumerator.Reset addr 0x0 size 0xffffffffffffffff virtual true final true
  inline void System_Collections_IEnumerator_Reset();

  /// @brief Method System.Collections.IEnumerator.get_Current addr 0x0 size 0xffffffffffffffff virtual true final true
  inline ::System::Object* System_Collections_IEnumerator_get_Current();

  // Ctor Parameters [CppParam { name: "array", ty: "::System::Array*", modifiers: "", def_value: None }, CppParam { name: "idx", ty: "int32_t", modifiers: "", def_value: None }]
  constexpr __Array__InternalEnumerator_1(::System::Array* array, int32_t idx) noexcept;

  // Ctor Parameters []
  // @brief default ctor
  constexpr __Array__InternalEnumerator_1();

  /// @brief Field array, offset: 0x0, size: 0x8, def value: None
  ::System::Array* array;

  /// @brief Field idx, offset: 0x8, size: 0x4, def value: None
  int32_t idx;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x10 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
} // namespace System
// Type: ::EmptyInternalEnumerator`1
// SizeInfo { instance_size: 16, native_size: 16, calculated_instance_size: 16, calculated_native_size: 16, minimum_alignment: 8, natural_alignment: 0, packing: None, specified_packing: None }
namespace System {
// cpp template
template <typename T>
// Is value type: false
// Dependencies: {TypeDefinitionIndex(TypeDefinitionIndex(2611))}
// Self: TypeDefinitionIndex(TypeDefinitionIndex(2531))
// CS Name: ::Array::EmptyInternalEnumerator`1<T>*
class CORDL_TYPE __Array__EmptyInternalEnumerator_1 : public ::System::Object {
public:
  // Declarations
  /// @brief Field Value, offset 0xffffffff, size 0x8
  static __declspec(property(get = getStaticF_Value, put = setStaticF_Value))::System::__Array__EmptyInternalEnumerator_1<T>* Value;

  __declspec(property(get = get_Current)) T Current;

  __declspec(property(get = System_Collections_IEnumerator_get_Current))::System::Object* System_Collections_IEnumerator_Current;

  /// @brief Convert operator to "::System::Collections::Generic::IEnumerator_1<T>"
  constexpr operator ::System::Collections::Generic::IEnumerator_1<T>*() noexcept;

  /// @brief Convert operator to "::System::IDisposable"
  constexpr operator ::System::IDisposable*() noexcept;

  /// @brief Convert operator to "::System::Collections::IEnumerator"
  constexpr operator ::System::Collections::IEnumerator*() noexcept;

  static inline void setStaticF_Value(::System::__Array__EmptyInternalEnumerator_1<T>* value);

  static inline ::System::__Array__EmptyInternalEnumerator_1<T>* getStaticF_Value();

  /// @brief Method Dispose addr 0x0 size 0xffffffffffffffff virtual true final true
  inline void Dispose();

  /// @brief Method MoveNext addr 0x0 size 0xffffffffffffffff virtual true final true
  inline bool MoveNext();

  /// @brief Method get_Current addr 0x0 size 0xffffffffffffffff virtual true final true
  inline T get_Current();

  /// @brief Method System.Collections.IEnumerator.get_Current addr 0x0 size 0xffffffffffffffff virtual true final true
  inline ::System::Object* System_Collections_IEnumerator_get_Current();

  /// @brief Method System.Collections.IEnumerator.Reset addr 0x0 size 0xffffffffffffffff virtual true final true
  inline void System_Collections_IEnumerator_Reset();

  static inline ::System::__Array__EmptyInternalEnumerator_1<T>* New_ctor();

  /// @brief Method .ctor addr 0x0 size 0xffffffffffffffff virtual false final false
  inline void _ctor();

  // Ctor Parameters [CppParam { name: "", ty: "__Array__EmptyInternalEnumerator_1", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  __Array__EmptyInternalEnumerator_1(__Array__EmptyInternalEnumerator_1&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "__Array__EmptyInternalEnumerator_1", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  __Array__EmptyInternalEnumerator_1(__Array__EmptyInternalEnumerator_1 const&) = delete;

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr __Array__EmptyInternalEnumerator_1();

public:
  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
} // namespace System
// Type: ::SorterObjectArray
// SizeInfo { instance_size: 24, native_size: -1, calculated_instance_size: 24, calculated_native_size: 40, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace System {
// Is value type: true
// Dependencies: {}
// Self: TypeDefinitionIndex(TypeDefinitionIndex(2532))
// CS Name: ::Array::SorterObjectArray
struct CORDL_TYPE __Array__SorterObjectArray {
public:
  // Declarations
  /// @brief Method .ctor addr 0x2479f3c size 0x7c virtual false final false
  inline void _ctor(::ArrayW<::System::Object*, ::Array<::System::Object*>*> keys, ::ArrayW<::System::Object*, ::Array<::System::Object*>*> items, ::System::Collections::IComparer* comparer);

  /// @brief Method SwapIfGreaterWithItems addr 0x2479fb8 size 0x230 virtual false final false
  inline void SwapIfGreaterWithItems(int32_t a, int32_t b);

  /// @brief Method Swap addr 0x247a1e8 size 0x164 virtual false final false
  inline void Swap(int32_t i, int32_t j);

  /// @brief Method Sort addr 0x247a34c size 0x4 virtual false final false
  inline void Sort(int32_t left, int32_t length);

  /// @brief Method IntrospectiveSort addr 0x247a350 size 0x150 virtual false final false
  inline void IntrospectiveSort(int32_t left, int32_t length);

  /// @brief Method IntroSort addr 0x247a4a0 size 0x114 virtual false final false
  inline void IntroSort(int32_t lo, int32_t hi, int32_t depthLimit);

  /// @brief Method PickPivotAndPartition addr 0x247a8f0 size 0x22c virtual false final false
  inline int32_t PickPivotAndPartition(int32_t lo, int32_t hi);

  /// @brief Method Heapsort addr 0x247a850 size 0xa0 virtual false final false
  inline void Heapsort(int32_t lo, int32_t hi);

  /// @brief Method DownHeap addr 0x247ab1c size 0x35c virtual false final false
  inline void DownHeap(int32_t i, int32_t n, int32_t lo);

  /// @brief Method InsertionSort addr 0x247a5b4 size 0x29c virtual false final false
  inline void InsertionSort(int32_t lo, int32_t hi);

  // Ctor Parameters [CppParam { name: "keys", ty: "::ArrayW<::System::Object*,::Array<::System::Object*>*>", modifiers: "", def_value: None }, CppParam { name: "items", ty:
  // "::ArrayW<::System::Object*,::Array<::System::Object*>*>", modifiers: "", def_value: None }, CppParam { name: "comparer", ty: "::System::Collections::IComparer*", modifiers: "", def_value: None
  // }]
  constexpr __Array__SorterObjectArray(::ArrayW<::System::Object*, ::Array<::System::Object*>*> keys, ::ArrayW<::System::Object*, ::Array<::System::Object*>*> items,
                                       ::System::Collections::IComparer* comparer) noexcept;

  // Ctor Parameters []
  // @brief default ctor
  constexpr __Array__SorterObjectArray();

  /// @brief Field keys, offset: 0x0, size: 0x8, def value: None
  ::ArrayW<::System::Object*, ::Array<::System::Object*>*> keys;

  /// @brief Field items, offset: 0x8, size: 0x8, def value: None
  ::ArrayW<::System::Object*, ::Array<::System::Object*>*> items;

  /// @brief Field comparer, offset: 0x10, size: 0x8, def value: None
  ::System::Collections::IComparer* comparer;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x18 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::System::__Array__SorterObjectArray, 0x18>, "Size mismatch!");

static_assert(offsetof(::System::__Array__SorterObjectArray, keys) == 0x0, "Offset mismatch!");

static_assert(offsetof(::System::__Array__SorterObjectArray, items) == 0x8, "Offset mismatch!");

static_assert(offsetof(::System::__Array__SorterObjectArray, comparer) == 0x10, "Offset mismatch!");

} // namespace System
// Type: ::SorterGenericArray
// SizeInfo { instance_size: 24, native_size: -1, calculated_instance_size: 24, calculated_native_size: 40, minimum_alignment: 8, natural_alignment: 8, packing: None, specified_packing: None }
namespace System {
// Is value type: true
// Dependencies: {}
// Self: TypeDefinitionIndex(TypeDefinitionIndex(2533))
// CS Name: ::Array::SorterGenericArray
struct CORDL_TYPE __Array__SorterGenericArray {
public:
  // Declarations
  /// @brief Method .ctor addr 0x247ae78 size 0x7c virtual false final false
  inline void _ctor(::System::Array* keys, ::System::Array* items, ::System::Collections::IComparer* comparer);

  /// @brief Method SwapIfGreaterWithItems addr 0x247aef4 size 0x1d0 virtual false final false
  inline void SwapIfGreaterWithItems(int32_t a, int32_t b);

  /// @brief Method Swap addr 0x247b0c4 size 0xec virtual false final false
  inline void Swap(int32_t i, int32_t j);

  /// @brief Method Sort addr 0x247b1b0 size 0x4 virtual false final false
  inline void Sort(int32_t left, int32_t length);

  /// @brief Method IntrospectiveSort addr 0x247b1b4 size 0x158 virtual false final false
  inline void IntrospectiveSort(int32_t left, int32_t length);

  /// @brief Method IntroSort addr 0x247b30c size 0x114 virtual false final false
  inline void IntroSort(int32_t lo, int32_t hi, int32_t depthLimit);

  /// @brief Method PickPivotAndPartition addr 0x247b6a8 size 0x21c virtual false final false
  inline int32_t PickPivotAndPartition(int32_t lo, int32_t hi);

  /// @brief Method Heapsort addr 0x247b608 size 0xa0 virtual false final false
  inline void Heapsort(int32_t lo, int32_t hi);

  /// @brief Method DownHeap addr 0x247b8c4 size 0x2d0 virtual false final false
  inline void DownHeap(int32_t i, int32_t n, int32_t lo);

  /// @brief Method InsertionSort addr 0x247b420 size 0x1e8 virtual false final false
  inline void InsertionSort(int32_t lo, int32_t hi);

  // Ctor Parameters [CppParam { name: "keys", ty: "::System::Array*", modifiers: "", def_value: None }, CppParam { name: "items", ty: "::System::Array*", modifiers: "", def_value: None }, CppParam {
  // name: "comparer", ty: "::System::Collections::IComparer*", modifiers: "", def_value: None }]
  constexpr __Array__SorterGenericArray(::System::Array* keys, ::System::Array* items, ::System::Collections::IComparer* comparer) noexcept;

  // Ctor Parameters []
  // @brief default ctor
  constexpr __Array__SorterGenericArray();

  /// @brief Field keys, offset: 0x0, size: 0x8, def value: None
  ::System::Array* keys;

  /// @brief Field items, offset: 0x8, size: 0x8, def value: None
  ::System::Array* items;

  /// @brief Field comparer, offset: 0x10, size: 0x8, def value: None
  ::System::Collections::IComparer* comparer;

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x18 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::System::__Array__SorterGenericArray, 0x18>, "Size mismatch!");

static_assert(offsetof(::System::__Array__SorterGenericArray, keys) == 0x0, "Offset mismatch!");

static_assert(offsetof(::System::__Array__SorterGenericArray, items) == 0x8, "Offset mismatch!");

static_assert(offsetof(::System::__Array__SorterGenericArray, comparer) == 0x10, "Offset mismatch!");

} // namespace System
// Type: System::Array
// SizeInfo { instance_size: 32, native_size: -1, calculated_instance_size: 16, calculated_native_size: 16, minimum_alignment: 8, natural_alignment: 0, packing: None, specified_packing: None }
namespace System {
// Is value type: false
// Dependencies: {TypeDefinitionIndex(TypeDefinitionIndex(2611))}
// Self: TypeDefinitionIndex(TypeDefinitionIndex(2534))
// CS Name: ::System::Array*
class CORDL_TYPE Array : public ::System::Object {
public:
  // Declarations
  using SorterGenericArray = ::System::__Array__SorterGenericArray;

  using SorterObjectArray = ::System::__Array__SorterObjectArray;

  template <typename T> using EmptyInternalEnumerator_1 = ::System::__Array__EmptyInternalEnumerator_1<T>;

  template <typename T> using InternalEnumerator_1 = ::System::__Array__InternalEnumerator_1<T>;

  using RawData = ::System::__Array__RawData;

