#pragma once
// IWYU pragma private; include "System/Number.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__Object_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cmath>
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(Number)
namespace System::Globalization {
class NumberFormatInfo;
}
namespace System::Globalization {
struct NumberStyles;
}
namespace System::Text {
struct ValueStringBuilder;
}
namespace System {
struct Decimal;
}
namespace System {
class IFormatProvider;
}
namespace System {
struct NumberBuffer_Number_DigitsAndNullTerminator;
}
namespace System {
struct Number_NumberBuffer;
}
namespace System {
template <typename T> struct ReadOnlySpan_1;
}
namespace System {
template <typename T> struct Span_1;
}
// Forward declare root types
namespace System {
class Number;
}
namespace System {
struct NumberBuffer_Number_DigitsAndNullTerminator;
}
namespace System {
struct Number_NumberBuffer;
}
// Write type traits
MARK_REF_PTR_T(::System::Number);
MARK_VAL_T(::System::NumberBuffer_Number_DigitsAndNullTerminator);
MARK_VAL_T(::System::Number_NumberBuffer);
// Dependencies
namespace System {
// Is value type: true
// CS Name: System.Number/NumberBuffer/DigitsAndNullTerminator
#pragma pack(push, 0)
struct CORDL_TYPE NumberBuffer_Number_DigitsAndNullTerminator {
public:
  // Declarations
  // Ctor Parameters []
  // @brief default ctor
  constexpr NumberBuffer_Number_DigitsAndNullTerminator();

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 2454 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x66 };

  /// @brief Size padding 0x66 - 0x0 = 0x66, packed as 0x66
  uint8_t _cordl_size_padding[0x66];

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
#pragma pack(pop)
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::System::NumberBuffer_Number_DigitsAndNullTerminator, 0x66>, "Size mismatch!");

} // namespace System
// Dependencies System.Number::NumberBuffer::DigitsAndNullTerminator
namespace System {
// Is value type: true
// CS Name: System.Number/NumberBuffer
#pragma pack(push, 1)
struct CORDL_TYPE Number_NumberBuffer {
public:
  // Declarations
  using DigitsAndNullTerminator = ::System::NumberBuffer_Number_DigitsAndNullTerminator;

  __declspec(property(get = get_digits)) char16_t* digits;

  __declspec(property(get = get_sign, put = set_sign)) bool sign;

  /// @brief Method get_digits, addr 0x5aa7734, size 0x8, virtual false, abstract: false, final false
  inline char16_t* get_digits();

  /// @brief Method get_sign, addr 0x5aa7718, size 0x10, virtual false, abstract: false, final false
  inline bool get_sign();

  /// @brief Method set_sign, addr 0x5aa7728, size 0xc, virtual false, abstract: false, final false
  inline void set_sign(bool value);

  // Ctor Parameters []
  // @brief default ctor
  constexpr Number_NumberBuffer();

  // Ctor Parameters [CppParam { name: "precision", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "scale", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name:
  // "_sign", ty: "int32_t", modifiers: "", def_value: None }, CppParam { name: "_digits", ty: "::System::NumberBuffer_Number_DigitsAndNullTerminator", modifiers: "", def_value: None }, CppParam {
  // name: "_allDigits", ty: "char16_t*", modifiers: "", def_value: None }]
  constexpr Number_NumberBuffer(int32_t precision, int32_t scale, int32_t _sign, ::System::NumberBuffer_Number_DigitsAndNullTerminator _digits, char16_t* _allDigits) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 2455 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x7a };

  /// @brief Field precision, offset: 0x0, size: 0x4, def value: None
  int32_t precision;

  /// @brief Field scale, offset: 0x4, size: 0x4, def value: None
  int32_t scale;

  /// @brief Field _sign, offset: 0x8, size: 0x4, def value: None
  int32_t _sign;

  /// @brief Field _digits, offset: 0xc, size: 0x66, def value: None
  ::System::NumberBuffer_Number_DigitsAndNullTerminator _digits;

  /// @brief Field _allDigits, offset: 0x72, size: 0x8, def value: None
  char16_t* _allDigits;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
#pragma pack(pop)
// Non member Declarations
static_assert(offsetof(::System::Number_NumberBuffer, precision) == 0x0, "Offset mismatch!");

static_assert(offsetof(::System::Number_NumberBuffer, scale) == 0x4, "Offset mismatch!");

static_assert(offsetof(::System::Number_NumberBuffer, _sign) == 0x8, "Offset mismatch!");

static_assert(offsetof(::System::Number_NumberBuffer, _digits) == 0xc, "Offset mismatch!");

static_assert(offsetof(::System::Number_NumberBuffer, _allDigits) == 0x72, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::System::Number_NumberBuffer, 0x7a>, "Size mismatch!");

} // namespace System
// Dependencies System.Object
namespace System {
// Is value type: false
// CS Name: System.Number
class CORDL_TYPE Number : public ::System::Object {
public:
  // Declarations
  using NumberBuffer = ::System::Number_NumberBuffer;

  /// @brief Field s_charToHexLookup, offset 0xffffffff, size 0x8
  __declspec(property(get = getStaticF_s_charToHexLookup, put = setStaticF_s_charToHexLookup)) ::ArrayW<int32_t, ::Array<int32_t>*> s_charToHexLookup;

  /// @brief Field s_negCurrencyFormats, offset 0xffffffff, size 0x8
  __declspec(property(get = getStaticF_s_negCurrencyFormats, put = setStaticF_s_negCurrencyFormats)) ::ArrayW<::StringW, ::Array<::StringW>*> s_negCurrencyFormats;

  /// @brief Field s_negNumberFormats, offset 0xffffffff, size 0x8
