#pragma once
// IWYU pragma private; include "UnityEngine/UIElements/Layout/LayoutComputedData.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "UnityEngine/UIElements/Layout/zzzz__LayoutDirection_def.hpp"
#include <cmath>
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(LayoutComputedData)
namespace UnityEngine::UIElements::Layout {
struct LayoutComputedData__Border_e__FixedBuffer;
}
namespace UnityEngine::UIElements::Layout {
struct LayoutComputedData__Dimensions_e__FixedBuffer;
}
namespace UnityEngine::UIElements::Layout {
struct LayoutComputedData__Margin_e__FixedBuffer;
}
namespace UnityEngine::UIElements::Layout {
struct LayoutComputedData__MeasuredDimensions_e__FixedBuffer;
}
namespace UnityEngine::UIElements::Layout {
struct LayoutComputedData__Padding_e__FixedBuffer;
}
namespace UnityEngine::UIElements::Layout {
struct LayoutComputedData__Position_e__FixedBuffer;
}
// Forward declare root types
namespace UnityEngine::UIElements::Layout {
struct LayoutComputedData;
}
namespace UnityEngine::UIElements::Layout {
struct LayoutComputedData__Border_e__FixedBuffer;
}
namespace UnityEngine::UIElements::Layout {
struct LayoutComputedData__Dimensions_e__FixedBuffer;
}
namespace UnityEngine::UIElements::Layout {
struct LayoutComputedData__Margin_e__FixedBuffer;
}
namespace UnityEngine::UIElements::Layout {
struct LayoutComputedData__MeasuredDimensions_e__FixedBuffer;
}
namespace UnityEngine::UIElements::Layout {
struct LayoutComputedData__Padding_e__FixedBuffer;
}
namespace UnityEngine::UIElements::Layout {
struct LayoutComputedData__Position_e__FixedBuffer;
}
// Write type traits
MARK_VAL_T(::UnityEngine::UIElements::Layout::LayoutComputedData);
MARK_VAL_T(::UnityEngine::UIElements::Layout::LayoutComputedData__Border_e__FixedBuffer);
MARK_VAL_T(::UnityEngine::UIElements::Layout::LayoutComputedData__Dimensions_e__FixedBuffer);
MARK_VAL_T(::UnityEngine::UIElements::Layout::LayoutComputedData__Margin_e__FixedBuffer);
MARK_VAL_T(::UnityEngine::UIElements::Layout::LayoutComputedData__MeasuredDimensions_e__FixedBuffer);
MARK_VAL_T(::UnityEngine::UIElements::Layout::LayoutComputedData__Padding_e__FixedBuffer);
MARK_VAL_T(::UnityEngine::UIElements::Layout::LayoutComputedData__Position_e__FixedBuffer);
// Dependencies
namespace UnityEngine::UIElements::Layout {
// Is value type: true
// CS Name: UnityEngine.UIElements.Layout.LayoutComputedData/<Border>e__FixedBuffer
#pragma pack(push, 0)
struct CORDL_TYPE LayoutComputedData__Border_e__FixedBuffer {
public:
  // Declarations
  // Ctor Parameters []
  // @brief default ctor
  constexpr LayoutComputedData__Border_e__FixedBuffer();

  // Ctor Parameters [CppParam { name: "FixedElementField", ty: "float_t", modifiers: "", def_value: None }]
  constexpr LayoutComputedData__Border_e__FixedBuffer(float_t FixedElementField) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 5404 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x18 };

  /// @brief Field FixedElementField, offset: 0x0, size: 0x4, def value: None
  float_t FixedElementField;

  /// @brief Size padding 0x18 - 0x4 = 0x14, packed as 0x14
  uint8_t _cordl_size_padding[0x14];

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
#pragma pack(pop)
// Non member Declarations
static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData__Border_e__FixedBuffer, FixedElementField) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::UIElements::Layout::LayoutComputedData__Border_e__FixedBuffer, 0x18>, "Size mismatch!");

} // namespace UnityEngine::UIElements::Layout
// Dependencies
namespace UnityEngine::UIElements::Layout {
// Is value type: true
// CS Name: UnityEngine.UIElements.Layout.LayoutComputedData/<Dimensions>e__FixedBuffer
#pragma pack(push, 0)
struct CORDL_TYPE LayoutComputedData__Dimensions_e__FixedBuffer {
public:
  // Declarations
  // Ctor Parameters []
  // @brief default ctor
  constexpr LayoutComputedData__Dimensions_e__FixedBuffer();

  // Ctor Parameters [CppParam { name: "FixedElementField", ty: "float_t", modifiers: "", def_value: None }]
  constexpr LayoutComputedData__Dimensions_e__FixedBuffer(float_t FixedElementField) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 5405 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x8 };

  /// @brief Field FixedElementField, offset: 0x0, size: 0x4, def value: None
  float_t FixedElementField;

  /// @brief Size padding 0x8 - 0x4 = 0x4, packed as 0x4
  uint8_t _cordl_size_padding[0x4];

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
#pragma pack(pop)
// Non member Declarations
static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData__Dimensions_e__FixedBuffer, FixedElementField) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::UIElements::Layout::LayoutComputedData__Dimensions_e__FixedBuffer, 0x8>, "Size mismatch!");

} // namespace UnityEngine::UIElements::Layout
// Dependencies
namespace UnityEngine::UIElements::Layout {
// Is value type: true
// CS Name: UnityEngine.UIElements.Layout.LayoutComputedData/<Margin>e__FixedBuffer
#pragma pack(push, 0)
struct CORDL_TYPE LayoutComputedData__Margin_e__FixedBuffer {
public:
  // Declarations
  // Ctor Parameters []
  // @brief default ctor
  constexpr LayoutComputedData__Margin_e__FixedBuffer();

  // Ctor Parameters [CppParam { name: "FixedElementField", ty: "float_t", modifiers: "", def_value: None }]
  constexpr LayoutComputedData__Margin_e__FixedBuffer(float_t FixedElementField) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 5406 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x18 };

  /// @brief Field FixedElementField, offset: 0x0, size: 0x4, def value: None
  float_t FixedElementField;

  /// @brief Size padding 0x18 - 0x4 = 0x14, packed as 0x14
  uint8_t _cordl_size_padding[0x14];

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
#pragma pack(pop)
// Non member Declarations
static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData__Margin_e__FixedBuffer, FixedElementField) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::UIElements::Layout::LayoutComputedData__Margin_e__FixedBuffer, 0x18>, "Size mismatch!");

} // namespace UnityEngine::UIElements::Layout
// Dependencies
namespace UnityEngine::UIElements::Layout {
// Is value type: true
// CS Name: UnityEngine.UIElements.Layout.LayoutComputedData/<MeasuredDimensions>e__FixedBuffer
#pragma pack(push, 0)
struct CORDL_TYPE LayoutComputedData__MeasuredDimensions_e__FixedBuffer {
public:
  // Declarations
  // Ctor Parameters []
  // @brief default ctor
  constexpr LayoutComputedData__MeasuredDimensions_e__FixedBuffer();

  // Ctor Parameters [CppParam { name: "FixedElementField", ty: "float_t", modifiers: "", def_value: None }]
  constexpr LayoutComputedData__MeasuredDimensions_e__FixedBuffer(float_t FixedElementField) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 5407 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x8 };

  /// @brief Field FixedElementField, offset: 0x0, size: 0x4, def value: None
  float_t FixedElementField;

  /// @brief Size padding 0x8 - 0x4 = 0x4, packed as 0x4
  uint8_t _cordl_size_padding[0x4];

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
#pragma pack(pop)
// Non member Declarations
static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData__MeasuredDimensions_e__FixedBuffer, FixedElementField) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::UIElements::Layout::LayoutComputedData__MeasuredDimensions_e__FixedBuffer, 0x8>, "Size mismatch!");

} // namespace UnityEngine::UIElements::Layout
// Dependencies
namespace UnityEngine::UIElements::Layout {
// Is value type: true
// CS Name: UnityEngine.UIElements.Layout.LayoutComputedData/<Padding>e__FixedBuffer
#pragma pack(push, 0)
struct CORDL_TYPE LayoutComputedData__Padding_e__FixedBuffer {
public:
  // Declarations
  // Ctor Parameters []
  // @brief default ctor
  constexpr LayoutComputedData__Padding_e__FixedBuffer();

  // Ctor Parameters [CppParam { name: "FixedElementField", ty: "float_t", modifiers: "", def_value: None }]
  constexpr LayoutComputedData__Padding_e__FixedBuffer(float_t FixedElementField) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 5408 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x18 };

  /// @brief Field FixedElementField, offset: 0x0, size: 0x4, def value: None
  float_t FixedElementField;

  /// @brief Size padding 0x18 - 0x4 = 0x14, packed as 0x14
  uint8_t _cordl_size_padding[0x14];

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
#pragma pack(pop)
// Non member Declarations
static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData__Padding_e__FixedBuffer, FixedElementField) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::UIElements::Layout::LayoutComputedData__Padding_e__FixedBuffer, 0x18>, "Size mismatch!");

} // namespace UnityEngine::UIElements::Layout
// Dependencies
namespace UnityEngine::UIElements::Layout {
// Is value type: true
// CS Name: UnityEngine.UIElements.Layout.LayoutComputedData/<Position>e__FixedBuffer
#pragma pack(push, 0)
struct CORDL_TYPE LayoutComputedData__Position_e__FixedBuffer {
public:
  // Declarations
  // Ctor Parameters []
  // @brief default ctor
  constexpr LayoutComputedData__Position_e__FixedBuffer();

  // Ctor Parameters [CppParam { name: "FixedElementField", ty: "float_t", modifiers: "", def_value: None }]
  constexpr LayoutComputedData__Position_e__FixedBuffer(float_t FixedElementField) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 5409 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x10 };

  /// @brief Field FixedElementField, offset: 0x0, size: 0x4, def value: None
  float_t FixedElementField;

  /// @brief Size padding 0x10 - 0x4 = 0xc, packed as 0xc
  uint8_t _cordl_size_padding[0xc];

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
#pragma pack(pop)
// Non member Declarations
static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData__Position_e__FixedBuffer, FixedElementField) == 0x0, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::UIElements::Layout::LayoutComputedData__Position_e__FixedBuffer, 0x10>, "Size mismatch!");

} // namespace UnityEngine::UIElements::Layout
// Dependencies UnityEngine.UIElements.Layout.LayoutComputedData::<Border>e__FixedBuffer, UnityEngine.UIElements.Layout.LayoutComputedData::<Dimensions>e__FixedBuffer,
// UnityEngine.UIElements.Layout.LayoutComputedData::<Margin>e__FixedBuffer, UnityEngine.UIElements.Layout.LayoutComputedData::<MeasuredDimensions>e__FixedBuffer,
// UnityEngine.UIElements.Layout.LayoutComputedData::<Padding>e__FixedBuffer, UnityEngine.UIElements.Layout.LayoutComputedData::<Position>e__FixedBuffer, UnityEngine.UIElements.Layout.LayoutDirection
namespace UnityEngine::UIElements::Layout {
// Is value type: true
// CS Name: UnityEngine.UIElements.Layout.LayoutComputedData
struct CORDL_TYPE LayoutComputedData {
public:
  // Declarations
  using _Border_e__FixedBuffer = ::UnityEngine::UIElements::Layout::LayoutComputedData__Border_e__FixedBuffer;

  using _Dimensions_e__FixedBuffer = ::UnityEngine::UIElements::Layout::LayoutComputedData__Dimensions_e__FixedBuffer;

  using _Margin_e__FixedBuffer = ::UnityEngine::UIElements::Layout::LayoutComputedData__Margin_e__FixedBuffer;

  using _MeasuredDimensions_e__FixedBuffer = ::UnityEngine::UIElements::Layout::LayoutComputedData__MeasuredDimensions_e__FixedBuffer;

  using _Padding_e__FixedBuffer = ::UnityEngine::UIElements::Layout::LayoutComputedData__Padding_e__FixedBuffer;

  using _Position_e__FixedBuffer = ::UnityEngine::UIElements::Layout::LayoutComputedData__Position_e__FixedBuffer;

  __declspec(property(get = get_BorderBuffer)) float_t* BorderBuffer;

  __declspec(property(get = get_MarginBuffer)) float_t* MarginBuffer;

  __declspec(property(get = get_PaddingBuffer)) float_t* PaddingBuffer;

  /// @brief Method get_BorderBuffer, addr 0x6ace668, size 0x8, virtual false, abstract: false, final false
  inline float_t* get_BorderBuffer();

  /// @brief Method get_Default, addr 0x6acadec, size 0x130, virtual false, abstract: false, final false
  static inline ::UnityEngine::UIElements::Layout::LayoutComputedData get_Default();

  /// @brief Method get_MarginBuffer, addr 0x6ace660, size 0x8, virtual false, abstract: false, final false
  inline float_t* get_MarginBuffer();

  /// @brief Method get_PaddingBuffer, addr 0x6ace670, size 0x8, virtual false, abstract: false, final false
  inline float_t* get_PaddingBuffer();

  // Ctor Parameters []
  // @brief default ctor
  constexpr LayoutComputedData();

  // Ctor Parameters [CppParam { name: "Position", ty: "::UnityEngine::UIElements::Layout::LayoutComputedData__Position_e__FixedBuffer", modifiers: "", def_value: None }, CppParam { name:
  // "Dimensions", ty: "::UnityEngine::UIElements::Layout::LayoutComputedData__Dimensions_e__FixedBuffer", modifiers: "", def_value: None }, CppParam { name: "Margin", ty:
  // "::UnityEngine::UIElements::Layout::LayoutComputedData__Margin_e__FixedBuffer", modifiers: "", def_value: None }, CppParam { name: "Border", ty:
  // "::UnityEngine::UIElements::Layout::LayoutComputedData__Border_e__FixedBuffer", modifiers: "", def_value: None }, CppParam { name: "Padding", ty:
  // "::UnityEngine::UIElements::Layout::LayoutComputedData__Padding_e__FixedBuffer", modifiers: "", def_value: None }, CppParam { name: "Direction", ty:
  // "::UnityEngine::UIElements::Layout::LayoutDirection", modifiers: "", def_value: None }, CppParam { name: "ComputedFlexBasisGeneration", ty: "uint32_t", modifiers: "", def_value: None }, CppParam
  // { name: "ComputedFlexBasis", ty: "float_t", modifiers: "", def_value: None }, CppParam { name: "HadOverflow", ty: "bool", modifiers: "", def_value: None }, CppParam { name: "GenerationCount", ty:
  // "uint32_t", modifiers: "", def_value: None }, CppParam { name: "LastParentDirection", ty: "::UnityEngine::UIElements::Layout::LayoutDirection", modifiers: "", def_value: None }, CppParam { name:
  // "LastPointScaleFactor", ty: "float_t", modifiers: "", def_value: None }, CppParam { name: "MeasuredDimensions", ty:
  // "::UnityEngine::UIElements::Layout::LayoutComputedData__MeasuredDimensions_e__FixedBuffer", modifiers: "", def_value: None }]
  constexpr LayoutComputedData(::UnityEngine::UIElements::Layout::LayoutComputedData__Position_e__FixedBuffer Position,
                               ::UnityEngine::UIElements::Layout::LayoutComputedData__Dimensions_e__FixedBuffer Dimensions,
                               ::UnityEngine::UIElements::Layout::LayoutComputedData__Margin_e__FixedBuffer Margin, ::UnityEngine::UIElements::Layout::LayoutComputedData__Border_e__FixedBuffer Border,
                               ::UnityEngine::UIElements::Layout::LayoutComputedData__Padding_e__FixedBuffer Padding, ::UnityEngine::UIElements::Layout::LayoutDirection Direction,
                               uint32_t ComputedFlexBasisGeneration, float_t ComputedFlexBasis, bool HadOverflow, uint32_t GenerationCount,
                               ::UnityEngine::UIElements::Layout::LayoutDirection LastParentDirection, float_t LastPointScaleFactor,
                               ::UnityEngine::UIElements::Layout::LayoutComputedData__MeasuredDimensions_e__FixedBuffer MeasuredDimensions) noexcept;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 5410 };

  /// @brief The size of the true value type
  static constexpr auto __IL2CPP_VALUE_TYPE_SIZE{ 0x84 };

  /// @brief Field Position, offset: 0x0, size: 0x10, def value: None
  ::UnityEngine::UIElements::Layout::LayoutComputedData__Position_e__FixedBuffer Position;

  /// @brief Field Dimensions, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::UIElements::Layout::LayoutComputedData__Dimensions_e__FixedBuffer Dimensions;

  /// @brief Field Margin, offset: 0x18, size: 0x18, def value: None
  ::UnityEngine::UIElements::Layout::LayoutComputedData__Margin_e__FixedBuffer Margin;

  /// @brief Field Border, offset: 0x30, size: 0x18, def value: None
  ::UnityEngine::UIElements::Layout::LayoutComputedData__Border_e__FixedBuffer Border;

  /// @brief Field Padding, offset: 0x48, size: 0x18, def value: None
  ::UnityEngine::UIElements::Layout::LayoutComputedData__Padding_e__FixedBuffer Padding;

  /// @brief Field Direction, offset: 0x60, size: 0x4, def value: None
  ::UnityEngine::UIElements::Layout::LayoutDirection Direction;

  /// @brief Field ComputedFlexBasisGeneration, offset: 0x64, size: 0x4, def value: None
  uint32_t ComputedFlexBasisGeneration;

  /// @brief Field ComputedFlexBasis, offset: 0x68, size: 0x4, def value: None
  float_t ComputedFlexBasis;

  /// @brief Field HadOverflow, offset: 0x6c, size: 0x1, def value: None
  bool HadOverflow;

  /// @brief Field GenerationCount, offset: 0x70, size: 0x4, def value: None
  uint32_t GenerationCount;

  /// @brief Field LastParentDirection, offset: 0x74, size: 0x4, def value: None
  ::UnityEngine::UIElements::Layout::LayoutDirection LastParentDirection;

  /// @brief Field LastPointScaleFactor, offset: 0x78, size: 0x4, def value: None
  float_t LastPointScaleFactor;

  /// @brief Field MeasuredDimensions, offset: 0x7c, size: 0x8, def value: None
  ::UnityEngine::UIElements::Layout::LayoutComputedData__MeasuredDimensions_e__FixedBuffer MeasuredDimensions;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = true;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData, Position) == 0x0, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData, Dimensions) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData, Margin) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData, Border) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData, Padding) == 0x48, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData, Direction) == 0x60, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData, ComputedFlexBasisGeneration) == 0x64, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData, ComputedFlexBasis) == 0x68, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData, HadOverflow) == 0x6c, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData, GenerationCount) == 0x70, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData, LastParentDirection) == 0x74, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData, LastPointScaleFactor) == 0x78, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::UIElements::Layout::LayoutComputedData, MeasuredDimensions) == 0x7c, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::UIElements::Layout::LayoutComputedData, 0x84>, "Size mismatch!");

} // namespace UnityEngine::UIElements::Layout
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::Layout::LayoutComputedData, "UnityEngine.UIElements.Layout", "LayoutComputedData");
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::Layout::LayoutComputedData__Border_e__FixedBuffer, "UnityEngine.UIElements.Layout", "LayoutComputedData/<Border>e__FixedBuffer");
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::Layout::LayoutComputedData__Dimensions_e__FixedBuffer, "UnityEngine.UIElements.Layout", "LayoutComputedData/<Dimensions>e__FixedBuffer");
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::Layout::LayoutComputedData__Margin_e__FixedBuffer, "UnityEngine.UIElements.Layout", "LayoutComputedData/<Margin>e__FixedBuffer");
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::Layout::LayoutComputedData__MeasuredDimensions_e__FixedBuffer, "UnityEngine.UIElements.Layout",
                       "LayoutComputedData/<MeasuredDimensions>e__FixedBuffer");
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::Layout::LayoutComputedData__Padding_e__FixedBuffer, "UnityEngine.UIElements.Layout", "LayoutComputedData/<Padding>e__FixedBuffer");
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::Layout::LayoutComputedData__Position_e__FixedBuffer, "UnityEngine.UIElements.Layout", "LayoutComputedData/<Position>e__FixedBuffer");
