#pragma once
// IWYU pragma private; include "UnityEngine/Rendering/Universal/PostProcessPass.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__Object_def.hpp"
#include "UnityEngine/Experimental/Rendering/zzzz__GraphicsFormat_def.hpp"
#include "UnityEngine/Rendering/RenderGraphModule/zzzz__TextureHandle_def.hpp"
#include "UnityEngine/Rendering/Universal/zzzz__AntialiasingQuality_def.hpp"
#include "UnityEngine/Rendering/Universal/zzzz__RenderingData_def.hpp"
#include "UnityEngine/Rendering/Universal/zzzz__ScriptableRenderPass_def.hpp"
#include "UnityEngine/Rendering/Universal/zzzz__TonemappingMode_def.hpp"
#include "UnityEngine/Rendering/zzzz__HDROutputUtils_def.hpp"
#include "UnityEngine/zzzz__Rect_def.hpp"
#include "UnityEngine/zzzz__RenderTextureDescriptor_def.hpp"
#include "UnityEngine/zzzz__Vector2Int_def.hpp"
#include "UnityEngine/zzzz__Vector3_def.hpp"
#include "UnityEngine/zzzz__Vector4_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cmath>
#include <cstddef>
#include <cstdint>
CORDL_MODULE_EXPORT(PostProcessPass)
namespace System {
template <typename T1, typename T2, typename T3, typename TResult> class Func_4;
}
namespace UnityEngine::Experimental::Rendering {
struct GraphicsFormat;
}
namespace UnityEngine::Experimental::Rendering {
class XRPass;
}
namespace UnityEngine::Rendering::RenderGraphModule {

class PostProcessPass_StopNaNsPassData;
}
namespace UnityEngine::Rendering::Universal {
class PostProcessPass_UberPostPassData;
}
namespace UnityEngine::Rendering::Universal {
class PostProcessPass_UberSetupBloomPassData;
}
namespace UnityEngine::Rendering::Universal {
class PostProcessPass_UpdateCameraResolutionPassData;
}
namespace UnityEngine::Rendering::Universal {
class PostProcessPass___c;
}
namespace UnityEngine::Rendering::Universal {
struct PostProcessPass_BloomMaterialParams;
}
namespace UnityEngine::Rendering::Universal {
struct PostProcessPass_FinalBlitSettings;
}
namespace UnityEngine::Rendering::Universal {
struct PostProcessPass___c__DisplayClass89_0;
}
// Write type traits
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_BloomPassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_DoFBokehPassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_DoFGaussianPassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_LensFlarePassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_LensFlareScreenSpacePassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_MotionBlurPassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_PaniniProjectionPassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_PostFXSetupPassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_PostProcessingFinalBlitPassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_PostProcessingFinalFSRScalePassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_PostProcessingFinalSetupPassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_SMAAPassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_SMAASetupPassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_ShaderConstants);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_StopNaNsPassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_UberPostPassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_UberSetupBloomPassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass_UpdateCameraResolutionPassData);
MARK_REF_PTR_T(::UnityEngine::Rendering::Universal::PostProcessPass___c);
MARK_VAL_T(::UnityEngine::Rendering::Universal::PostProcessPass_BloomMaterialParams);
MARK_VAL_T(::UnityEngine::Rendering::Universal::PostProcessPass_FinalBlitSettings);
MARK_VAL_T(::UnityEngine::Rendering::Universal::PostProcessPass___c__DisplayClass89_0);
// Dependencies System.Object
namespace UnityEngine::Rendering::Universal {
// Is value type: false
// CS Name: UnityEngine.Rendering.Universal.PostProcessPass/MaterialLibrary
class CORDL_TYPE PostProcessPass_MaterialLibrary : public ::System::Object {
public:
  // Declarations
  /// @brief Field bloom, offset 0x50, size 0x8
  __declspec(property(get = __cordl_internal_get_bloom, put = __cordl_internal_set_bloom)) ::UnityW<::UnityEngine::Material> bloom;

  /// @brief Field bloomUpsample, offset 0x58, size 0x8
  __declspec(property(get = __cordl_internal_get_bloomUpsample, put = __cordl_internal_set_bloomUpsample)) ::ArrayW<::UnityW<::UnityEngine::Material>, ::Array<::UnityW<::UnityEngine::Material>>*>
      bloomUpsample;

  /// @brief Field bokehDepthOfField, offset 0x30, size 0x8
  __declspec(property(get = __cordl_internal_get_bokehDepthOfField, put = __cordl_internal_set_bokehDepthOfField)) ::UnityW<::UnityEngine::Material> bokehDepthOfField;

  /// @brief Field bokehDepthOfFieldCoC, offset 0x38, size 0x8
  __declspec(property(get = __cordl_internal_get_bokehDepthOfFieldCoC, put = __cordl_internal_set_bokehDepthOfFieldCoC)) ::UnityW<::UnityEngine::Material> bokehDepthOfFieldCoC;

  /// @brief Field cameraMotionBlur, offset 0x40, size 0x8
  __declspec(property(get = __cordl_internal_get_cameraMotionBlur, put = __cordl_internal_set_cameraMotionBlur)) ::UnityW<::UnityEngine::Material> cameraMotionBlur;

  /// @brief Field easu, offset 0x70, size 0x8
  __declspec(property(get = __cordl_internal_get_easu, put = __cordl_internal_set_easu)) ::UnityW<::UnityEngine::Material> easu;

  /// @brief Field finalPass, offset 0x80, size 0x8
  __declspec(property(get = __cordl_internal_get_finalPass, put = __cordl_internal_set_finalPass)) ::UnityW<::UnityEngine::Material> finalPass;

  /// @brief Field gaussianDepthOfField, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_gaussianDepthOfField, put = __cordl_internal_set_gaussianDepthOfField)) ::UnityW<::UnityEngine::Material> gaussianDepthOfField;

  /// @brief Field gaussianDepthOfFieldCoC, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_gaussianDepthOfFieldCoC, put = __cordl_internal_set_gaussianDepthOfFieldCoC)) ::UnityW<::UnityEngine::Material> gaussianDepthOfFieldCoC;

  /// @brief Field lensFlareDataDriven, offset 0x88, size 0x8
  __declspec(property(get = __cordl_internal_get_lensFlareDataDriven, put = __cordl_internal_set_lensFlareDataDriven)) ::UnityW<::UnityEngine::Material> lensFlareDataDriven;

  /// @brief Field lensFlareScreenSpace, offset 0x90, size 0x8
  __declspec(property(get = __cordl_internal_get_lensFlareScreenSpace, put = __cordl_internal_set_lensFlareScreenSpace)) ::UnityW<::UnityEngine::Material> lensFlareScreenSpace;

  /// @brief Field paniniProjection, offset 0x48, size 0x8
  __declspec(property(get = __cordl_internal_get_paniniProjection, put = __cordl_internal_set_paniniProjection)) ::UnityW<::UnityEngine::Material> paniniProjection;

  /// @brief Field scalingSetup, offset 0x68, size 0x8
  __declspec(property(get = __cordl_internal_get_scalingSetup, put = __cordl_internal_set_scalingSetup)) ::UnityW<::UnityEngine::Material> scalingSetup;

  /// @brief Field stopNaN, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_stopNaN, put = __cordl_internal_set_stopNaN)) ::UnityW<::UnityEngine::Material> stopNaN;

  /// @brief Field subpixelMorphologicalAntialiasing, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_subpixelMorphologicalAntialiasing, put = __cordl_internal_set_subpixelMorphologicalAntialiasing)) ::UnityW<::UnityEngine::Material>
      subpixelMorphologicalAntialiasing;

  /// @brief Field temporalAntialiasing, offset 0x60, size 0x8
  __declspec(property(get = __cordl_internal_get_temporalAntialiasing, put = __cordl_internal_set_temporalAntialiasing)) ::UnityW<::UnityEngine::Material> temporalAntialiasing;

  /// @brief Field uber, offset 0x78, size 0x8
  __declspec(property(get = __cordl_internal_get_uber, put = __cordl_internal_set_uber)) ::UnityW<::UnityEngine::Material> uber;

  /// @brief Method Cleanup, addr 0x66d1700, size 0x170, virtual false, abstract: false, final false
  inline void Cleanup();

  /// @brief Method Load, addr 0x66e4258, size 0x188, virtual false, abstract: false, final false
  inline ::UnityW<::UnityEngine::Material> Load(::UnityEngine::Shader* shader);

  static inline ::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary* New_ctor(::UnityEngine::Rendering::Universal::PostProcessData* data);

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_bloom() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_bloom();

  constexpr ::ArrayW<::UnityW<::UnityEngine::Material>, ::Array<::UnityW<::UnityEngine::Material>>*> const& __cordl_internal_get_bloomUpsample() const;

  constexpr ::ArrayW<::UnityW<::UnityEngine::Material>, ::Array<::UnityW<::UnityEngine::Material>>*>& __cordl_internal_get_bloomUpsample();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_bokehDepthOfField() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_bokehDepthOfField();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_bokehDepthOfFieldCoC() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_bokehDepthOfFieldCoC();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_cameraMotionBlur() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_cameraMotionBlur();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_easu() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_easu();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_finalPass() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_finalPass();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_gaussianDepthOfField() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_gaussianDepthOfField();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_gaussianDepthOfFieldCoC() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_gaussianDepthOfFieldCoC();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_lensFlareDataDriven() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_lensFlareDataDriven();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_lensFlareScreenSpace() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_lensFlareScreenSpace();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_paniniProjection() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_paniniProjection();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_scalingSetup() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_scalingSetup();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_stopNaN() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_stopNaN();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_subpixelMorphologicalAntialiasing() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_subpixelMorphologicalAntialiasing();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_temporalAntialiasing() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_temporalAntialiasing();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_uber() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_uber();

  constexpr void __cordl_internal_set_bloom(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_bloomUpsample(::ArrayW<::UnityW<::UnityEngine::Material>, ::Array<::UnityW<::UnityEngine::Material>>*> value);

  constexpr void __cordl_internal_set_bokehDepthOfField(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_bokehDepthOfFieldCoC(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_cameraMotionBlur(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_easu(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_finalPass(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_gaussianDepthOfField(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_gaussianDepthOfFieldCoC(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_lensFlareDataDriven(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_lensFlareScreenSpace(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_paniniProjection(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_scalingSetup(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_stopNaN(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_subpixelMorphologicalAntialiasing(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_temporalAntialiasing(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_uber(::UnityW<::UnityEngine::Material> value);

  /// @brief Method .ctor, addr 0x66d1378, size 0x220, virtual false, abstract: false, final false
  inline void _ctor(::UnityEngine::Rendering::Universal::PostProcessData* data);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr PostProcessPass_MaterialLibrary();

public:
  // Ctor Parameters [CppParam { name: "", ty: "PostProcessPass_MaterialLibrary", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  PostProcessPass_MaterialLibrary(PostProcessPass_MaterialLibrary&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "PostProcessPass_MaterialLibrary", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  PostProcessPass_MaterialLibrary(PostProcessPass_MaterialLibrary const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12821 };

  /// @brief Field stopNaN, offset: 0x10, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___stopNaN;

  /// @brief Field subpixelMorphologicalAntialiasing, offset: 0x18, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___subpixelMorphologicalAntialiasing;

  /// @brief Field gaussianDepthOfField, offset: 0x20, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___gaussianDepthOfField;

  /// @brief Field gaussianDepthOfFieldCoC, offset: 0x28, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___gaussianDepthOfFieldCoC;

  /// @brief Field bokehDepthOfField, offset: 0x30, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___bokehDepthOfField;

  /// @brief Field bokehDepthOfFieldCoC, offset: 0x38, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___bokehDepthOfFieldCoC;

  /// @brief Field cameraMotionBlur, offset: 0x40, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___cameraMotionBlur;

  /// @brief Field paniniProjection, offset: 0x48, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___paniniProjection;

  /// @brief Field bloom, offset: 0x50, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___bloom;

  /// @brief Field bloomUpsample, offset: 0x58, size: 0x8, def value: None
  ::ArrayW<::UnityW<::UnityEngine::Material>, ::Array<::UnityW<::UnityEngine::Material>>*> ___bloomUpsample;

  /// @brief Field temporalAntialiasing, offset: 0x60, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___temporalAntialiasing;

  /// @brief Field scalingSetup, offset: 0x68, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___scalingSetup;

  /// @brief Field easu, offset: 0x70, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___easu;

  /// @brief Field uber, offset: 0x78, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___uber;

  /// @brief Field finalPass, offset: 0x80, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___finalPass;

  /// @brief Field lensFlareDataDriven, offset: 0x88, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___lensFlareDataDriven;

  /// @brief Field lensFlareScreenSpace, offset: 0x90, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___lensFlareScreenSpace;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___stopNaN) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___subpixelMorphologicalAntialiasing) == 0x18, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___gaussianDepthOfField) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___gaussianDepthOfFieldCoC) == 0x28, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___bokehDepthOfField) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___bokehDepthOfFieldCoC) == 0x38, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___cameraMotionBlur) == 0x40, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___paniniProjection) == 0x48, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___bloom) == 0x50, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___bloomUpsample) == 0x58, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___temporalAntialiasing) == 0x60, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___scalingSetup) == 0x68, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___easu) == 0x70, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___uber) == 0x78, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___finalPass) == 0x80, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___lensFlareDataDriven) == 0x88, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, ___lensFlareScreenSpace) == 0x90, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::Universal::PostProcessPass_MaterialLibrary, 0x98>, "Size mismatch!");

} // namespace UnityEngine::Rendering::Universal
// Dependencies System.Object
namespace UnityEngine::Rendering::Universal {
// Is value type: false
// CS Name: UnityEngine.Rendering.Universal.PostProcessPass/ShaderConstants
class CORDL_TYPE PostProcessPass_ShaderConstants : public ::System::Object {
public:
  // Declarations
  /// @brief Field _AreaTexture, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__AreaTexture, put = setStaticF__AreaTexture)) int32_t _AreaTexture;

  /// @brief Field _BlendTexture, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__BlendTexture, put = setStaticF__BlendTexture)) int32_t _BlendTexture;

  /// @brief Field _BloomMipDown, offset 0xffffffff, size 0x8
  __declspec(property(get = getStaticF__BloomMipDown, put = setStaticF__BloomMipDown)) ::ArrayW<int32_t, ::Array<int32_t>*> _BloomMipDown;

  /// @brief Field _BloomMipUp, offset 0xffffffff, size 0x8
  __declspec(property(get = getStaticF__BloomMipUp, put = setStaticF__BloomMipUp)) ::ArrayW<int32_t, ::Array<int32_t>*> _BloomMipUp;

  /// @brief Field _Bloom_Params, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__Bloom_Params, put = setStaticF__Bloom_Params)) int32_t _Bloom_Params;

  /// @brief Field _Bloom_Texture, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__Bloom_Texture, put = setStaticF__Bloom_Texture)) int32_t _Bloom_Texture;

  /// @brief Field _BokehConstants, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__BokehConstants, put = setStaticF__BokehConstants)) int32_t _BokehConstants;

  /// @brief Field _BokehKernel, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__BokehKernel, put = setStaticF__BokehKernel)) int32_t _BokehKernel;

  /// @brief Field _Chroma_Params, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__Chroma_Params, put = setStaticF__Chroma_Params)) int32_t _Chroma_Params;

  /// @brief Field _CoCParams, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__CoCParams, put = setStaticF__CoCParams)) int32_t _CoCParams;

  /// @brief Field _ColorTexture, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__ColorTexture, put = setStaticF__ColorTexture)) int32_t _ColorTexture;

  /// @brief Field _Distortion_Params1, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__Distortion_Params1, put = setStaticF__Distortion_Params1)) int32_t _Distortion_Params1;

  /// @brief Field _Distortion_Params2, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__Distortion_Params2, put = setStaticF__Distortion_Params2)) int32_t _Distortion_Params2;

  /// @brief Field _DofTexture, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__DofTexture, put = setStaticF__DofTexture)) int32_t _DofTexture;

  /// @brief Field _DownSampleScaleFactor, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__DownSampleScaleFactor, put = setStaticF__DownSampleScaleFactor)) int32_t _DownSampleScaleFactor;

  /// @brief Field _EdgeTexture, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__EdgeTexture, put = setStaticF__EdgeTexture)) int32_t _EdgeTexture;

  /// @brief Field _FlareColorValue, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__FlareColorValue, put = setStaticF__FlareColorValue)) int32_t _FlareColorValue;

  /// @brief Field _FlareData0, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__FlareData0, put = setStaticF__FlareData0)) int32_t _FlareData0;

  /// @brief Field _FlareData1, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__FlareData1, put = setStaticF__FlareData1)) int32_t _FlareData1;

  /// @brief Field _FlareData2, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__FlareData2, put = setStaticF__FlareData2)) int32_t _FlareData2;

  /// @brief Field _FlareData3, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__FlareData3, put = setStaticF__FlareData3)) int32_t _FlareData3;

  /// @brief Field _FlareData4, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__FlareData4, put = setStaticF__FlareData4)) int32_t _FlareData4;

  /// @brief Field _FlareData5, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__FlareData5, put = setStaticF__FlareData5)) int32_t _FlareData5;

  /// @brief Field _FlareOcclusionIndex, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__FlareOcclusionIndex, put = setStaticF__FlareOcclusionIndex)) int32_t _FlareOcclusionIndex;

  /// @brief Field _FlareOcclusionRemapTex, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__FlareOcclusionRemapTex, put = setStaticF__FlareOcclusionRemapTex)) int32_t _FlareOcclusionRemapTex;

  /// @brief Field _FlareOcclusionTex, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__FlareOcclusionTex, put = setStaticF__FlareOcclusionTex)) int32_t _FlareOcclusionTex;

  /// @brief Field _FlareTex, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__FlareTex, put = setStaticF__FlareTex)) int32_t _FlareTex;

  /// @brief Field _FullCoCTexture, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__FullCoCTexture, put = setStaticF__FullCoCTexture)) int32_t _FullCoCTexture;

  /// @brief Field _FullscreenProjMat, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__FullscreenProjMat, put = setStaticF__FullscreenProjMat)) int32_t _FullscreenProjMat;

  /// @brief Field _HalfCoCTexture, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__HalfCoCTexture, put = setStaticF__HalfCoCTexture)) int32_t _HalfCoCTexture;

  /// @brief Field _InternalLut, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__InternalLut, put = setStaticF__InternalLut)) int32_t _InternalLut;

  /// @brief Field _LensDirt_Intensity, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__LensDirt_Intensity, put = setStaticF__LensDirt_Intensity)) int32_t _LensDirt_Intensity;

  /// @brief Field _LensDirt_Params, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__LensDirt_Params, put = setStaticF__LensDirt_Params)) int32_t _LensDirt_Params;

  /// @brief Field _LensDirt_Texture, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__LensDirt_Texture, put = setStaticF__LensDirt_Texture)) int32_t _LensDirt_Texture;

  /// @brief Field _Lut_Params, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__Lut_Params, put = setStaticF__Lut_Params)) int32_t _Lut_Params;

  /// @brief Field _Metrics, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__Metrics, put = setStaticF__Metrics)) int32_t _Metrics;

  /// @brief Field _Params, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__Params, put = setStaticF__Params)) int32_t _Params;

  /// @brief Field _PingTexture, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__PingTexture, put = setStaticF__PingTexture)) int32_t _PingTexture;

  /// @brief Field _PongTexture, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__PongTexture, put = setStaticF__PongTexture)) int32_t _PongTexture;

  /// @brief Field _SearchTexture, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__SearchTexture, put = setStaticF__SearchTexture)) int32_t _SearchTexture;

  /// @brief Field _SourceTexLowMip, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__SourceTexLowMip, put = setStaticF__SourceTexLowMip)) int32_t _SourceTexLowMip;

  /// @brief Field _StencilMask, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__StencilMask, put = setStaticF__StencilMask)) int32_t _StencilMask;

  /// @brief Field _StencilRef, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__StencilRef, put = setStaticF__StencilRef)) int32_t _StencilRef;

  /// @brief Field _TempTarget, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__TempTarget, put = setStaticF__TempTarget)) int32_t _TempTarget;

  /// @brief Field _TempTarget2, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__TempTarget2, put = setStaticF__TempTarget2)) int32_t _TempTarget2;

  /// @brief Field _UserLut, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__UserLut, put = setStaticF__UserLut)) int32_t _UserLut;

  /// @brief Field _UserLut_Params, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__UserLut_Params, put = setStaticF__UserLut_Params)) int32_t _UserLut_Params;

  /// @brief Field _Vignette_Params1, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__Vignette_Params1, put = setStaticF__Vignette_Params1)) int32_t _Vignette_Params1;

  /// @brief Field _Vignette_Params2, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__Vignette_Params2, put = setStaticF__Vignette_Params2)) int32_t _Vignette_Params2;

  /// @brief Field _Vignette_ParamsXR, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__Vignette_ParamsXR, put = setStaticF__Vignette_ParamsXR)) int32_t _Vignette_ParamsXR;

  static inline int32_t getStaticF__AreaTexture();

  static inline int32_t getStaticF__BlendTexture();

  static inline ::ArrayW<int32_t, ::Array<int32_t>*> getStaticF__BloomMipDown();

  static inline ::ArrayW<int32_t, ::Array<int32_t>*> getStaticF__BloomMipUp();

  static inline int32_t getStaticF__Bloom_Params();

  static inline int32_t getStaticF__Bloom_Texture();

  static inline int32_t getStaticF__BokehConstants();

  static inline int32_t getStaticF__BokehKernel();

  static inline int32_t getStaticF__Chroma_Params();

  static inline int32_t getStaticF__CoCParams();

  static inline int32_t getStaticF__ColorTexture();

  static inline int32_t getStaticF__Distortion_Params1();

  static inline int32_t getStaticF__Distortion_Params2();

  static inline int32_t getStaticF__DofTexture();

  static inline int32_t getStaticF__DownSampleScaleFactor();

  static inline int32_t getStaticF__EdgeTexture();

  static inline int32_t getStaticF__FlareColorValue();

  static inline int32_t getStaticF__FlareData0();

  static inline int32_t getStaticF__FlareData1();

  static inline int32_t getStaticF__FlareData2();

  static inline int32_t getStaticF__FlareData3();

  static inline int32_t getStaticF__FlareData4();

  static inline int32_t getStaticF__FlareData5();

  static inline int32_t getStaticF__FlareOcclusionIndex();

  static inline int32_t getStaticF__FlareOcclusionRemapTex();

  static inline int32_t getStaticF__FlareOcclusionTex();

  static inline int32_t getStaticF__FlareTex();

  static inline int32_t getStaticF__FullCoCTexture();

  static inline int32_t getStaticF__FullscreenProjMat();

  static inline int32_t getStaticF__HalfCoCTexture();

  static inline int32_t getStaticF__InternalLut();

  static inline int32_t getStaticF__LensDirt_Intensity();

  static inline int32_t getStaticF__LensDirt_Params();

  static inline int32_t getStaticF__LensDirt_Texture();

  static inline int32_t getStaticF__Lut_Params();

  static inline int32_t getStaticF__Metrics();

  static inline int32_t getStaticF__Params();

  static inline int32_t getStaticF__PingTexture();

  static inline int32_t getStaticF__PongTexture();

  static inline int32_t getStaticF__SearchTexture();

  static inline int32_t getStaticF__SourceTexLowMip();

  static inline int32_t getStaticF__StencilMask();

  static inline int32_t getStaticF__StencilRef();

  static inline int32_t getStaticF__TempTarget();

  static inline int32_t getStaticF__TempTarget2();

  static inline int32_t getStaticF__UserLut();

  static inline int32_t getStaticF__UserLut_Params();

  static inline int32_t getStaticF__Vignette_Params1();

  static inline int32_t getStaticF__Vignette_Params2();

  static inline int32_t getStaticF__Vignette_ParamsXR();

  static inline void setStaticF__AreaTexture(int32_t value);

  static inline void setStaticF__BlendTexture(int32_t value);

  static inline void setStaticF__BloomMipDown(::ArrayW<int32_t, ::Array<int32_t>*> value);

  static inline void setStaticF__BloomMipUp(::ArrayW<int32_t, ::Array<int32_t>*> value);

  static inline void setStaticF__Bloom_Params(int32_t value);

  static inline void setStaticF__Bloom_Texture(int32_t value);

  static inline void setStaticF__BokehConstants(int32_t value);

  static inline void setStaticF__BokehKernel(int32_t value);

  static inline void setStaticF__Chroma_Params(int32_t value);

  static inline void setStaticF__CoCParams(int32_t value);

  static inline void setStaticF__ColorTexture(int32_t value);

  static inline void setStaticF__Distortion_Params1(int32_t value);

  static inline void setStaticF__Distortion_Params2(int32_t value);

  static inline void setStaticF__DofTexture(int32_t value);

  static inline void setStaticF__DownSampleScaleFactor(int32_t value);

  static inline void setStaticF__EdgeTexture(int32_t value);

  static inline void setStaticF__FlareColorValue(int32_t value);

  static inline void setStaticF__FlareData0(int32_t value);

  static inline void setStaticF__FlareData1(int32_t value);

  static inline void setStaticF__FlareData2(int32_t value);

  static inline void setStaticF__FlareData3(int32_t value);

  static inline void setStaticF__FlareData4(int32_t value);

  static inline void setStaticF__FlareData5(int32_t value);

  static inline void setStaticF__FlareOcclusionIndex(int32_t value);

  static inline void setStaticF__FlareOcclusionRemapTex(int32_t value);

  static inline void setStaticF__FlareOcclusionTex(int32_t value);

  static inline void setStaticF__FlareTex(int32_t value);

  static inline void setStaticF__FullCoCTexture(int32_t value);

  static inline void setStaticF__FullscreenProjMat(int32_t value);

  static inline void setStaticF__HalfCoCTexture(int32_t value);

  static inline void setStaticF__InternalLut(int32_t value);

  static inline void setStaticF__LensDirt_Intensity(int32_t value);

  static inline void setStaticF__LensDirt_Params(int32_t value);

  static inline void setStaticF__LensDirt_Texture(int32_t value);

  static inline void setStaticF__Lut_Params(int32_t value);

  static inline void setStaticF__Metrics(int32_t value);

  static inline void setStaticF__Params(int32_t value);

  static inline void setStaticF__PingTexture(int32_t value);

  static inline void setStaticF__PongTexture(int32_t value);

  static inline void setStaticF__SearchTexture(int32_t value);

  static inline void setStaticF__SourceTexLowMip(int32_t value);

  static inline void setStaticF__StencilMask(int32_t value);

  static inline void setStaticF__StencilRef(int32_t value);

  static inline void setStaticF__TempTarget(int32_t value);

  static inline void setStaticF__TempTarget2(int32_t value);

  static inline void setStaticF__UserLut(int32_t value);

  static inline void setStaticF__UserLut_Params(int32_t value);

  static inline void setStaticF__Vignette_Params1(int32_t value);

  static inline void setStaticF__Vignette_Params2(int32_t value);

  static inline void setStaticF__Vignette_ParamsXR(int32_t value);

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr PostProcessPass_ShaderConstants();

public:
  // Ctor Parameters [CppParam { name: "", ty: "PostProcessPass_ShaderConstants", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  PostProcessPass_ShaderConstants(PostProcessPass_ShaderConstants&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "PostProcessPass_ShaderConstants", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  PostProcessPass_ShaderConstants(PostProcessPass_ShaderConstants const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12822 };

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::Universal::PostProcessPass_ShaderConstants, 0x10>, "Size mismatch!");

} // namespace UnityEngine::Rendering::Universal
// Dependencies System.Object, UnityEngine.Vector2Int
namespace UnityEngine::Rendering::Universal {
// Is value type: false
// CS Name: UnityEngine.Rendering.Universal.PostProcessPass/UpdateCameraResolutionPassData
class CORDL_TYPE PostProcessPass_UpdateCameraResolutionPassData : public ::System::Object {
public:
  // Declarations
  /// @brief Field newCameraTargetSize, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_newCameraTargetSize, put = __cordl_internal_set_newCameraTargetSize)) ::UnityEngine::Vector2Int newCameraTargetSize;

  static inline ::UnityEngine::Rendering::Universal::PostProcessPass_UpdateCameraResolutionPassData* New_ctor();

  constexpr ::UnityEngine::Vector2Int const& __cordl_internal_get_newCameraTargetSize() const;

  constexpr ::UnityEngine::Vector2Int& __cordl_internal_get_newCameraTargetSize();

  constexpr void __cordl_internal_set_newCameraTargetSize(::UnityEngine::Vector2Int value);

  /// @brief Method .ctor, addr 0x66e4ddc, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr PostProcessPass_UpdateCameraResolutionPassData();

public:
  // Ctor Parameters [CppParam { name: "", ty: "PostProcessPass_UpdateCameraResolutionPassData", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  PostProcessPass_UpdateCameraResolutionPassData(PostProcessPass_UpdateCameraResolutionPassData&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "PostProcessPass_UpdateCameraResolutionPassData", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  PostProcessPass_UpdateCameraResolutionPassData(PostProcessPass_UpdateCameraResolutionPassData const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12823 };

  /// @brief Field newCameraTargetSize, offset: 0x10, size: 0x8, def value: None
  ::UnityEngine::Vector2Int ___newCameraTargetSize;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_UpdateCameraResolutionPassData, ___newCameraTargetSize) == 0x10, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::Universal::PostProcessPass_UpdateCameraResolutionPassData, 0x18>, "Size mismatch!");

} // namespace UnityEngine::Rendering::Universal
// Dependencies System.Object, UnityEngine.Rendering.RenderGraphModule.TextureHandle
namespace UnityEngine::Rendering::Universal {
// Is value type: false
// CS Name: UnityEngine.Rendering.Universal.PostProcessPass/StopNaNsPassData
class CORDL_TYPE PostProcessPass_StopNaNsPassData : public ::System::Object {
public:
  // Declarations
  /// @brief Field sourceTexture, offset 0x20, size 0x10
  __declspec(property(get = __cordl_internal_get_sourceTexture, put = __cordl_internal_set_sourceTexture)) ::UnityEngine::Rendering::RenderGraphModule::TextureHandle sourceTexture;

  /// @brief Field stopNaN, offset 0x30, size 0x8
  __declspec(property(get = __cordl_internal_get_stopNaN, put = __cordl_internal_set_stopNaN)) ::UnityW<::UnityEngine::Material> stopNaN;

  /// @brief Field stopNaNTarget, offset 0x10, size 0x10
  __declspec(property(get = __cordl_internal_get_stopNaNTarget, put = __cordl_internal_set_stopNaNTarget)) ::UnityEngine::Rendering::RenderGraphModule::TextureHandle stopNaNTarget;

  static inline ::UnityEngine::Rendering::Universal::PostProcessPass_StopNaNsPassData* New_ctor();

  constexpr ::UnityEngine::Rendering::RenderGraphModule::TextureHandle const& __cordl_internal_get_sourceTexture() const;

  constexpr ::UnityEngine::Rendering::RenderGraphModule::TextureHandle& __cordl_internal_get_sourceTexture();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_stopNaN() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_stopNaN();

  constexpr ::UnityEngine::Rendering::RenderGraphModule::TextureHandle const& __cordl_internal_get_stopNaNTarget() const;

  constexpr ::UnityEngine::Rendering::RenderGraphModule::TextureHandle& __cordl_internal_get_stopNaNTarget();

  constexpr void __cordl_internal_set_sourceTexture(::UnityEngine::Rendering::RenderGraphModule::TextureHandle value);

  constexpr void __cordl_internal_set_stopNaN(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_stopNaNTarget(::UnityEngine::Rendering::RenderGraphModule::TextureHandle value);

  /// @brief Method .ctor, addr 0x66e4de0, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr PostProcessPass_StopNaNsPassData();

public:
  // Ctor Parameters [CppParam { name: "", ty: "PostProcessPass_StopNaNsPassData", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  PostProcessPass_StopNaNsPassData(PostProcessPass_StopNaNsPassData&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "PostProcessPass_StopNaNsPassData", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  PostProcessPass_StopNaNsPassData(PostProcessPass_StopNaNsPassData const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12824 };

  /// @brief Field stopNaNTarget, offset: 0x10, size: 0x10, def value: None
  ::UnityEngine::Rendering::RenderGraphModule::TextureHandle ___stopNaNTarget;

  /// @brief Field sourceTexture, offset: 0x20, size: 0x10, def value: None
  ::UnityEngine::Rendering::RenderGraphModule::TextureHandle ___sourceTexture;

  /// @brief Field stopNaN, offset: 0x30, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___stopNaN;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_StopNaNsPassData, ___stopNaNTarget) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_StopNaNsPassData, ___sourceTexture) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_StopNaNsPassData, ___stopNaN) == 0x30, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::Universal::PostProcessPass_StopNaNsPassData, 0x38>, "Size mismatch!");

} // namespace UnityEngine::Rendering::Universal
// Dependencies System.Object, UnityEngine.Rendering.Universal.AntialiasingQuality, UnityEngine.Vector4
namespace UnityEngine::Rendering::Universal {
// Is value type: false
// CS Name: UnityEngine.Rendering.Universal.PostProcessPass/SMAASetupPassData
class CORDL_TYPE PostProcessPass_SMAASetupPassData : public ::System::Object {
public:
  // Declarations
  /// @brief Field antialiasingQuality, offset 0x38, size 0x4
  __declspec(property(get = __cordl_internal_get_antialiasingQuality, put = __cordl_internal_set_antialiasingQuality)) ::UnityEngine::Rendering::Universal::AntialiasingQuality antialiasingQuality;

  /// @brief Field areaTexture, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_areaTexture, put = __cordl_internal_set_areaTexture)) ::UnityW<::UnityEngine::Texture2D> areaTexture;

  /// @brief Field material, offset 0x40, size 0x8
  __declspec(property(get = __cordl_internal_get_material, put = __cordl_internal_set_material)) ::UnityW<::UnityEngine::Material> material;

  /// @brief Field metrics, offset 0x10, size 0x10
  __declspec(property(get = __cordl_internal_get_metrics, put = __cordl_internal_set_metrics)) ::UnityEngine::Vector4 metrics;

  /// @brief Field searchTexture, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_searchTexture, put = __cordl_internal_set_searchTexture)) ::UnityW<::UnityEngine::Texture2D> searchTexture;

  /// @brief Field stencilMask, offset 0x34, size 0x4
  __declspec(property(get = __cordl_internal_get_stencilMask, put = __cordl_internal_set_stencilMask)) float_t stencilMask;

  /// @brief Field stencilRef, offset 0x30, size 0x4
  __declspec(property(get = __cordl_internal_get_stencilRef, put = __cordl_internal_set_stencilRef)) float_t stencilRef;

  static inline ::UnityEngine::Rendering::Universal::PostProcessPass_SMAASetupPassData* New_ctor();

  constexpr ::UnityEngine::Rendering::Universal::AntialiasingQuality const& __cordl_internal_get_antialiasingQuality() const;

  constexpr ::UnityEngine::Rendering::Universal::AntialiasingQuality& __cordl_internal_get_antialiasingQuality();

  constexpr ::UnityW<::UnityEngine::Texture2D> const& __cordl_internal_get_areaTexture() const;

  constexpr ::UnityW<::UnityEngine::Texture2D>& __cordl_internal_get_areaTexture();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_material() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_material();

  constexpr ::UnityEngine::Vector4 const& __cordl_internal_get_metrics() const;

  constexpr ::UnityEngine::Vector4& __cordl_internal_get_metrics();

  constexpr ::UnityW<::UnityEngine::Texture2D> const& __cordl_internal_get_searchTexture() const;

  constexpr ::UnityW<::UnityEngine::Texture2D>& __cordl_internal_get_searchTexture();

  constexpr float_t const& __cordl_internal_get_stencilMask() const;

  constexpr float_t& __cordl_internal_get_stencilMask();

  constexpr float_t const& __cordl_internal_get_stencilRef() const;

  constexpr float_t& __cordl_internal_get_stencilRef();

  constexpr void __cordl_internal_set_antialiasingQuality(::UnityEngine::Rendering::Universal::AntialiasingQuality value);

  constexpr void __cordl_internal_set_areaTexture(::UnityW<::UnityEngine::Texture2D> value);

  constexpr void __cordl_internal_set_material(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_metrics(::UnityEngine::Vector4 value);

  constexpr void __cordl_internal_set_searchTexture(::UnityW<::UnityEngine::Texture2D> value);

  constexpr void __cordl_internal_set_stencilMask(float_t value);

  constexpr void __cordl_internal_set_stencilRef(float_t value);

  /// @brief Method .ctor, addr 0x66e4de4, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr PostProcessPass_SMAASetupPassData();

public:
  // Ctor Parameters [CppParam { name: "", ty: "PostProcessPass_SMAASetupPassData", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  PostProcessPass_SMAASetupPassData(PostProcessPass_SMAASetupPassData&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "PostProcessPass_SMAASetupPassData", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  PostProcessPass_SMAASetupPassData(PostProcessPass_SMAASetupPassData const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12825 };

  /// @brief Field metrics, offset: 0x10, size: 0x10, def value: None
  ::UnityEngine::Vector4 ___metrics;

  /// @brief Field areaTexture, offset: 0x20, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Texture2D> ___areaTexture;

  /// @brief Field searchTexture, offset: 0x28, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Texture2D> ___searchTexture;

  /// @brief Field stencilRef, offset: 0x30, size: 0x4, def value: None
  float_t ___stencilRef;

  /// @brief Field stencilMask, offset: 0x34, size: 0x4, def value: None
  float_t ___stencilMask;

  /// @brief Field antialiasingQuality, offset: 0x38, size: 0x4, def value: None
  ::UnityEngine::Rendering::Universal::AntialiasingQuality ___antialiasingQuality;

  /// @brief Field material, offset: 0x40, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___material;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_SMAASetupPassData, ___metrics) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_SMAASetupPassData, ___areaTexture) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_SMAASetupPassData, ___searchTexture) == 0x28, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_SMAASetupPassData, ___stencilRef) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_SMAASetupPassData, ___stencilMask) == 0x34, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_SMAASetupPassData, ___antialiasingQuality) == 0x38, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_SMAASetupPassData, ___material) == 0x40, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::Universal::PostProcessPass_SMAASetupPassData, 0x48>, "Size mismatch!");

} // namespace UnityEngine::Rendering::Universal
// Dependencies System.Object, UnityEngine.Rendering.RenderGraphModule.TextureHandle
namespace UnityEngine::Rendering::Universal {
// Is value type: false
// CS Name: UnityEngine.Rendering.Universal.PostProcessPass/SMAAPassData
class CORDL_TYPE PostProcessPass_SMAAPassData : public ::System::Object {
public:
  // Declarations
  /// @brief Field blendTexture, offset 0x40, size 0x10
  __declspec(property(get = __cordl_internal_get_blendTexture, put = __cordl_internal_set_blendTexture)) ::UnityEngine::Rendering::RenderGraphModule::TextureHandle blendTexture;

  /// @brief Field depthStencilTexture, offset 0x30, size 0x10
  __declspec(property(get = __cordl_internal_get_depthStencilTexture, put = __cordl_internal_set_depthStencilTexture)) ::UnityEngine::Rendering::RenderGraphModule::TextureHandle depthStencilTexture;

  /// @brief Field destinationTexture, offset 0x10, size 0x10
  __declspec(property(get = __cordl_internal_get_destinationTexture, put = __cordl_internal_set_destinationTexture)) ::UnityEngine::Rendering::RenderGraphModule::TextureHandle destinationTexture;

  /// @brief Field material, offset 0x50, size 0x8
  __declspec(property(get = __cordl_internal_get_material, put = __cordl_internal_set_material)) ::UnityW<::UnityEngine::Material> material;

  /// @brief Field sourceTexture, offset 0x20, size 0x10
  __declspec(property(get = __cordl_internal_get_sourceTexture, put = __cordl_internal_set_sourceTexture)) ::UnityEngine::Rendering::RenderGraphModule::TextureHandle sourceTexture;

  static inline ::UnityEngine::Rendering::Universal::PostProcessPass_SMAAPassData* New_ctor();

  constexpr ::UnityEngine::Rendering::RenderGraphModule::TextureHandle const& __cordl_internal_get_blendTexture() const;

  constexpr ::UnityEngine::Rendering::RenderGraphModule::TextureHandle& __cordl_internal_get_blendTexture();

  constexpr ::UnityEngine::Rendering::RenderGraphModule::TextureHandle const& __cordl_internal_get_depthStencilTexture() const;

  constexpr ::UnityEngine::Rendering::RenderGraphModule::TextureHandle& __cordl_internal_get_depthStencilTexture();

  constexpr ::UnityEngine::Rendering::RenderGraphModule::TextureHandle const& __cordl_internal_get_destinationTexture() const;

  constexpr ::UnityEngine::Rendering::RenderGraphModule::TextureHandle& __cordl_internal_get_destinationTexture();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_material() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_material();

  constexpr ::UnityEngine::Rendering::RenderGraphModule::TextureHandle const& __cordl_internal_get_sourceTexture() const;

  constexpr ::UnityEngine::Rendering::RenderGraphModule::TextureHandle& __cordl_internal_get_sourceTexture();

  constexpr void __cordl_internal_set_blendTexture(::UnityEngine::Rendering::RenderGraphModule::TextureHandle value);

  constexpr void __cordl_internal_set_depthStencilTexture(::UnityEngine::Rendering::RenderGraphModule::TextureHandle value);

  constexpr void __cordl_internal_set_destinationTexture(::UnityEngine::Rendering::RenderGraphModule::TextureHandle value);

  constexpr void __cordl_internal_set_material(::UnityW<::UnityEngine::Material> value);

  constexpr void __cordl_internal_set_sourceTexture(::UnityEngine::Rendering::RenderGraphModule::TextureHandle value);

  /// @brief Method .ctor, addr 0x66e4de8, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr PostProcessPass_SMAAPassData();

public:
  // Ctor Parameters [CppParam { name: "", ty: "PostProcessPass_SMAAPassData", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  PostProcessPass_SMAAPassData(PostProcessPass_SMAAPassData&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "PostProcessPass_SMAAPassData", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  PostProcessPass_SMAAPassData(PostProcessPass_SMAAPassData const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12826 };

  /// @brief Field destinationTexture, offset: 0x10, size: 0x10, def value: None
  ::UnityEngine::Rendering::RenderGraphModule::TextureHandle ___destinationTexture;

  /// @brief Field sourceTexture, offset: 0x20, size: 0x10, def value: None
  ::UnityEngine::Rendering::RenderGraphModule::TextureHandle ___sourceTexture;

  /// @brief Field depthStencilTexture, offset: 0x30, size: 0x10, def value: None
  ::UnityEngine::Rendering::RenderGraphModule::TextureHandle ___depthStencilTexture;

  /// @brief Field blendTexture, offset: 0x40, size: 0x10, def value: None
  ::UnityEngine::Rendering::RenderGraphModule::TextureHandle ___blendTexture;

  /// @brief Field material, offset: 0x50, size: 0x8, def value: None
  ::UnityW<::UnityEngine::Material> ___material;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_SMAAPassData, ___destinationTexture) == 0x10, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_SMAAPassData, ___sourceTexture) == 0x20, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_SMAAPassData, ___depthStencilTexture) == 0x30, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_SMAAPassData, ___blendTexture) == 0x40, "Offset mismatch!");

static_assert(offsetof(::UnityEngine::Rendering::Universal::PostProcessPass_SMAAPassData, ___material) == 0x50, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::UnityEngine::Rendering::Universal::PostProcessPass_SMAAPassData, 0x58>, "Size mismatch!");

} // namespace UnityEngine::Rendering::Universal
// Dependencies System.Object, UnityEngine.Rendering.RenderGraphModule.TextureHandle, UnityEngine.Vector4
namespace UnityEngine::Rendering::Universal {
// Is value type: false
// CS Name: UnityEngine.Rendering.Universal.PostProcessPass/UberSetupBloomPassData
class CORDL_TYPE PostProcessPass_UberSetupBloomPassData : public ::System::Object {
public:
  // Declarations
  /// @brief Field bloomParams, offset 0x10, size 0x10
  __declspec(property(get = __cordl_internal_get_bloomParams, put = __cordl_internal_set_bloomParams)) ::UnityEngine::Vector4 bloomParams;

  /// @brief Field bloomTexture, offset 0x44, size 0x10
  __declspec(property(get = __cordl_internal_get_bloomTexture, put = __cordl_internal_set_bloomTexture)) ::UnityEngine::Rendering::RenderGraphModule::TextureHandle bloomTexture;

  /// @brief Field dirtIntensity, offset 0x30, size 0x4
  __declspec(property(get = __cordl_internal_get_dirtIntensity, put = __cordl_internal_set_dirtIntensity)) float_t dirtIntensity;

  /// @brief Field dirtScaleOffset, offset 0x20, size 0x10
  __declspec(property(get = __cordl_internal_get_dirtScaleOffset, put = __cordl_internal_set_dirtScaleOffset)) ::UnityEngine::Vector4 dirtScaleOffset;

  /// @brief Field dirtTexture, offset 0x38, size 0x8
  __declspec(property(get = __cordl_internal_get_dirtTexture, put = __cordl_internal_set_dirtTexture)) ::UnityW<::UnityEngine::Texture> dirtTexture;

  /// @brief Field highQualityFilteringValue, offset 0x40, size 0x1
  __declspec(property(get = __cordl_internal_get_highQualityFilteringValue, put = __cordl_internal_set_highQualityFilteringValue)) bool highQualityFilteringValue;

  /// @brief Field uberMaterial, offset 0x58, size 0x8
  __declspec(property(get = __cordl_internal_get_uberMaterial, put = __cordl_internal_set_uberMaterial)) ::UnityW<::UnityEngine::Material> uberMaterial;

  static inline ::UnityEngine::Rendering::Universal::PostProcessPass_UberSetupBloomPassData* New_ctor();

  constexpr ::UnityEngine::Vector4 const& __cordl_internal_get_bloomParams() const;

  constexpr ::UnityEngine::Vector4& __cordl_internal_get_bloomParams();

  constexpr ::UnityEngine::Rendering::RenderGraphModule::TextureHandle const& __cordl_internal_get_bloomTexture() const;

  constexpr ::UnityEngine::Rendering::RenderGraphModule::TextureHandle& __cordl_internal_get_bloomTexture();

  constexpr float_t const& __cordl_internal_get_dirtIntensity() const;

  constexpr float_t& __cordl_internal_get_dirtIntensity();

  constexpr ::UnityEngine::Vector4 const& __cordl_internal_get_dirtScaleOffset() const;

  constexpr ::UnityEngine::Vector4& __cordl_internal_get_dirtScaleOffset();

  constexpr ::UnityW<::UnityEngine::Texture> const& __cordl_internal_get_dirtTexture() const;

  constexpr ::UnityW<::UnityEngine::Texture>& __cordl_internal_get_dirtTexture();

  constexpr bool const& __cordl_internal_get_highQualityFilteringValue() const;

  constexpr bool& __cordl_internal_get_highQualityFilteringValue();

  constexpr ::UnityW<::UnityEngine::Material> const& __cordl_internal_get_uberMaterial() const;

  constexpr ::UnityW<::UnityEngine::Material>& __cordl_internal_get_uberMaterial();

  constexpr void __cordl_internal_set_bloomParams(::UnityEngine::Vector4 value);

  constexpr void __cordl_internal_set_bloomTexture(::UnityEngine::Rendering::RenderGraphModule::TextureHandle value);

  constexpr void __cordl_internal_set_dirtIntensity(float_t value);

  constexpr void __cordl_internal_set_dirtScaleOffset(::UnityEngine::Vector4 value);

  constexpr void __cordl_internal_set_dirtTexture(::UnityW<::UnityEngine::Texture> value);

  constexpr void __cordl_internal_set_highQualityFilteringValue(bool value);

  constexpr void __cordl_internal_set_uberMaterial(::UnityW<::UnityEngine::Material> value);

  /// @brief Method .ctor, addr 0x66e4dec, size 0x4, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr PostProcessPass_UberSetupBloomPassData();

public:
  // Ctor Parameters [CppParam { name: "", ty: "PostProcessPass_UberSetupBloomPassData", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  PostProcessPass_UberSetupBloomPassData(PostProcessPass_UberSetupBloomPassData&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "PostProcessPass_UberSetupBloomPassData", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  PostProcessPass_UberSetupBloomPassData(PostProcessPass_UberSetupBloomPassData const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 12827 };

