#pragma once
// IWYU pragma private; include "OVR/OpenVR/OpenVR.hpp"
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "../../cordl_internals/cordl_internals.hpp"
CORDL_MODULE_INIT
#include "System/zzzz__Object_def.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
#include <cstdint>
CORDL_MODULE_EXPORT(OpenVR)
namespace OVR::OpenVR {
class CVRApplications;
}
namespace OVR::OpenVR {
class CVRChaperoneSetup;
}
namespace OVR::OpenVR {
class CVRChaperone;
}
namespace OVR::OpenVR {
class CVRCompositor;
}
namespace OVR::OpenVR {
class CVRExtendedDisplay;
}
namespace OVR::OpenVR {
class CVRInput;
}
namespace OVR::OpenVR {
class CVROverlay;
}
namespace OVR::OpenVR {
class CVRRenderModels;
}
namespace OVR::OpenVR {
class CVRScreenshots;
}
namespace OVR::OpenVR {
class CVRSettings;
}
namespace OVR::OpenVR {
class CVRSpatialAnchors;
}
namespace OVR::OpenVR {
class CVRSystem;
}
namespace OVR::OpenVR {
class CVRTrackedCamera;
}
namespace OVR::OpenVR {
struct EVRApplicationType;
}
namespace OVR::OpenVR {
struct EVRInitError;
}
namespace OVR::OpenVR {
class OpenVR_COpenVRContext;
}
namespace System {
struct IntPtr;
}
// Forward declare root types
namespace OVR::OpenVR {
class OpenVR;
}
namespace OVR::OpenVR {
class OpenVR_COpenVRContext;
}
// Write type traits
MARK_REF_PTR_T(::OVR::OpenVR::OpenVR);
MARK_REF_PTR_T(::OVR::OpenVR::OpenVR_COpenVRContext);
// Dependencies System.Object
namespace OVR::OpenVR {
// Is value type: false
// CS Name: OVR.OpenVR.OpenVR/COpenVRContext
class CORDL_TYPE OpenVR_COpenVRContext : public ::System::Object {
public:
  // Declarations
  /// @brief Field m_pVRApplications, offset 0x50, size 0x8
  __declspec(property(get = __cordl_internal_get_m_pVRApplications, put = __cordl_internal_set_m_pVRApplications)) ::OVR::OpenVR::CVRApplications* m_pVRApplications;

  /// @brief Field m_pVRChaperone, offset 0x18, size 0x8
  __declspec(property(get = __cordl_internal_get_m_pVRChaperone, put = __cordl_internal_set_m_pVRChaperone)) ::OVR::OpenVR::CVRChaperone* m_pVRChaperone;

  /// @brief Field m_pVRChaperoneSetup, offset 0x20, size 0x8
  __declspec(property(get = __cordl_internal_get_m_pVRChaperoneSetup, put = __cordl_internal_set_m_pVRChaperoneSetup)) ::OVR::OpenVR::CVRChaperoneSetup* m_pVRChaperoneSetup;

  /// @brief Field m_pVRCompositor, offset 0x28, size 0x8
  __declspec(property(get = __cordl_internal_get_m_pVRCompositor, put = __cordl_internal_set_m_pVRCompositor)) ::OVR::OpenVR::CVRCompositor* m_pVRCompositor;

  /// @brief Field m_pVRExtendedDisplay, offset 0x40, size 0x8
  __declspec(property(get = __cordl_internal_get_m_pVRExtendedDisplay, put = __cordl_internal_set_m_pVRExtendedDisplay)) ::OVR::OpenVR::CVRExtendedDisplay* m_pVRExtendedDisplay;

  /// @brief Field m_pVRInput, offset 0x68, size 0x8
  __declspec(property(get = __cordl_internal_get_m_pVRInput, put = __cordl_internal_set_m_pVRInput)) ::OVR::OpenVR::CVRInput* m_pVRInput;

  /// @brief Field m_pVROverlay, offset 0x30, size 0x8
  __declspec(property(get = __cordl_internal_get_m_pVROverlay, put = __cordl_internal_set_m_pVROverlay)) ::OVR::OpenVR::CVROverlay* m_pVROverlay;

  /// @brief Field m_pVRRenderModels, offset 0x38, size 0x8
  __declspec(property(get = __cordl_internal_get_m_pVRRenderModels, put = __cordl_internal_set_m_pVRRenderModels)) ::OVR::OpenVR::CVRRenderModels* m_pVRRenderModels;

  /// @brief Field m_pVRScreenshots, offset 0x58, size 0x8
  __declspec(property(get = __cordl_internal_get_m_pVRScreenshots, put = __cordl_internal_set_m_pVRScreenshots)) ::OVR::OpenVR::CVRScreenshots* m_pVRScreenshots;

  /// @brief Field m_pVRSettings, offset 0x48, size 0x8
  __declspec(property(get = __cordl_internal_get_m_pVRSettings, put = __cordl_internal_set_m_pVRSettings)) ::OVR::OpenVR::CVRSettings* m_pVRSettings;

  /// @brief Field m_pVRSpatialAnchors, offset 0x70, size 0x8
  __declspec(property(get = __cordl_internal_get_m_pVRSpatialAnchors, put = __cordl_internal_set_m_pVRSpatialAnchors)) ::OVR::OpenVR::CVRSpatialAnchors* m_pVRSpatialAnchors;

  /// @brief Field m_pVRSystem, offset 0x10, size 0x8
  __declspec(property(get = __cordl_internal_get_m_pVRSystem, put = __cordl_internal_set_m_pVRSystem)) ::OVR::OpenVR::CVRSystem* m_pVRSystem;

  /// @brief Field m_pVRTrackedCamera, offset 0x60, size 0x8
  __declspec(property(get = __cordl_internal_get_m_pVRTrackedCamera, put = __cordl_internal_set_m_pVRTrackedCamera)) ::OVR::OpenVR::CVRTrackedCamera* m_pVRTrackedCamera;

  /// @brief Method CheckClear, addr 0x4076f84, size 0xa0, virtual false, abstract: false, final false
  inline void CheckClear();

  /// @brief Method Clear, addr 0x4076f60, size 0x18, virtual false, abstract: false, final false
  inline void Clear();

  static inline ::OVR::OpenVR::OpenVR_COpenVRContext* New_ctor();

  /// @brief Method VRApplications, addr 0x40769c8, size 0xbc, virtual false, abstract: false, final false
  inline ::OVR::OpenVR::CVRApplications* VRApplications();

  /// @brief Method VRChaperone, addr 0x40763fc, size 0xbc, virtual false, abstract: false, final false
  inline ::OVR::OpenVR::CVRChaperone* VRChaperone();

  /// @brief Method VRChaperoneSetup, addr 0x40764d0, size 0xbc, virtual false, abstract: false, final false
  inline ::OVR::OpenVR::CVRChaperoneSetup* VRChaperoneSetup();

  /// @brief Method VRCompositor, addr 0x40765a4, size 0xbc, virtual false, abstract: false, final false
  inline ::OVR::OpenVR::CVRCompositor* VRCompositor();

  /// @brief Method VRExtendedDisplay, addr 0x4076820, size 0xbc, virtual false, abstract: false, final false
  inline ::OVR::OpenVR::CVRExtendedDisplay* VRExtendedDisplay();

  /// @brief Method VRInput, addr 0x4076c44, size 0xbc, virtual false, abstract: false, final false
  inline ::OVR::OpenVR::CVRInput* VRInput();

  /// @brief Method VROverlay, addr 0x4076678, size 0xbc, virtual false, abstract: false, final false
  inline ::OVR::OpenVR::CVROverlay* VROverlay();

  /// @brief Method VRRenderModels, addr 0x407674c, size 0xbc, virtual false, abstract: false, final false
  inline ::OVR::OpenVR::CVRRenderModels* VRRenderModels();

  /// @brief Method VRScreenshots, addr 0x4076a9c, size 0xbc, virtual false, abstract: false, final false
  inline ::OVR::OpenVR::CVRScreenshots* VRScreenshots();

  /// @brief Method VRSettings, addr 0x40768f4, size 0xbc, virtual false, abstract: false, final false
  inline ::OVR::OpenVR::CVRSettings* VRSettings();

  /// @brief Method VRSpatialAnchors, addr 0x4076d18, size 0xbc, virtual false, abstract: false, final false
  inline ::OVR::OpenVR::CVRSpatialAnchors* VRSpatialAnchors();

  /// @brief Method VRSystem, addr 0x4076328, size 0xbc, virtual false, abstract: false, final false
  inline ::OVR::OpenVR::CVRSystem* VRSystem();

  /// @brief Method VRTrackedCamera, addr 0x4076b70, size 0xbc, virtual false, abstract: false, final false
  inline ::OVR::OpenVR::CVRTrackedCamera* VRTrackedCamera();

  constexpr ::OVR::OpenVR::CVRApplications* const& __cordl_internal_get_m_pVRApplications() const;

  constexpr ::OVR::OpenVR::CVRApplications*& __cordl_internal_get_m_pVRApplications();

  constexpr ::OVR::OpenVR::CVRChaperone* const& __cordl_internal_get_m_pVRChaperone() const;

  constexpr ::OVR::OpenVR::CVRChaperone*& __cordl_internal_get_m_pVRChaperone();

  constexpr ::OVR::OpenVR::CVRChaperoneSetup* const& __cordl_internal_get_m_pVRChaperoneSetup() const;

  constexpr ::OVR::OpenVR::CVRChaperoneSetup*& __cordl_internal_get_m_pVRChaperoneSetup();

  constexpr ::OVR::OpenVR::CVRCompositor* const& __cordl_internal_get_m_pVRCompositor() const;

  constexpr ::OVR::OpenVR::CVRCompositor*& __cordl_internal_get_m_pVRCompositor();

  constexpr ::OVR::OpenVR::CVRExtendedDisplay* const& __cordl_internal_get_m_pVRExtendedDisplay() const;

  constexpr ::OVR::OpenVR::CVRExtendedDisplay*& __cordl_internal_get_m_pVRExtendedDisplay();

  constexpr ::OVR::OpenVR::CVRInput* const& __cordl_internal_get_m_pVRInput() const;

  constexpr ::OVR::OpenVR::CVRInput*& __cordl_internal_get_m_pVRInput();

  constexpr ::OVR::OpenVR::CVROverlay* const& __cordl_internal_get_m_pVROverlay() const;

  constexpr ::OVR::OpenVR::CVROverlay*& __cordl_internal_get_m_pVROverlay();

  constexpr ::OVR::OpenVR::CVRRenderModels* const& __cordl_internal_get_m_pVRRenderModels() const;

  constexpr ::OVR::OpenVR::CVRRenderModels*& __cordl_internal_get_m_pVRRenderModels();

  constexpr ::OVR::OpenVR::CVRScreenshots* const& __cordl_internal_get_m_pVRScreenshots() const;

  constexpr ::OVR::OpenVR::CVRScreenshots*& __cordl_internal_get_m_pVRScreenshots();

  constexpr ::OVR::OpenVR::CVRSettings* const& __cordl_internal_get_m_pVRSettings() const;

  constexpr ::OVR::OpenVR::CVRSettings*& __cordl_internal_get_m_pVRSettings();

  constexpr ::OVR::OpenVR::CVRSpatialAnchors* const& __cordl_internal_get_m_pVRSpatialAnchors() const;

  constexpr ::OVR::OpenVR::CVRSpatialAnchors*& __cordl_internal_get_m_pVRSpatialAnchors();

  constexpr ::OVR::OpenVR::CVRSystem* const& __cordl_internal_get_m_pVRSystem() const;

  constexpr ::OVR::OpenVR::CVRSystem*& __cordl_internal_get_m_pVRSystem();

  constexpr ::OVR::OpenVR::CVRTrackedCamera* const& __cordl_internal_get_m_pVRTrackedCamera() const;

  constexpr ::OVR::OpenVR::CVRTrackedCamera*& __cordl_internal_get_m_pVRTrackedCamera();

  constexpr void __cordl_internal_set_m_pVRApplications(::OVR::OpenVR::CVRApplications* value);

  constexpr void __cordl_internal_set_m_pVRChaperone(::OVR::OpenVR::CVRChaperone* value);

  constexpr void __cordl_internal_set_m_pVRChaperoneSetup(::OVR::OpenVR::CVRChaperoneSetup* value);

  constexpr void __cordl_internal_set_m_pVRCompositor(::OVR::OpenVR::CVRCompositor* value);

  constexpr void __cordl_internal_set_m_pVRExtendedDisplay(::OVR::OpenVR::CVRExtendedDisplay* value);

  constexpr void __cordl_internal_set_m_pVRInput(::OVR::OpenVR::CVRInput* value);

  constexpr void __cordl_internal_set_m_pVROverlay(::OVR::OpenVR::CVROverlay* value);

  constexpr void __cordl_internal_set_m_pVRRenderModels(::OVR::OpenVR::CVRRenderModels* value);

  constexpr void __cordl_internal_set_m_pVRScreenshots(::OVR::OpenVR::CVRScreenshots* value);

  constexpr void __cordl_internal_set_m_pVRSettings(::OVR::OpenVR::CVRSettings* value);

  constexpr void __cordl_internal_set_m_pVRSpatialAnchors(::OVR::OpenVR::CVRSpatialAnchors* value);

  constexpr void __cordl_internal_set_m_pVRSystem(::OVR::OpenVR::CVRSystem* value);

  constexpr void __cordl_internal_set_m_pVRTrackedCamera(::OVR::OpenVR::CVRTrackedCamera* value);

  /// @brief Method .ctor, addr 0x40762e4, size 0x2c, virtual false, abstract: false, final false
  inline void _ctor();

protected:
  // Ctor Parameters []
  // @brief default ctor
  constexpr OpenVR_COpenVRContext();

public:
  // Ctor Parameters [CppParam { name: "", ty: "OpenVR_COpenVRContext", modifiers: "&&", def_value: None }]
  // @brief delete move ctor to prevent accidental deref moves
  OpenVR_COpenVRContext(OpenVR_COpenVRContext&&) = delete;

  // Ctor Parameters [CppParam { name: "", ty: "OpenVR_COpenVRContext", modifiers: "const&", def_value: None }]
  // @brief delete copy ctor to prevent accidental deref copies
  OpenVR_COpenVRContext(OpenVR_COpenVRContext const&) = delete;

  /// @brief IL2CPP Metadata Type Index
  static constexpr uint32_t __IL2CPP_TYPE_DEFINITION_INDEX{ 9041 };

  /// @brief Field m_pVRSystem, offset: 0x10, size: 0x8, def value: None
  ::OVR::OpenVR::CVRSystem* ___m_pVRSystem;

  /// @brief Field m_pVRChaperone, offset: 0x18, size: 0x8, def value: None
  ::OVR::OpenVR::CVRChaperone* ___m_pVRChaperone;

  /// @brief Field m_pVRChaperoneSetup, offset: 0x20, size: 0x8, def value: None
  ::OVR::OpenVR::CVRChaperoneSetup* ___m_pVRChaperoneSetup;

  /// @brief Field m_pVRCompositor, offset: 0x28, size: 0x8, def value: None
  ::OVR::OpenVR::CVRCompositor* ___m_pVRCompositor;

  /// @brief Field m_pVROverlay, offset: 0x30, size: 0x8, def value: None
  ::OVR::OpenVR::CVROverlay* ___m_pVROverlay;

  /// @brief Field m_pVRRenderModels, offset: 0x38, size: 0x8, def value: None
  ::OVR::OpenVR::CVRRenderModels* ___m_pVRRenderModels;

  /// @brief Field m_pVRExtendedDisplay, offset: 0x40, size: 0x8, def value: None
  ::OVR::OpenVR::CVRExtendedDisplay* ___m_pVRExtendedDisplay;

  /// @brief Field m_pVRSettings, offset: 0x48, size: 0x8, def value: None
  ::OVR::OpenVR::CVRSettings* ___m_pVRSettings;

  /// @brief Field m_pVRApplications, offset: 0x50, size: 0x8, def value: None
  ::OVR::OpenVR::CVRApplications* ___m_pVRApplications;

  /// @brief Field m_pVRScreenshots, offset: 0x58, size: 0x8, def value: None
  ::OVR::OpenVR::CVRScreenshots* ___m_pVRScreenshots;

  /// @brief Field m_pVRTrackedCamera, offset: 0x60, size: 0x8, def value: None
  ::OVR::OpenVR::CVRTrackedCamera* ___m_pVRTrackedCamera;

  /// @brief Field m_pVRInput, offset: 0x68, size: 0x8, def value: None
  ::OVR::OpenVR::CVRInput* ___m_pVRInput;

  /// @brief Field m_pVRSpatialAnchors, offset: 0x70, size: 0x8, def value: None
  ::OVR::OpenVR::CVRSpatialAnchors* ___m_pVRSpatialAnchors;

  static constexpr bool __IL2CPP_IS_VALUE_TYPE = false;
};
// Non member Declarations
static_assert(offsetof(::OVR::OpenVR::OpenVR_COpenVRContext, ___m_pVRSystem) == 0x10, "Offset mismatch!");

static_assert(offsetof(::OVR::OpenVR::OpenVR_COpenVRContext, ___m_pVRChaperone) == 0x18, "Offset mismatch!");

static_assert(offsetof(::OVR::OpenVR::OpenVR_COpenVRContext, ___m_pVRChaperoneSetup) == 0x20, "Offset mismatch!");

static_assert(offsetof(::OVR::OpenVR::OpenVR_COpenVRContext, ___m_pVRCompositor) == 0x28, "Offset mismatch!");

static_assert(offsetof(::OVR::OpenVR::OpenVR_COpenVRContext, ___m_pVROverlay) == 0x30, "Offset mismatch!");

static_assert(offsetof(::OVR::OpenVR::OpenVR_COpenVRContext, ___m_pVRRenderModels) == 0x38, "Offset mismatch!");

static_assert(offsetof(::OVR::OpenVR::OpenVR_COpenVRContext, ___m_pVRExtendedDisplay) == 0x40, "Offset mismatch!");

static_assert(offsetof(::OVR::OpenVR::OpenVR_COpenVRContext, ___m_pVRSettings) == 0x48, "Offset mismatch!");

static_assert(offsetof(::OVR::OpenVR::OpenVR_COpenVRContext, ___m_pVRApplications) == 0x50, "Offset mismatch!");

static_assert(offsetof(::OVR::OpenVR::OpenVR_COpenVRContext, ___m_pVRScreenshots) == 0x58, "Offset mismatch!");

static_assert(offsetof(::OVR::OpenVR::OpenVR_COpenVRContext, ___m_pVRTrackedCamera) == 0x60, "Offset mismatch!");

static_assert(offsetof(::OVR::OpenVR::OpenVR_COpenVRContext, ___m_pVRInput) == 0x68, "Offset mismatch!");

static_assert(offsetof(::OVR::OpenVR::OpenVR_COpenVRContext, ___m_pVRSpatialAnchors) == 0x70, "Offset mismatch!");

static_assert(::cordl_internals::size_check_v<::OVR::OpenVR::OpenVR_COpenVRContext, 0x78>, "Size mismatch!");

} // namespace OVR::OpenVR
// Dependencies System.Object
namespace OVR::OpenVR {
// Is value type: false
// CS Name: OVR.OpenVR.OpenVR
class CORDL_TYPE OpenVR : public ::System::Object {
public:
  // Declarations
  using COpenVRContext = ::OVR::OpenVR::OpenVR_COpenVRContext;

  /// @brief Field _OpenVRInternal_ModuleContext, offset 0xffffffff, size 0x8
  __declspec(property(get = getStaticF__OpenVRInternal_ModuleContext, put = setStaticF__OpenVRInternal_ModuleContext)) ::OVR::OpenVR::OpenVR_COpenVRContext* _OpenVRInternal_ModuleContext;

  /// @brief Field <VRToken>k__BackingField, offset 0xffffffff, size 0x4
  __declspec(property(get = getStaticF__VRToken_k__BackingField, put = setStaticF__VRToken_k__BackingField)) uint32_t _VRToken_k__BackingField;

